Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/image_editor/color_management.po
Languages: nl, uk

source: "Gamma-induced errors" is a topic outside the scope of this tutorial. But see "Gamma errors in picture scaling" (cited from this page) for gamma-induced tonality shifts; and of course see Timo Autiokari's informative (albeit somewhat infamous) website for a whole-hearted endorsement of using linear gamma working spaces (Timo's website seems to be down at present, though archived copies of his articles are still available through google). Bruce Lindbloom mentions a commonly-encountered gamma-induced error that is caused by incorrectly calculating luminance in a nonlinear RGB working space (see this page, sidenote 1). And in a similar vein, the calculations involved in mixing colors together to produce new colors (such as using a digital filter to add warmth to an image) result in gamma errors unless the new colors are calculated by first transforming all the relevant values back to their linear values.
nl: "Door gamma veroorzaakte fouten" is een onderwerp dat eigenlijk buiten de strekking van deze zelfstudie ligt. Maar bekijk "Gamma fouten in herschalen van beelden" (overgenomen uit: deze pagina) voor door gamma veroorzaakte verschuivingen in kleurtonen. En bekijk beslist ook Timo Autiokari's informatieve (ofschoon een beetje impopulaire) website voor een overtuigde aanbeveling voor lineaire gamma werkruimten. Bruce Lindbloom vermeldt een algemeen voorkomende door gamma veroorzaakte fout die wordt veroorzaakt door onjuiste berekening van helderheid in een niet-lineaire RGB werkruimte (zie deze pagina, terzijde-noot 1). En net zo vruchteloos, de berekeningen betreffende het mengen van kleuren om nieuwe kleuren te maken (zoals het gebruik van een digitaal filter om een beeld warmer te maken) resulteren in gamma-fouten tenzij de nieuwe kleuren worden berekend door vooraf alle relevante waarden terug om te zetten naar hun lineaire waarden.
uk: Тема «помилок, пов’язаних з гамою» виходить за межі цього посібника. Але ви можете ознайомитися з розділом «Помилки, пов’язані з гамою, при масштабуванні зображень» ("Gamma errors in picture scaling") (взято звідси), щоб дізнатися про пов’язані з гамою зсуви тональності; і, звичайно ж, ознайомитися з матеріалами інформативного (хоча і з дещо підмоченою репутацією) вебсайта Тімо Аутіокарі (Timo Autiokari), де наведено безпосередній опис використання лінійних робочих просторів гами (здається, зараз вебсайт Тімо не працює, але доступ до архівних копій статей все ще можна отримати за допомогою кешу google) Брюс Ліндблум (Bruce Lindbloom) згадує про поширену пов’язану з гамою помилку, яку спричинено неправильним обчисленням освітленості у нелінійному робочому просторі RGB (див. цю сторінку, sidenote 1). Крім того, обчислення, які використовуються під час змішування кольорів для створення нових кольорів (подібні до тих, які виконуються під час застосування фільтра потеплішання кольорів зображення) призводять до помилок у гамі, якщо нові кольори обчислюються за допомогою попереднього перетворення всіх відповідних значень до їх лінійних відповідників.

source: Unfortunately and despite their undeniable mathematical advantages, linear gamma working spaces have so few tones in the shadows that (in my opinion) they are impossible to use for editing if one is working in 8-bits, and still problematic at 16-bits. When the day comes when we are all doing our editing on 32-bit files produced by our HDR cameras on our personal supercomputers, I predict that we will all be using working spaces with gamma=1. Adobe Lightroom is already using a linear gamma working space "under the hood", CS2 allows the option of using linear gamma for mixing colors, and Lightzone has always used a linear gamma working space.
nl: Helaas, en ondanks hun ontegenzeggelijke rekenkundige voordelen, beschikken werkruimten met lineaire gamma over zo weinig kleurtonen in de schaduwen dat (naar mijn mening) ze onmogelijk te gebruiken zijn voor bewerking als we in 8-bits werken en ook nog maar met moeite in 16-bits. Ik voorzie dat we in de toekomst voor het bewerken (op super pc's) van, door onze HDR camera's geleverde, 32-bits bestanden, allemaal werkruimten met gamma=1 zullen gebruiken. Adobe Lightroom maakt al gebruik van lineaire gamma werkruimten (zonder dat dat vermeld word), CS2 biedt de mogelijkheid om een lineaire gamma te gebruiken voor het mengen van kleuren en Lightzone heeft altijd al een lineaire gamma werkruimte gebruikt.
uk: На жаль і усупереч незаперечним математичним перевагам, робочі простори з лінійними гамами містять так мало тонів у тінях, що (на думку автора цього підручника) ними неможливо користуватися для редагування, якщо ви працюєте з 8-бітовими кольорами, і проблематично користуватися за 16-бітових кольорів. Коли настане день, коли ми зможемо редагувати наші 32-бітові зображення, створені за допомогою фотоапаратів з високим динамічним діапазоном на наших персональних суперкомп’ютерах, можна бути певним, ми користуватимемося робочими просторами з гама=1. Adobe Lightroom вже перейшов на неявне використання робочого простору з лінійною гамою, у CS2 передбачено пункт, який вмикає використання лінійної гами для змішування кольорів, а програма Lightzone завжди використовувала робочий простір з лінійною гамою.

source: How many discrete tonal steps are there in a digital image?
nl: Hoeveel afzonderlijke tonale stapjes heeft een digitaal beeld?
uk: Скільки дискретних тональних переходів у цифровому зображенні?

source: In an 8-bit image, you have 256 tonal steps from solid black to solid white. In a 16-bit image theoretically you have 65536 steps. But remember, those 16-bits started out as either 10 bits (=1024 steps), 12 bits (=4096 steps), or 14 bits (=16384 steps) as produced by the camera's A-to-D converter - the extra bits to reach 16-bits start out as just padding. The available tones are not distributed evenly from light to dark. In linear gamma mode (as the camera sensor sees things), there's a whole lot more tones in the highlights than in the shadows. Hence the advice, if you shoot raw, to "expose to the right but don't blow the highlights". See Ron Bigelow's articles on "why raw", for a full discussion of the distribution of available tones in a raw image.
nl: In een 8-bits beeld zitten 256 tonale stapjes van pikzwart tot helderwit. In een 16-bits beeld, theoretisch, 65536 stapjes. Maar de 16-bits begonnen als: ofwel 10 bits (=1024 stapjes), 12 bits (=4096 stapjes), of 14 bits (=16384 stapjes) zoals geleverd door de A-to-D converter van de camera - de extra bits om 16-bits te bereiken zijn slechts opvulling. De beschikbare kleurtonen zijn niet gelijkmatig verdeeld van licht tot donker. In de modus lineaire gamma (zoals de camerasensor het ziet) zijn heel wat meer tonen in de heldere plekken dan in de schaduwen. Vandaar het advies, als je raw schiet, om langer te belichten maar niet de heldere plekken op te blazen. Zie Ron Bigelow's artikel over "waarom in raw", voor een uitgebreide discussie over de distributie van beschikbare tonen in een raw-opname.
uk: На 8-бітовому зображенні ви зможете побачити 256 тональних переходів від повністю чорного до повністю білого кольору На 16-бітовому зображенні теоретично таких переходів буде 65536 таких переходів Але пам’ятайте, що ці 16-бітові кольори було створено на основі 10-бітових (=1024 переходів), 12-бітових (=4096 переходів) або 14-бітових (=16384 переходів) кольорів, отриманих від вбудованого інструменту перетворення фотоапарата, — решта бітів доповнення до 16 отримано простим доповненням Отримані тони розподілено нерівномірно від світлих до темних. У режимі лінійної гами (у якому «бачить» речі матриця фотоапарата) на світлих ділянках набагато більше тонів, ніж на темних. Отже порада буде такою: якщо ви знімаєте для створення цифрового негатива, обирайте правильну експозицію, але так, щоб світлі ділянки не було переекспоновано. Докладніше обговорення щодо розподілу тонів на зображеннях цифрових негативів можна дізнатися зі статей Рона Бігелоу (Ron Bigelow) щодо вибору цифрових негативів.

source: Should I use a large-gamut or a small-gamut working space?
nl: Moet ik een grote of een kleine gammawerkruimte gebruiken?
uk: Який з робочих просторів слід вибрати: з широкою чи з вузькою палітрою?

source: One major consideration in choosing a working space is that some working spaces are bigger than others, meaning they cover more of the visible spectrum (and as a consequence include some imaginary colors - mathematical constructs that don't really exist). These bigger spaces offer the advantage of allowing you to keep all the colors captured by your camera and preserved by the LCMS conversion from your camera profile to the super-wide-gamut profile connection space and out again to your chosen working space.
nl: Een belangrijke overweging bij het kiezen van een werkruimte is dat sommige werkruimten groter zijn dan andere. Dat betekent dat ze een groter deel van het waarneembare spectrum bestrijken(en daardoor tevens denkbeeldige kleuren bevatten, rekenkundige constructies die niet werkelijk bestaan). Deze grotere ruimten bieden het voordeel van het behoud van alle kleuren, vastgelegd door uw camera en opgeslagen door de LCMS bij de conversie van uw cameraprofiel naar het super-brede-gamma profiel, aansluitend op de door u gekozen werkruimte.
uk: Однією з основних проблем при виборі робочого простору є те, що деякі з робочих просторів ширші за інші, тобто вкривають більшу область видимого спектру (а отже включають певні уявні кольори — математичні конструкти, яких насправді не існує). Перевагою таких ширших просторів є збереження всіх кольорів, отриманих за допомогою фотографування і збережених під час перетворення LCMS з профілю вашого фотоапарата у простір з’єднання з дуже широкою палітрою та наступного перетворення у вибраний вами робочий простір.

source: But keeping all the possible colors comes at a price, as explained below. And it seems that any given digital image likely only contains a small subset of all the possible visible colors that your camera is capable of capturing. This small subset is easily contained in one of the smaller working spaces (an exception requiring a larger color gamut would be a picture of a highly saturated object such as yellow daffodil).
nl: Maar het behoud van alle mogelijke kleuren is niet zonder consequenties zoals u zult zien. En het lijkt er op dat elk digitaal beeld een kleine reeks bevat van alle mogelijke zichtbare kleuren die uw camera kan vastleggen. Deze reeks past gemakkelijk in een van de kleinere werkruimten (een uitzondering die een groter kleurengamma vereist zou een opname zijn van een hoog verzadigd onderwerp zoals een gele narcis).
uk: Але збереження всіх можливих кольорів має свою ціну, про яку ми поговоримо нижче. Крім того, ймовірно, довільне цифрове зображення містить лише невелику підмножину всіх можливих видимих кольорів, які здатен зареєструвати ваш фотоапарат. Ця мала підмножина з легкістю вкладається у один з менших робочих просторів (винятком, де потрібні ширші палітри кольорів, будуть зображення об’єктами з високою насиченістю кольорів, наприклад, жовті нарциси).

source: Using a very large working space means that editing your image (applying curves, increasing saturation, etc.) can easily produce colors that your eventual output device (printer, monitor) simply cannot reproduce (you cannot see these colors while you're editing, either). So the conversion from your working space to your output device space (say your printer) will have to remap the out-of-gamut colors in your edited image, some of which might even be totally imaginary, to your printer color space with its much smaller color gamut. This remapping process will lead to inaccurate colors and loss of saturation at best. Even worse, the remapping can easily lead to banding (posterization - gaps in what should be a smooth color transition, say, across an expanse of blue sky) and clipping (e.g. your carefully crafted muted transitions across delicate shades of red, for example, might get remapped to a solid block of dull red after conversion to your printer's color space). Also, the experts say that 8-bit images just don't have enough tones to stretch across a wide gamut working space without banding and loss of saturation, even before conversion to an output space. So if you choose a large gamut working space, make sure you start with a 16-bit image.
nl: Werken met een erg grote kleurruimte betekent dat bij de bewerking (gebruik van krommen, verhogen van verzadiging) kleuren gemaakt kunnen worden die niet door het beeldscherm of de printer weergegeven kunnen worden. (U kunt die kleuren ook niet zien tijdens de bewerking). Zodat bij de conversie van kleurwerkruimte naar uitvoerapparatuur, bv. printer, de buiten het gamma vallende kleuren (sommigen misschien wel denkbeeldig), van uw bewerkte beeld opnieuw in kaart moeten worden gebracht voor de uitvoerapparatuur met een kleiner kleurengamma. Erger, het kan leiden tot "postervorming", zeg maar, hiaten in wat een geleidelijke kleurovergang zou moeten zijn (bijvoorbeeld het verloop in een blauwe lucht). Ook kan het gemakkelijk leiden tot onjuiste kleuren of verlies van verzadiging en clipping (aftoppen). Met andere woorden, uw vakkundig gevormde overgangen tussen delicate rode tinten kunnen veranderen in een massief blok saai rood na de conversie voor de kleurruimte van uw printer. Experts zeggend dat 8-bits beelden niet voldoende tinten bezitten om een breed gamma af te dekken, zelfs voor de conversie naar een andere kleurruimte. Dus als u kiest voor een werkruimte met een breed gamma, begin dan met een 16-bits beeld.
uk: Використання дуже широкого робочого простору кольорів означає, що редагування вашого зображення (застосування кривих, збільшення насиченості тощо) може легко призвести до того, що ваш остаточний пристрій виводу даних (принтер, монітор) просто не зможе відтворити ці кольори (ви, звичайно ж, не зможете бачити їх і під час редагування). Отже, під час перетворення з вашого робочого простору до вашого пристрою виводу даних (наприклад, принтера) доведеться відображати кольори вашого зображення, які перебувають поза палітрою (вони можуть бути навіть суто уявними), на простір кольорів вашого принтера, який має набагато вужчу палітру. Цей процес відображення, за найкращих умов, призведе до неточностей у кольорах і втрати насиченості. За найгірших же умов, відображення може призвести до утворення смуг (постеризації — пробілів там, де повинен бути плавний перехід кольорів, наприклад, на синьому небі) та обрізання (наприклад, ретельно створений вами плавний перехід тонів рожевого може стати суцільною ділянкою тьмяно-червоного кольору після перетворення до простору кольорів принтера). Крім того, знавці стверджують, що у 8-бітових зображеннях просто не вистачає тонів для покриття всієї палітри робочого простору без утворення смуг і втрати насиченості, навіть до перетворення до простору виводу даних. Отже, якщо ви оберете робочий простір з широкою гамою, переконайтеся, що ви редагуєте саме 16-бітове зображення.

source: To summarize, large gamut working spaces, improperly handled, can lead to lost information on output. Small gamut working spaces can clip information on input. Medium-sized gamut working spaces try to strike a happy medium. Like Wikipedia says, it's a trade-off.
nl: Samenvattend, onjuist gebruik van kleurwerkruimten met een breed gamma kan leiden tot verlies van informatie (data) in de uitvoer. Kleine kleurruimten kunnen informatie afknijpen bij het invoeren. Middelgrote kleurruimten trachten de gulden middenweg te vinden. Zoals wikipedia stelt, het is een kwestie van kiezen.
uk: Підбиваючи підсумки, використання робочих просторів з широкою палітрою, за умов неправильної обробки, може призвести до втрати даних на виході. Використання робочих просторів з вузькою палітрою може призвести до обрізання даних на вході. Використання робочих просторів з палітрою середніх розмірів може бути «золотою» серединою. Як повідомляє нам Вікіпедія, це завжди компроміс.

source: Here are some oft-repeated bits of advice on choosing a working space:
nl: Hier zijn enkele vaak herhaalde tips bij het kiezen van een werkruimte:
uk: Ось декілька з основних порад щодо вибору робочого простору:

source: For images intended for the web, use (or at least convert the final image to) sRGB.
nl: Voor beelden bestemd voor het web, gebruik (of transformeer het beeld naar) sRGB.
uk: Для зображень, призначених для інтернету, використовуйте (або принаймні перетворіть остаточне зображення) простір sRGB.

source: For the most accuracy in your image editing (that is, making the most of your limited "bits" with the least risk of banding or clipping when you convert your image from your working space to an output space), use the smallest working space that includes all the colors in the scene that you photographed, plus a little extra room for those new colors you intentionally produce as you edit.
nl: Gebruik, om uw afbeelding zo accuraat mogelijk te bewerken, de kleinst mogelijke werkruimte die alle kleuren bevat van de opname die u heeft gemaakt. Plus nog een beetje extra ruimte voor die kleuren die u gaat maken tijdens het bewerken. Op die manier haalt u zonder vorming van banden of aftoppen het meeste uit de beperkte hoeveelheid bits van uw afbeelding bij de conversie van uw werkruimte naar de uiteindelijke kleurruimte.
uk: Щоб збільшити точність вашого редагування зображень (тобто найкраще скористатися обмеженою кількістю бітів без утворення смуг і обрізання під час перетворення вашого зображення у простір кольорів виводу), використовуйте найменший робочий простір, який містить всі кольори об’єкта, який ви фотографували плюс невеличкий додатковий простір для тих кольорів, які ви створите під час редагування.

source: If you are working in 8-bits rather than 16-bits, choose a smaller rather than a larger working space to avoid clipping and banding.
nl: Als u werkt in 8-bits i.p.v. 16-bits, kiest u een kleinere werkruimte in plaats van een grotere om afkapping en bandvorming te voorkomen.
uk: Якщо ви працюєте з 8-бітовими кольорами, а не з 16-бітовими, оберіть вужчий робочий простір, щоб уникнути стинання або появи смуг на зображенні.

source: For archival purposes, convert your raw file to a 16-bit tiff with a large gamut working space to avoid loosing color information. Then convert this archival tiff to your medium-gamut or large-gamut working space of choice (saving the converted working tiff under a new name, of course).
nl: Zet, voor archiveringsdoeleinden, uw RAW-bestand om naar een 16-bits tiff bestand met een grote gamut-werkruimte om te vermijden dat gegevens over kleurinformatie verloren raken. Converteer daarna dit tiff bestand naar de gewenste middel- of grote gamma-werkruimte. (sla het geconverteerde tiff bestand onder een nieuwe naam op)
uk: Якщо метою є додавання зображень до архіву, перетворіть ваш файл цифрового негатива на 16-бітовий tiff у робочому просторі з широкою палітрою, щоб уникнути втрати даних щодо кольору. Потім перетворіть цей архівний tiff у вибраний вами робочий простір з палітрою середнього або великого розміру (перетворений робочий tiff, звичайно ж, слід зберегти з іншою назвою).

source: For more information on choosing a working space, see this page, Information about RGB Working Spaces for a visual comparison of the gamut (array of included colors) of the various working color spaces. See here and here for a pro- and con- presentation, respectively, of the merits of using large gamut working spaces. And while you are on the cambridgeincolour.com website, check out the tutorial on color management.
uk: Докладніше про вибір робочого простору можна дізнатися за цією адресою, де наведено відомості щодо робочих просторів RGB для візуального порівняння палітри (масиву кольорів, що у ній містяться) для різноманітних робочих просторів кольорів. Див. тут і тут, щоб дізнатися про переваги та недоліки, відповідно, використання робочих просторів з широкою палітрою. Не полишаючи сайт cambrideincolour.com, ознайомтеся з посібником з керування кольорами, що на ньому зберігається.

source: The sRGB color space
nl: De sRGB kleurruimte
uk: Простір кольорів sRGB

source: What is so special about the sRGB color space?
nl: Wat is er zo speciaal aan de sRGB kleurruimte?
uk: Що такого особливого у просторі кольорів sRGB?

source: sRGB is widely accepted as a standard color profile by virtually everyone involved with consumer-oriented imaging. sRGB was proposed in 1996 by Hewlett Packard and Microsoft as a standardized color space for consumer-oriented applications. As stated in the initial HP/MS proposal:
uk: sRGB вважається стандартним профілем кольорів майже повсюди, де виконується зорієнтоване на споживача відтворення зображень. sRGB було запропоновано у 1996 році компаніями Hewlett Packard і Microsoft, як стандартний колір для зорієнтованих на споживача програм. Як записано у початковій пропозиції HP/MS:

source: Hewlett-Packard and Microsoft propose the addition of support for a standard color space, sRGB, within the Microsoft operating systems, HP products, the Internet, and all other interested vendors. The aim of this color space is to complement the current color management strategies by enabling a third method of handling color in the operating systems, device drivers and the Internet that utilizes a simple and robust device independent color definition. This will provide good quality and backward compatibility with minimum transmission and system overhead. Based on a calibrated colorimetric RGB color space well suited to Cathode Ray Tube (CRT) monitors, television, scanners, digital cameras, and printing systems, such a space can be supported with minimum cost to software and hardware vendors...
uk: Hewlett-Packard і Microsoft пропонують додати підтримку для стандартного простору кольорів, sRGB, у операційні системи Microsoft, продукти HP, інтернет та продукти всіх інших зацікавлених компаній. Метою використання цього простору кольорів є доповнення поточних стратегій керування кольорами уможливленням третього способу обробки кольорів у операційних системах, драйверах пристроїв та інтернеті, такого, який би використовував просте і стійке незалежне від пристроїв визначення кольорів. Таким чином, буде забезпечено пристойну якість та зворотну сумісність з мінімальним навантаженням на канали передавання даних та систему. Заснований на каліброваному колориметричному просторі кольорів RGB, що добре пасує до електропроменевих (CRT) моніторів, телебачення, сканерів, цифрових фотокамер та систем друку, подібний простір може бути підтримано за мінімальних витрат постачальниками програмного та апаратного забезпечення...
