Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/image_editor/color_management.po
Languages: nl, uk

source: Color Management in digiKam Image Editor
nl: Kleurbeheer in afbeeldingsbewerker van digiKam
uk: Керування кольорами у редакторі digiKam

source: digiKam, documentation, user manual, photo management, open source, free, learn, easy
nl: digiKam, documentatie, gebruikershandleiding, fotobeheer, open-source, vrij, leren, gemakkelijk
uk: digiKam, документація, підручник користувача, керування фотографій, відкритий код, вільний, навчання, простий

source: Color Management
nl: Kleurbeheer
uk: Керування кольорами

source: Contents
nl: Inhoud
uk: Зміст

source: RAW File Treatment and Color Management
nl: Behandeling van RAW-bestand en kleurbeheer
uk: Обробка файлів цифрових негативів та керування кольорами

source: The point of a color-managed workflow is to ensure that the colors coming from your camera or scanner have a predictable relationship with the colors you actually photographed or scanned, that the colors displayed on your monitor match the colors coming from your camera or scanner, and that the colors you print or display on the web match the colors you produced in your digital darkroom.
nl: Het punt van een kleurbeheer is om er zeker van te zijn dat de kleuren uit uw camera of scanner een voorspelbare relatie hebben met de kleuren die zijn gefotografeerd of gescand, dat de kleuren weergegeven op uw monitor overeenkomen met de kleuren uit uw camera of scanner en dat de kleuren die u afdrukt of weergeeft op het web overeenkomen met de kleuren die u in uw digitale donkere kamer hebt gemaakt.
uk: Основним питання роботи з керуванням кольорами є забезпечення передбачуваної відповідності кольорів зображення, які було отримано за допомогою фотоапарата або сканера, кольорам справжніх об’єктів зйомки та сканованих зображень; відповідності кольорів, які ви бачите на моніторі, кольорам, які було отримано у результаті зйомки або сканування, та відповідності кольорів надрукованих або оприлюднених у мережі зображень кольорам зображень, створених у результаті цифрової обробки знімків.

source: Which buttons do I push?
nl: Welke knoppen moet ik indrukken?
uk: Які кнопки слід натискати?

source: When it comes to color management, everyone wants to know, "which buttons do I push to get the results I want". Unfortunately, color management of necessity involves making informed choices at every step along the image-processing workflow. The purpose of this tutorial is to provide sufficient background information on color management, along with links to more in-depth information, to enable you to begin to make your own informed decisions, based on your own desired results.
nl: Als het tot kleurbeheer komt wil iedereen weten, "welke knoppen moet ik indrukken om het gewenste resultaat te krijgen". Helaas maakt kleurbeheer het nodig om geïnformeerde keuzes te maken bij elke stap in de workflow van afbeeldingsbewerking. Het doel van deze handleiding is om voldoende achtergrondinformatie te leveren over kleurbeheer, naast koppelingen naar meer diepgaande informatie, om u in staat te stellen om te beginnen met het maken van uw eigen geïnformeerde beslissingen, gebaseerd op door u gewenste resultaten.
uk: Коли йдеться про керування кольорами, найпоширенішим питанням є просте питання: «Які кнопки мені слід натиснути, щоб отримати бажані результати?» На жаль, керування кольорами не передбачає єдиної відповіді на це питання: на кожному з кроків обробки зображення вам доведеться робити осмислений вибір. Метою цього підручника є надання вам достатніх базових знань з керування кольорами та посилань на докладніші відомості. На основі отриманих знань ви зможете робити обґрунтований вибір, який залежатиме від потрібних вам результатів.

source: Is there anyone who doesn't need to worry about color management?
nl: Is er iemand die zich geen zorgen hoeft te maken over kleurbeheer?
uk: Кому не потрібне керування кольорами?

source: If your imaging workflow meets all six criteria listed below, then you don't need to worry about color management.
nl: Als uw workflow voor afbeeldingen aan alle zes onderstaand getoonde criteria voldoet, dan hoeft u zich geen zorgen te maken over kleurbeheer.
uk: Якщо ваш спосіб обробки зображень відповідає шістьом переліченим нижче критеріями, вам не потрібно перейматися керуванням кольорами.

source: You are working at a monitor properly calibrated to the sRGB color space (more about that below).
nl: U werkt op een monitor die juist is gekalibreerd op de sRGB kleurruimte (meer hierover later).
uk: Ви працюєте за монітором, який належним чином відкалібровано для простору кольорів sRGB (докладніше про це нижче).

source: Your imaging workflow starts with an in-camera-produced jpeg already in the sRGB color space.
nl: Uw workflow voor afbeeldingen start met een in de camera gemaakte jpeg die zich al in de sRGB kleurruimte bevindt.
uk: Ваш процес обробки зображень починається з файла jpeg, створеного фотоапаратом, який працює у просторі кольорів sRGB.

source: You work exclusively in the sRGB color space for editing.
nl: U werkt uitsluitend in de sRGB kleurruimte voor bewerking.
uk: Ви працюєте лише з простором sRGB під час редагування.

source: Your printer wants images in the sRGB color space.
nl: Uw printer wil afbeeldingen in de sRGB kleurruimte.
uk: Для вашого принтера потрібні зображення у просторі кольорів sRGB.

source: Your scanner produces images in the sRGB color space.
nl: Uw scanner produceert afbeeldingen in de sRGB kleurruimte.
uk: Ваш сканер створює зображення у просторі кольорів sRGB.

source: Your only other image output is via email or the web, where sRGB is the de facto standard.
nl: Uw enige andere uitvoer van afbeeldingen is via e-mail of het web, waar sRGB de de facto standaard is.
uk: Іншими джерелами потрібних вам зображень є електронна пошта та інтернет, де sRGB є фактичним стандартом.

source: More definitions about Color Management
nl: Meet definities over kleurbeheer
uk: Додаткові означення, пов’язані із керуванням кольорами

source: You've reached the end of this tutorial on color management. We've "color-managed" our way all the way from the camera and the monitor, to the working space, to the printer. I've learned a lot and I hope you have, too. What follow is some additional comments and definitions:
nl: U bent aan het einde gekomen van deze zelfstudie over kleurbeheer. We hebben onze kleurbeheer-route van camera en beeldscherm tot werkruimte tot printer voltooid. Ik heb er veel van geleerd en hopelijk u ook. Wat nu volgt zijn aanvullende opmerkingen en definities.
uk: Ну ось ви і дочитали цей посібник щодо керування кольорами. Ми прослідкували за всім процесом керування кольорами, починаючи від фотоапарата і монітора і закінчуючи робочим простором і принтером. Під час створення цього посібника автор багато чому навчився, сподіваюся і ви також знайшли у ньому щось корисне. Нижче наведено деякі додаткові коментарі та визначення:

source: Assign a profile means change the meaning of the RGB numbers in an image by embedding a new profile without changing the actual RGB numbers associated with each pixel in the image. "Convert" to a profile means embed a new profile, but also change the RGB numbers at the same time so that the meaning of the RGB values - that is, the real-world visible color represented by the trio of RGB numbers associated with each pixel in an image - remains the same before and after the conversion from one space to another.
nl: Toewijzen van een profiel houdt in, het wijzigen van de RGB getallen in een beeld door een nieuw profiel in te brengen zonder de eigenlijke RGB getallen van elke pixel te wijzigen. Converteren naar een profiel betekent een nieuw profiel inbrengen en tevens de RGB getallen wijzigen zodat de betekenis van de RGB waarden (dat is de zichtbare kleur die door de RGB-waarden van iedere pixel wordt gevormd) hetzelfde blijft, voor en na de conversie van de ene ruimte naar de andere ruimte.
uk: Призначити профіль означає змінити значення трійок чисел RGB на зображенні вбудовуванням нового профілю без зміни самих числових значень RGB, пов’язаних з кожним з пікселів зображення. «Перетворити» у профіль означає вбудувати новий профіль, але вже зі зміною чисел RGB відповідно до значень RGB — тобто видимих кольорів, яким відповідають трійки чисел RGB, пов’язані з кожним з пікселів зображення, — так, щоб вони були однаковими до і після перетворення з одного простору у інший.

source: On the other hand, every time you assign a new working space profile rather than convert to a new working space (except when initially assigning a camera profile to the image file you get from your raw processing software), the appearance of the image should more or less drastically change (usually for the worse, unless the wrong profile had previously been inadvertently embedded in the image).
nl: Aan de andere kant, elke keer dat u een nieuw werkruimteprofiel toewijst in plaats van conversie naar een nieuwe werkruimte te kiezen, zal het uiterlijk van het beeld min of meer drastisch veranderen. Behalve wanneer u bij aanvang een cameraprofiel toewijst aan de afbeelding die u krijgt van uw raw-verwerkende software maar meestal wordt het slechter.
uk: З іншого боку, кожного разу, коли ви призначаєте новий робочий простір, а не перетворюєте зображення у новий робочий простір (за винятком випадків, коли профіль фотоапарата призначається до файла зображення, який ви отримуєте від вашого програмного забезпечення з обробки цифрових негативів), вигляд зображення має більшою чи меншою мірою змінитися (зазвичай, погіршитися, якщо до зображення раніше не було ненавмисно вбудовано помилковий профіль).

source: In theory, you should be able to do multiple conversions of an image from one working space to another, and if you are using a color-managed image editor, even though all the RGB numbers in the image will change with each conversion, the image displayed on your screen should look the same. In actual fact, because of rounding errors upon each conversion, not to mention gamut-clipping when going from a larger to a smaller working space, every time you convert from one space to another the image degrades a bit.
nl: In theorie zou u meerdere conversies van een kleurruimte naar een andere van een afbeelding kunnen maken. En als u een bewerkingsprogramma met kleurbeheer gebruikt zou het beeld er op het scherm telkens hetzelfde uit moeten zien. Maar feitelijk raakt het beeld met iedere conversie verder in verval door afrondingen van rekenresultaten en afknijpen van heldere of donkere delen in de afbeelding.
uk: Теоретично, у вас має бути можливість виконати декілька перетворень зображення з одного робочого простору у інший, і хоча всі трійки чисел RGB на зображенні змінюватимуться під час кожного з перетворень, зображення, показане на екрані, має залишатися незмінним. Насправді ж, через помилки округлення під час кожного з перетворень, вже не кажучи про обрізання палітри під час переходів від ширших до вужчих робочих просторів, кожне з перетворень з одного простору у інший призводитиме до втрати якості зображення.

source: Device-dependent and device-independent profiles: The camera profile, a scanner profile, your monitor's profile, and your printer's color profile are all device-dependent profiles - these profiles only work with the specific device for which they were produced by means of profiling. Working space profiles and the PCS's are "device-independent". Once an image file has been translated by LCMS via a PCS to a device-independent working space, in a sense it no longer matters what device originally produced the image. But as soon as you want to display or print the image, then the device (monitor, printer) used matters a great deal and requires a device-dependent profile.
nl: Apparaat-afhankelijke en Apparaat-onafhankelijke profielen: het cameraprofiel, een scannerprofiel, uw beeldschermprofiel en het kleurprofiel van uw printer zijn allen apparaat-afhankelijke profielen. Deze profielen werken alleen met het specifieke apparaat waarvoor ze werden ontwikkeld. Werkruimteprofielen en de PCS-en (profiel-verbindende kleurruimten) zijn apparaat-onafhankelijk. Wanneer een afbeeldingsbestand vertaald is door een LCMS (Little Color Management System) via een PCS naar een apparaat-onafhankelijke werkruimte maakt het niet langer uit door welk apparaat het afbeeldingsbestand oorspronkelijk werd aangemaakt. Maar zo gauw u het beeld op een ander beeldscherm wilt tonen of het printen, dan maakt het veel uit welk apparaat wordt gebruikt en is een apparaat-afhankelijk profiel vereist.
uk: Залежні від пристрою і незалежні від пристрою профілі: профіль фотоапарата, профіль сканера, профіль вашого монітора та профіль кольорів вашого принтера є залежними від пристроїв профілями. Ці профіль працюють лише для окремих пристроїв, для яких їх було створено шляхом профілювання. Профілі робочих просторів і PCS є «незалежними від пристроїв». Після того, як файл зображення буде перетворено за допомогою LCMS і за посередництва PCS на незалежний від пристрою робочий простір, більше не матиме значення, за допомогою якого саме пристрою було створено зображення. Але, тільки-но ви вирішите, що ваше зображення слід показати або надрукувати, параметри використаного пристрою (монітора, принтера) матимуть велике значення, а для показу чи друку знадобиться залежний від пристрою профіль.

source: Linear has two related and easily confused definitions. "Linear" can mean that the image tonality reflects the tonality in the original scene as photographed instead of being altered by the application of an S-curve or other means of changing local and global tonality. It can also mean that the gamma transfer curve of the color space is linear. An image can be "linear" in either, both, or neither of these two senses. A raw image as developed by Libraw is linear in both senses. The same image as developed by Canon's DPP won't be linear in either sense.
uk: Слово «лінійне» має два пов’язаних між собою визначення, які легко сплутати. «Лінійне» може означати, що тональність зображення відповідає тональності початкових об’єктів під час фотографування і її не було змінено застосуванням S-кривої (кривої насиченості) або іншого способу зміни локальної і глобальної тональності. Крім того, це може означати, що крива перетворення гами простору кольорів є лінійною. Зображення може бути «лінійним» у межах одного з цих означень, обох означень або жодного з означень. Зображення цифрового негатива, створене за допомогою libraw, є лінійним у межах обох означень. Те саме зображення, створене за допомогою програми DPP від Canon, не буде лінійним за жодного з означень.

source: HDR and LDR do not refer to the bit-depth of the image. "High dynamic range" and "low dynamic range" refer to the total dynamic range encompassed by an image. A regular low dynamic range image, say encompassing a mere 5 "stops" (the average digital camera these days can easily accommodate 8 or 9 stops), can be saved as an 8-, 16-, 32-, or even 64-bit image, depending on your software, but the dynamic range of the image isn't thereby increased. Only the number of discrete steps from the brightest to the darkest tone in the image has changed. Conversely, a 22-stop scene (way beyond the capacity of a consumer-oriented digital camera without using multiple exposures) can be saved as an 8- or 16-bit image, but the resulting image will exhibit extreme banding (that is, it will display extreme banding in any given tonal range that can actually be displayed on a typical monitor at one time) because of the relatively few available discrete tonal steps from the lightest to the darkest tone in the image.
nl: HDR en LDR verwijzen niet naar de bitdiepte van een afbeelding. "High dynamic range" en "low dynamic range" verwijzen naar het totale dynamische bereik van een beeld. Een gewoon beeld met een laag dynamisch bereik, zeg maar, 5 diafragmastapjes kan opgeslagen worden als, 8-, 16-, 32-, of zelfs 64-bits afhankelijk van de software. (Een tegenwoordige digitale camera kan gemakkelijk 8 of 9 diafragmastapjes bevatten). Maar het dynamische bereik van het beeld wordt daardoor niet gewijzigd. Slechts het aantal afzonderlijke stapjes van de helderste tot de donkerste tonen is gewijzigd. Omgekeerd kan een 22-staps (wat in een eenvoudige camera niet haalbaar is) eenvoudig beeld opgeslagen worden als een 8-bits of 16-bits beeld maar het resultaat zal verschijnselen van extreme bandvorming te zien geven door de relatief geringe beschikbare stapjes van lichte tot donkere tonen in de afbeelding. Het zal extreme bandvorming laten zien in elk toonbereik op het beeldscherm.
uk: Визначення HDR (високий динамічний діапазон) та LDR (низький динамічний діапазон) не пов’язано з бітовою глибиною кольорів зображення. Ці визначення стосуються загального динамічного діапазону, що вкривається кольорами зображення. Звичайне зображення з низьким динамічним діапазоном, який вкриває, скажімо, всього лише 5 «інтервалів» (посередній сучасний фотоапарат з легкістю може дати 8 або 9 інтервалів), можна зберегти як 8-, 16-, 32- або навіть 64-бітове зображення, залежно від вашого програмного забезпечення, але динамічний діапазон зображення таким чином підвищити не можна. Зміниться лише кількість окремих кроків від найяскравішого до найтемнішого тонів на зображенні. І навпаки, кадр з 22 інтервалами (що значно перевищує можливості зорієнтованих на споживача цифрових фотоапаратів, якщо не використовувати декілька експозицій) можна зберегти як 8- або 16-бітове зображення, але отримане зображення значно постраждає внаслідок утворення смуг (тобто спостерігатиметься значна смугастість у будь-якому тональному діапазоні, який може одномоментно показувати типовий монітор) через відносно невелику кількість доступних дискретних тональних кроків від найсвітлішого до найтемнішого тонів зображення.

source: In-camera produced jpegs don't need a camera profile. All jpegs (or tiffs, if you have an older Minolta Dimage camera) coming straight out of a camera (even if produced by point-and-shoots cameras that don't allow you to save a raw file) start life inside the camera as a raw file produced by the camera's A to D converter. If you save your images as jpegs, then the processor inside the camera interpolates the raw file, assigns a camera profile, translates the resulting RGB numbers to a working space (usually sRGB but sometimes you can choose AdobeRGB, depending on the camera), does the jpeg compression, and stores the jpeg file on your camera card. So jpegs (or tiffs) from your camera don't need to be assigned a camera profile which is then translated to a working space via a PCS. Jpegs from a camera are already in a working space.
nl: Intern (in-camera) geproduceerde jpegs hebben geen cameraprofiel nodig. Alle jpeg's (of tiff's, als u een ouder model Minolta Dimage camera hebt) die regelrecht uit de camera komen beginnen hun leven als een raw-bestand dat geconverteerd werd door de inwendige analoog naar digitaal converter (omzetter.) Zelfs wanneer gemaakt door eenvoudige pocket-camera's. Als u uw beelden opslaat als jpeg's, dan interpoleert de processor in uw camera het raw-bestand, wijst een cameraprofiel toe, vertaalt de resulterende RGB waarden naar een werkruimte (gewoonlijk sRGB, maar soms kunt u kiezen voor AdobeRGB), zorgt voor de jpeg-compressie en slaat de afbeelding op in de geheugenkaart van uw camera. Voor jpeg's (of tiff's) van uw camera is het niet nodig een profiel toe te wijzen dat dan vertaald wordt naar werkruimte via een PCS. Jpeg's van uw camera bevinden zich al in een kleurwerkruimte.
uk: Зображення jpeg, створені у фотоапараті, не потребують профілю фотоапарата. Всі зображення jpeg (або tiff, якщо ви є власником або власницею застарілого фотоапарата Minolta Dimage), отримані безпосередньо за допомогою фотоапарата (навіть створені фотоапаратами типу «навів і клацнув», які не дозволяють зберігати зображення цифрових негативів), починають своє життя у фотоапараті як файл цифрового негатива, створений аналогово-цифровим перетворювачем фотоапарата. Якщо ви зберігаєте ваші зображення у форматі jpeg, інструмент обробки у самому фотоапараті наблизить файл цифрового негатива, призначить профіль фотоапарата, перетворить отримані числа RGB у робочий простір (зазвичай, sRGB, але іноді ви можете вибрати AdobeRGB, все залежить від фотоапарата), виконає стискання jpeg і збереже файл jpeg на картці фотоапарата. Отже, для файлів jpeg (або tiff) з вашого фотоапарата не потрібно призначати профіль фотоапарата, який потім буде перетворено у робочий простір за посередництва PCS. Кольори файлів jpeg з фотоапарата вже перебувають у робочому просторі.
