Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/image_editor/color_management.po
Languages: nl, uk

source: Why are the Canon and Nikon colors better than the colors produced by Libraw?
nl: Waarom zijn de kleuren van Canon en Nikon beter dan de kleuren die door Libraw worden geproduceerd?
uk: Чому кольори Canon і Nikon виглядають кращими за кольори, створені libraw?

source: Why is a camera profile specific to a given make and model of camera?
nl: Waarom is een cameraprofiel specifiek voor een gegeven merk en model van een camera?
uk: Чому профіль фотоапарата так жорстко пов’язано з виробником і моделлю фотоапарата?

source: Digital cameras have an array of millions of little light sensors inside, making up either a CCD or a CMOS chip. These light-sensing pixels are color-blind - they only record the amount, not the color, of light falling on them. So to allow pixels to record color information, each pixel is capped by a transparent red, green, or blue lens, usually alternating in what is called a Bayer array (except for Faveon sensors, which work differently). A raw image is nothing more than an array of values indicating "how much light" passed through the red, blue, or green lens cap to reach the sensor.
nl: Een CCD of een CMOS sensor binnenin een digitale camera, bestaat uit een patroon van miljoenen kleine lichtsensoren (pixels) die gezamenlijk de CCD of CMOS sensor vormen. Deze lichtgevoelige pixels zijn kleurenblind. Ze registreren slechts de hoeveelheid en niet de kleur van het licht dat er op valt. Om pixels de kleurinformatie te laten registreren is iedere pixel afgedekt met een transparante rode, groene of blauwe lens, elkaar gewoonlijk afwisselend in, wat genoemd wordt, een Bayer patroon (behalve Faveon sensoren die werken anders). Een raw beeld is niet meer dan een patroon van waarden die aangeven hoeveel licht door de rode, groene of blauwe lens word doorgelaten om de sensor te bereiken.
uk: Одним з елементів цифрового фотоапарата є матриця з мільйонами маленьких світлових датчиків, створених на основі мікросхем ПЗЗ або КМОН. Подібні світлові датчики не розрізняють кольорів, — вони можуть визначити лише потужність, а не колір, світла, що на них падає. Отже, щоб датчик міг записати дані щодо кольору, його вкривають прозорою червоною, зеленою або синьою лінзою. Зазвичай, датчики розташовано у вигляді так званого фільтра Баєра (окрім датчиків Faveon, які працюють інакше). Зображення цифрового негатива є нічим іншим, ніж масивом значень, що відповідають «кількості світла», яка пройшла крізь червону, зелену чи синю лінзу-накривку і потрапила на датчик.

source: Clearly, pixel response to light is the result of lots of camera-specific factors including: the nature of the sensor array itself, the precise coloring/transmissive qualities of the lens caps, and the particular analog-to-digital conversion and post-conversion processing that happens inside the camera to produce the raw image that gets stored on the card.
nl: Het is duidelijk, pixelreactie op licht is het resultaat van veel camera-specifieke factoren: de aard van de sensor matrix zelf, de precieze kleur/doorlatende eigenschappen van de lenskappen en de specifieke analoog naar digitaal conversie en de verwerking die daarna plaats vind in de camera om de ruwe afbeelding te produceren die wordt opgeslagen op de kaart.
uk: Якщо бути точним, реакція датчика на світло є результатом дії багатьох специфічних для фотоапарата факторів: властивостей самої матриці датчиків, точності зафарбовування і пропускання світла лінзами-накривками, частково аналогово-цифрового перетворення і наступної після перетворення обробки, яка відбувається у самому фотоапараті з метою отримання зображення цифрового негатива, яке і потрапляє на картку пам’яті.

source: What does "analog-to-digital conversion" mean?
nl: Wat betekent "conversie van analoog naar digitaal"?
uk: Що означає «перетворення за аналогового формату на цифровий»?

source: "Analog" means continuously varying, like how much water you can put in a glass. "Digitizing" an analog signal means that the continuously changing levels from the analog signal source are "rounded" to discrete quantities convenient to the binary numbers used by computers. The analog-to-digital conversion that takes place inside the camera is necessary because the light-sensing pixels are analog in nature - they collect a charge proportionate to the amount of light that reaches them. The accumulated charge on each pixel is then turned into a discrete, digital quantity by the camera's analog-to-digital converter. Which by the way explains why a 14-bit converter is better than a 12-bit converter - more precision in the conversion output means less information is thrown away in the conversion process.
nl: "Analoog" betekent continu variërende, zoals hoeveel water je in een glas kunt doen. "Digitalisering" van een analoog signaal betekent dat de continu veranderende niveaus van de analoge signaalbron zijn "afgerond" naar discrete waarden geschikt voor binaire getallen gebruikt door computers. De conversie van analoog naar digitaal, die plaatsvindt in de camera, is nodig omdat de lichtgevoelige pixels analoog van aard zijn. Ze verzamelen een (elektrische) lading die in verhouding staat tot de hoeveelheid licht die hen bereikt. De opgebouwde lading op elke pixel wordt vervolgens omgezet in een discrete, digitale waarde door de converter van analoog naar digitaal in de camera. Hetgeen verklaart waarom een 14-bits converter beter is dan een 12-bits converter - meer precisie in de conversieresultaten betekent dat minder informatie verloren raakt in het conversieproces.
uk: «Аналоговий» означає «такий, що змінюється неперервно», подібно до об’єму води, який ви можете налити до склянки. «Цифрування» аналогового сигналу означає, що рівні освітленості, які неперервно змінюються у аналогових даних, «округлюються» до множини дискретних величин, зручної для перетворення на двійкові числа, які використовуються у комп’ютерах. Аналогово-цифрове перетворення, яке відбувається у самому фотоапараті, потрібне, оскільки за своєю природою датчики світла є аналоговими пристроями: вони накопичують заряд пропорційно до кількості світла, яке на них падає. Зібраний на кожному з датчиків заряд перетворюється на дискретне числове значення аналогово-цифровим інструментом перетворення фотоапарата. Саме цим і пояснюється краща якість 14-бітового перетворення, порівняно з 12-бітовим: вища точність зменшує об’єм даних, які буде відкинуто у процесі перетворення.

source: Why is a camera profile specific to the raw processing program used to develop the raw file?
nl: Waarom is een cameraprofiel specifiek voor het gebruikte bewerkingsprogramma van raw om het raw-bestand te ontwikkelen?
uk: Чому для створення файла цифрового негатива використовується профіль фотоапарата, пов’язаний з програмою обробки цифрових негативів?

source: Where do I find a generic profile for my camera?
nl: Waar kan ik een algemeen profiel voor mijn camera vinden?
uk: Де я можу знайти загальний профіль мого фотоапарата?

source: How do I get a camera profile specific to my camera, lighting conditions, and raw workflow?
nl: Hoe krijg ik een cameraprofiel specifiek voor mijn camera, lichtcondities, en workflow voor raw?
uk: Як мені отримати профіль, який відповідатиме саме моєму фотоапарату, моїм умовам освітлення і моєму процесові обробки цифрових негативів?

source: Many commercial services provide profiling services, for a fee, of course. Or you can use LPRof to profile your camera yourself. If you want to profile your own camera, you will need an "IT8 target", that is, an image containing squares of known colors. Along with the IT8 target, you will receive the appropriate set of known values for each square of color on the target.
nl: Veel commerciële dienstverleners maken profielen tegen betaling. Met LPRof kunt u ook zelf een profiel van uw camera maken. Als u dat zelf wilt doen heeft u een "IT8 target" nodig. Dat is een beeld dat vierkantjes met bekende kleuren omvat. Samen met "IT8" ontvangt u dan de juiste set bekende waarden voor elk van de vierkantjes op het target.
uk: Існує багато комерційних компаній, які надають послуги з профілювання, звичайно ж, за гроші. Крім того, ви можете скористатися LPRof для того, щоб профілювати ваш фотоапарат вручну. Якщо ви маєте намір профілювати ваш власний фотоапарат, вам знадобиться «IT8-ціль», тобто знімок квадратів з відомими кольорами. Разом з IT8-ціллю ви отримаєте відповідний набір відомих значень кольору кожного з квадратів на цілі.

source: If you plan to use LProf to profile your camera, check the documentation for a list of recommended targets. To profile your camera, you photograph the IT8 target under specified lighting conditions (for example, in daylight, usually taken to mean noon on a sunny day in the summer, with nothing nearby that might cast shadows or reflect color casts) and save the image as a raw file. Then you process the raw file using your particular raw processing software+settings and run the resulting image file through the profiling software. The profiling software compares the RGB values in the image produced by your camera+lighting conditions+raw processing routine with the RGB values in the original target and then produces your camera (icc) profile.
nl: Als u van plan bent LPRof te gebruiken om uw camera van een profiel te voorzien, bekijk dan de documentatie om een lijst met aanbevolen targets te vinden. Om een profiel voor uw camera te maken fotografeert u "IT8 target" onder specifieke belichtingscondities(bijvoorbeeld bij daglicht, midden overdag op een heldere zonnige dag in de zomer zonder objecten in de omgeving die een schaduw of een kleurreflectie kunnen werpen op uw onderwerp) en sla het beeld op als een raw bestand. Daarna verwerkt u het raw bestand met uw speciale raw verwerkingssoftware+instellingen en laat vervolgens het bestand bewerken door de de software die het profiel moet maken. De software die het profiel gaat maken vergelijkt de RGB waarden in het beeld dat tot stand kwam door uw camera+belichtingscondities+raw verwerkingsproces, met de RGB waarden in het originele target en stelt vervolgens het ICC-profiel van uw camera samen.
uk: Якщо ви маєте намір скористатися для профілювання вашого фотоапарата LProf, знайдіть у документації список рекомендованих шаблонів для зйомки. Для виконання профілювання вашого фотоапарата вам доведеться сфотографувати шаблон IT8 за вказаних умов освітлення (наприклад, за денного світла, зазвичай, опівдні сонячного дня влітку, так, щоб ніякі сусідні предмети не відкидали тінь або не відбивали промені на шаблон), а потім зберегти зображення до файла цифрового негатива. Після цього ви виконаєте обробку файла цифрового негатива за допомогою вашого програмного забезпечення на основі певних параметрів і обробите отримане зображення за допомогою програмного забезпечення з профілювання. Програмне забезпечення з профілювання порівняє значення RGB на зображенні, отриманому за допомогою вашого фотоапарата+умов освітлення+програмного забезпечення з обробки цифрових негативів, зі значеннями RGB на початковому шаблоні і створить на основі порівняння профіль (icc) вашого фотоапарата.

source: Profiling a camera is exactly analogous to profiling a monitor. When profiling a monitor, the profiling software tells the graphics card to send squares of color with particular RGB values to the screen. The spectrophotometer measures the actual color that is produced on the screen. When profiling a camera, the known colors are the RGB colors in the original patches on the IT8 target, which the profiling software compares to the colors produced by the digital image of the target, which was photographed in selected lighting conditions, saved as raw, then processed with specific raw processing software plus settings.
nl: Een profiel maken voor een camera is precies hetzelfde als een profiel maken voor een beeldscherm. Bij het profileren van het beeldscherm, vertelt het profileringsprogramma de grafische kaart om vierkantjes met speciale RGB waarden naar het scherm te sturen. De spectrometer meet dan de werkelijke kleur die op het scherm word weergegeven. Bij het profileren van een camera zijn de referentiekleuren, de RGB kleuren in de oorspronkelijke vierkantjes op het IT8 target, die door de software worden vergeleken met de kleuren gemaakt door het digitale beeld van de target, dat eerder werd opgenomen onder geselecteerde belichtingscondities, opgeslagen als raw en daarna verwerkt met specifieke raw verwerkingssoftwareplusinstellingen.
uk: Профілювання фотоапарата дуже подібне до профілювання монітора. Під час профілювання монітора програмне забезпечення з профілювання наказує графічній картці надсилати дані щодо кольорових квадратів з певними значеннями каналів RGB на екран. Спектрометр вимірює точний колір, який буде показано на екрані. Під час профілювання фотоапарата відомими кольорами є кольори RGB областей на шаблоні IT8, які програмне забезпечення з профілювання порівнює з кольорами, отриманими на цифровому знімку шаблону за вибраних умов освітлення з використанням певного процесу обробки цифрового негатива з відповідними параметрами.

source: How do I apply a camera profile to the 16-bit image file produced by my open source raw processing software?
nl: Hoe pas ik een cameraprofiel toe op het 16-bit afbeeldingsbestand geproduceerd door mijn open source bewerkeningssoftware voor raw?
uk: Як мені застосувати профіль фотоапарата до 16-бітового файла зображення, створеного моїм власним програмним забезпеченням для обробки цифрових негативів?

source: The Profiles Point to Real Colors in the Real World
nl: De profielpunten naar echte kleuren in de echte wereld
uk: Зв’язок профілів зі звичайними кольорами у навколишньому світі

source: Camera, scanner, working space, monitor, printer - what do all these color profiles really do?
nl: Camera, scanner, werkruimte, monitor, printer - wat doen al deze kleurprofielen echt?
uk: Профілі фотоапарата, сканера, робочого простору, монітора, принтера — для чого, власне, стільки різних профілів?

source: A color profile describes the color gamut of the device or space to which it belongs by specifying what real color in the real world corresponds to each trio of RGB values in the color space of the device (camera, monitor, printer) or working space.
nl: Een kleurprofiel beschrijft het kleurgamma van het apparaat of de ruimte waartoe het behoort, door te specificeren welke werkelijke kleur in de echte wereld overeenkomt met ieder drietal RGB waarden in de kleurruimte van het apparaat (camera, beeldscherm, printer) of werkomgeving.
uk: Профіль кольорів описує палітру кольорів пристрою або простір, до якого ця палітра належить, визначенням того, який колір у навколишньому світі відповідає кожній трійці значень RGB у просторі кольорів пристрою (фотоапарата, монітора, принтера) або робочому просторі.

source: The camera profile essentially says, "for every RGB trio of values associated with every pixel in the image file produced from the raw file by the raw processing software, "this RGB image file trio" corresponds to "that real color as seen by a real observer in the real world" (or rather, as displayed on the IT8 target if you produced your own camera profile, but it amounts to the same thing - the goal of profiling your camera is to make the picture of the target look like the target).
uk: Насправді, профіль фотоапарата повідомляє інструмент обробки про те, що для кожної трійки значень RGB, пов’язаних з кожним з пікселів зображення, отриманого з файла цифрового негатива програмним забезпеченням для обробки цифрових негативів, «ця трійка RGB з файла зображення» відповідає «такому-то справжньому кольору, який би побачив спостерігач на зображенні оригіналу» (або, точніше, як його показано на шаблоні IT8, якщо ви створювали ваш власний профіль фотоапарата. Загалом же, мета профілювання — зробити кольори зображення копією кольорів оригіналу).

source: You cannot see an image by looking at its RGB values. Rather you see an image by displaying it on a monitor or by printing it. When you profile your monitor, you produce a monitor profile that says "this RGB trio of values that the graphics card sends to the screen" will produce on the screen "that real color as seen by a real observer in the real world".
nl: Door naar de RGB waarden van een beeld te kijken kunt u geen plaatje zien. U kunt wel een plaatje zien door het te tonen op een beeldscherm of door het af te drukken op een printer. Als u uw beeldscherm profileert maakt u een profiel dat zegt: dit drietal RGB waarden die de grafische kaart naar het beeldscherm stuurt zullen op het scherm de echte kleur tonen zoals waargenomen in de echte wereld.
uk: Побачити зображення розглядаючи трійки значень RGB неможливо. Побачити зображення можна лише після показу його на моніторі або роздрукованим на принтері. Результатом профілювання вашого монітора буде певна таблиця, за допомогою якої можна сказати, що «ця трійка значень RGB, надісланих графічною карткою на екран» має призвести до показу на екрані «того-то справжнього кольору, який справжній спостерігач бачить на зображенні оригіналу».

source: What the monitor profile and the camera profile have in common is the part (in italics above) about "that real color as seen by a real observer in the real world." Different trios of RGB numbers in, respectively, the monitor and camera color spaces point to the same real, visible color in the real world. Real colors in the real world provide the reference point for translating between all the color profiles your image will ever encounter on its way from camera to screen to editing program to print or the web.
nl: Wat beeldschermprofiel en cameraprofiel gemeen hebben is het stukje over: "de werkelijke kleur zoals gezien door een werkelijke waarnemer in de werkelijke wereld". Verschillende drietallen RGB nummers in respectievelijk, de beeldscherm- en camera-kleurruimten verwijzen naar dezelfde werkelijke kleur in de werkelijke wereld. Werkelijke kleuren in de werkelijke wereld vormen een referentiepunt voor de omzetting tussen alle kleurprofielen die uw beeld tegen zal komen tijdens de bewerking van camera naar beeldscherm naar bewerkingsprogramma, printer of het web.
uk: Спільною для профілю монітора і профілю фотоапарата є частина, пов’язана з «кольором, який справжній спостерігач бачить на зображенні оригіналу». Таким чином, різні трійки чисел RGB у просторах кольорів монітора і фотоапарата, відповідно, вказують на один і той самий видимий колір оригіналу. Кольори справжній предметів навколишнього світу є точкою відліку для переходів між всіма профілями кольорів, які зустрічатимуться на шляху вашого зображення від фотоапарата до екрана, програми редагування чи друку або інтернету.

source: How can a color profile point to a real color in the real world?
nl: Hoe kan een kleurprofiel wijzen naar een echte kleur in de echt wereld?
uk: Як мені співвіднести точку профілю зі справжнім кольором у реальному світі?

source: Real people don't even see the same colors when they look at the world, do they?
nl: Echte mensen zien zelfs niet dezelfde kleuren als ze de wereld bekijken, toch?
uk: Всі люди сприймають кольори по-різному, хіба не так?

source: A long time ago (1931, although refinements continue to be made), the International Color Consortium decided to map out and mathematically describe all the colors visible to real people in the real world. So they showed a whole bunch of people a whole bunch of colors and asked them to say when "this" color matched "that" color, where the two visually matching colors were in fact produced by differing combinations of wavelengths. What was the value of such a strange procedure? Human color perception depends on the fact that we have three types of cone receptors with peak sensitivity to light at wavelengths of approximately 430, 540, and 570 nm, but with considerable overlap in sensitivity between the different cone types. One consequence of how we see color is that many different combinations of differing wavelengths of light will look like "the same color".
nl: Lang geleden, in 1931, besloot het International Color Consortium om op rekenkundige wijze alle kleuren die mensen kunnen zien in kaart te brengen. Zodoende, toonden ze aan een groep mensen een groep kleuren en vroegen de mensen om aan te geven wanneer een bepaalde kleur gelijk was aan een andere kleur. Waarbij de twee overeenkomende kleuren in feite tot stand kwamen door veranderende combinaties van golflengten. Wat was de waarde van zo'n vreemde procedure? Menselijke kleurwaarneming berust op het feit dat we drie types kegelreceptoren hebben met een piekgevoeligheid voor licht van golflengtes van ongeveer 430, 540, en 570 nm, maar met een behoorlijke overlapping in gevoeligheid tussen de verschillende kegelreceptoren. Een gevolg van hoe we kleuren zien is dat veel verschillende combinaties van verschillende golflengten van licht er uit zien als dezelfde kleur.
uk: Досить давно (у 1931 році, хоча покращення все ще триває) міжнародний консорціум щодо кольорів (International Color Consortium або ICC) вирішив створити карту і математично описати всі кольори, які можуть бачити люди у навколишньому світі. Отже, багатьом людям було показано широкі набори кольорів і запропоновано встановити відповідність між ними, причому два візуально однакові кольори могли фактично бути результатом складання компонентів світла з різною довжиною хвиль. У чому ж була цінність таких дивних опитувань? Відповідь така: сприйняття людиною кольорів базується на тому, що око містить три типи рецепторів з піковою чутливістю до світла з довжиною хвиль приблизно 430, 540 і 570 нм, але зі значним перекриттям у чутливості між різними типами цих рецепторів. Одним з наслідків того, яким чином ми бачимо кольори, є те, що різні комбінації світла з різною довжиною хвиль виглядають для нас однаково.

source: CIE-XYZ is not the only PCS. Another commonly used PCS is CIE-Lab, which is mathematically derived from the CIE-XYZ space. CIE-Lab is intended to be "perceptually uniform", meaning "a change of the same amount in a color value should produce a change of about the same visual importance" (cited from Wikipedia article). Wikipedia says "The three coordinates of CIELAB represent the lightness of the color (L* = 0 yields black and L* = 100 indicates diffuse white; specular white may be higher), its position between red/magenta and green (a*, negative values indicate green while positive values indicate magenta) and its position between yellow and blue (b*, negative values indicate blue and positive values indicate yellow)" (cited from Wikipedia article).
uk: CIE-XYZ не є єдиним PCS Іншим поширеним PCS є CIE-Lab, який було математично виведено з простору CIE-XYZ Метою створення CIE-Lab було досягнення «відчуттєвої однорідності», тобто реалізації формули «однакові зміни у значенні кольору мають призводити до таких самих однакових змін у візуальному сприйнятті» (цитата зі статті у Вікіпедії). Вікіпедія повідомляє: «Три координати простору CIELAB відповідають освітленості (lightness) кольору (L* = 0 дає чорний колір, а L* = 100 відповідає розсіяному білому; дзеркально білий може мати вищі значення), розташуванню кольору між червоним/малиновим і зеленим (a*, від’ємні значення відповідають зеленішим кольорам, а додатні — червонішим) і розташуванню кольору між жовтим і синім (b*, від’ємні значення відповідають синішим кольорам, а додатні — жовтішим)» (цитата зі статті у Вікіпедії).

source: Printer Profiles with Rendering Intents and Soft-Proofing
nl: Printerprofielen, weergave-intenties, en soft-proofing
uk: Профілі принтерів, відтворення кольорів і проба кольорів

source: Where do I get a printer profile?
nl: Waar vind ik een printerprofiel?
uk: Де можна дістати профіль принтера?

source: What about rendering intents?
nl: Hoe zit dat bij weergave-intenties?
uk: А як щодо відтворення кольорів?
