Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/image_editor/color_management.po
Languages: nl, uk

source: Useful mathematical information if you are dealing with Libraw's linear gamma output: Mathematically speaking, when doing a gamma transform you normalize (that is, divide by 256 if you are working with 8-bit values) the RGB numbers and raise the resulting numbers to an appropriate power depending on the respective gammas of the starting and ending color space, then renormalize the results to a new set of RGB numbers. It's not hard, and very instructive, to do this with a calculator for a few sets of RGB numbers spaced from (0,0,0) to (255,255,255) to see how RGB numbers change from one gamma encoding to another. LCMS does this for you when you ask LCMS to convert from one color space to another. However, if ALL you are doing is converting from one color space to the same color space except for a different gamma, use imagemagick instead of LCMS and just manipulate the RGB numbers directly, then assign the new working space to the image - the results will be more accurate than going through a color space transform.
nl: Handige wiskundige informatie als u te maken hebt met lineaire gamma-uitvoer van Libraw: wiskundig gezien, bij het doen van een gamma transformatie normaliseert u, (dat is, de RGB-nummers delen door 256 als u werkt met 8- bits waarden) en verhoogt u de verkregen getallen naar een passende waarde, afhankelijk van de respectievelijke gamma's van de eerste en laatste kleurruimte, daarna normalizeert u de resultaten opnieuw naar een nieuwe reeks van RGB getallen. Het is niet moeilijk en zeer leerzaam om dit te doen met een rekenmachine voor een paar afzonderlijke sets van RGB getallen van (0,0,0) tot (255,255,255) om te zien hoe RGB-getallen van de ene gamma-codering naar de andere veranderen. LCMS doet dit voor u wanneer u LCMS vraagt te converteren van de ene kleurruimte naar de andere. Als alles wat u doet is het converteren van één kleurruimte naar dezelfde kleurruimte behalve voor een andere gamma, gebruik dan imagemagick in plaats van LCMS en behandel de RGB-getallen direct, ken dan de nieuwe werkruimte toe aan de afbeelding - het resultaat zal beter zijn dan door een transformatie van de kleurruimte te gaan.
uk: Корисні математичні відомості, якщо ви маєте справу з лінійним виводом гами libraw: з математичної точки зору, під час перетворення гами ви нормалізуєте (тобто виконуєте ділення на 256, якщо працюєте з 8-бітовими значеннями) числа RGB і підносите отримані числа до відповідного степеня, залежного від гам початкового і кінцевого просторів кольорів, а потім виконаєте повторну нормалізацію результатів для нового набору чисел RGB. Неважко, але дуже повчально виконати ці дії за допомогою калькулятора для декількох наборів чисел RGB у діапазоні від (0,0,0) до (255,255,255), щоб поспостерігати за тим, як змінюються числа RGB під час перекодування з однієї гами до іншої. LCMS виконує це завдання, коли ви наказуєте LCMS перетворити зображення з одного простору кольорів у інший. Але, якщо перетворення полягає ЛИШЕ у переході між однаковими просторами кольорів з різною гамою, краще скористатися не LCMS, а imagemagick і виконати безпосереднє перетворення чисел RGB, а потім призначити для зображення новий простір кольорів: результати будуть точнішими, ніж за виконання повноцінного перетворення просторів кольорів.

source: Copyrighted and copyleft working spaces: I will take it as given that all the ordinarily encountered working spaces, such as:
nl: door Copyright beschermde en onbeschermde werkruimten: ik neem aan dat alle gewone werkruimten die men tegen kan komen zoals:
uk: Захищені патентним законодавством робочі простори та робочі простори з можливістю законного лівого копіювання: вважається, що це ВСІ поширені робочі простори, зокрема:

source: The several variants of sRGB (see color.org).
nl: De verschillende varianten van sRGB (zie color.org)
uk: декілька варіантів sRGB (див. color.org).

source: BruceRGB or BestRGB.
nl: BruceRGB of BestRGB.
uk: BruceRGB або BestRGB.

source: The various ECI (European color initiative) working space profiles.
nl: De verschillende ECI (European color initiative) werkruimteprofielen
uk: різноманітні профілі робочого простору ECI (European color initiative).

source: AdobeRGB, Adobe WideGamutRGB, and Kodak/Adobe ProPhotoRGB (Kodak and Adobe ProPhoto are the same, just branded differently) and their non-branded, non-copyrighted counterparts (Oyranos includes a non-branded version of AdobeRGB).
nl: AdobeRGB, AdobeWideGamutRGB, en Kodak/Adobe ProPhotoRGB (Kodak en Adobe ProPhoto zijn hetzelfde met een andere naam) en hun merkloze onbeschermde tegenhangers (Oyranos bevat een merkloze versie van AdobeRGB)
uk: AdobeRGB, Adobe WideGamutRGB і Kodak/Adobe ProPhotoRGB (Kodak і Adobe ProPhoto є одним простором кольорів, але з різними фірмовими назвами) та їх незапатентовані відповідники без фірмових назв (Oyranos містить версію AdobeRGB без торговельної марки)).

source: The Color Space Connections
nl: De kleurruimteverbindingen
uk: Зв’язки між просторами кольорів

source: So the question for each RGB trio of values in the (let us assume) 16-bit tiff produced by Libraw becomes, "What does a particular trio of RGB values for the pixels making up images produced by this particular (make and model) camera really mean in terms of some absolute standard referencing some ideal observer". This absolute standard referencing an ideal observer is more commonly called a Profile Connection Space. A camera profile is needed to accurately characterize or describe the response of a given camera's pixels to light entering that camera, so that the RGB values in the output file produced by the raw converter can be translated first into an absolute Profile Connection Space (PCS) and then from the PCS to your chosen working space. As a very important aside, for most of the open source world (including digikam), the software used to translate from the camera profile to the PCS and from the PCS to your chosen working space and eventually to your chosen output space (for printing or perhaps monitor display) is based on lcms (the little color management engine). For what it's worth, my own testing has shown that lcms does more accurate conversions than Adobe's proprietary color conversion engine. Further, for almost all raw conversion programs, including commercial closed source software such as Adobe Photoshop, the raw conversion is typically based on decoding of the proprietary raw file done by Libraw. This library, is the hero of raw conversion - without him we'd all be stuck using the usually windows/mac only proprietary software that comes with our digital cameras. The Libraw's interpolation algorithms (not to be confused with the aforementioned decoding of the proprietary raw file), which are part of digiKam if properly used, produce results equal or superior to commercial, closed source software. We in the world of Linux® and open source software are not second-class citizens when it comes to digital imaging. Far from.
uk: Отже, питання, яке постає для кожної трійки значень RGB у, наприклад, 16-бітовому tiff, створеному за допомогою libraw, є таким: «Як саме виглядає ця трійка значень RGB для кожного з пікселів, з яких складається зображення, створене за допомогою саме цього фотоапарата (певного виробника і певної моделі), з точки зору певного абсолютного стандартного еталонного або ідеального спостерігача» Такий абсолютним стандартним еталоном ідеального спостерігача традиційно називають Профілем з’єднання кольорів</emphasis> (Profile Connection Space або PCS). Для точної характеризації або опису реакції деяких пікселів матриці фотоапарата на світло, що потрапило всередину фотоапарата, потрібен профіль фотоапарата. За допомогою цього профілю значення RGB у вихідному файлі, створеному інструментом перетворення цифрових негативів, можна перетворити спершу на значення у абсолютному просторі з’єднання профілів (PCS), а потім вже перетворити значення PCS на значення у вибраному вами просторі кольорів. Дуже важливе зауваження: для більшості програм з відкритими кодами (зокрема digikam), програмне забезпечення, що використовується для перетворення з профілю фотоапарата у PCS і з PCS до вибраного вами робочого простору і, нарешті, до вибраного вами простору кольорів виводу (для друку або, можливо, показу на моніторі) засновано на lcms (little color management engine). Як би там не було, за спостереженнями автора, lcms виконує точніші перетворення, ніж комерційний рушій перетворення кольорів Adobe. Крім того, майже всі програми перетворення цифрових негативів, зокрема комерційне програмне забезпечення з закритим кодом, наприклад, Adobe Photoshop, перетворення цифрових негативів, типово, засновано на декодуванні цифрового негатива у закритому форматі, яке виконує libraw. Автори цієї бібліотеки є одними з видатних осіб у галузі перетворення цифрових негативів: без них єдиним виходом було б використання звичайного для windows/mac комерційного закритого програмного забезпечення, яке постачається разом з цифровими фотоапаратами. Алгоритми наближення libraw (їх не слід плутати з декодуванням файла цифрового негатива у закритому форматі, про яке ми згадували раніше), які є частиною digiKam, за їх належного використання, дають результати, які не поступаються або переважають результати комерційного програмного забезпечення з закритим кодом. Ми у світі Linux® і відкритого програмного забезпечення НЕ є громадянами другого сорту, коли йдеться про цифрову фотографію. Зовсім не є.

source: There are two commonly used Profile Connection Spaces - CIELAB and CIEXYZ (see Color management, section on color translation, then look up CIELAB and CIEXYZ on wikipedia). Lcms uses the camera profile to translate the RGB values from the interpolated raw file, that is, the tiff produced by Libraw, into the appropriate Profile Connection Space (usually CIEXYZ - why CIEXYZ? I haven't taken the time to learn). A profile connection space is not itself a working space. Rather a PCS is an absolute reference space used only for translating from one color space to another - think of a PCS as a Universal Translator for all the color profiles that an image might encounter in the course of its journey from camera raw file to final output:
uk: Існує два поширених просторів з’єднання профілів: CIELAB і CIEXYZ (див сторінку «Керування кольорами», розділ щодо перетворення кольорів (color translation), а потім сторінки щодо CIELAB і CIEXYZ у Вікіпедії). Lcms використовує профіль фотоапарата для перетворення значень RGB з наближеного файла цифрового негатива, тобто файла tiff, створеного за допомогою libraw, у відповідний простір з’єднання профілів (Зазвичай, CIEXYZ. Чому CIEXYZ? Не було часу вивчити це питання). Простір з’єднання профілів насправді не є робочим простором. PCS можна уявляти як абсолютний еталонний простір, що використовується лише для перетворення з одного простору кольорів у інший. PCS — це неначебто універсальний інструмент перетворення для всіх профілів кольорів, які можуть зустрітися у зображенні на його шляху з файла цифрового негатива фотоапарата до остаточного відбитка:

source: Lcms uses the camera profile, also called an input profile, to translate the interpolated Libraw-produced RGB numbers, which only have meaning relative to your (make and model of) camera, to a second set of RGB numbers that only have meaning in the Profile Connection Space.
uk: У Lcms використовується профіль фотоапарата, який ще називають вхідним профілем, для перетворення наближених чисел RGB, створених за допомогою libraw, які мають значення лише для вашого фотоапарата (його параметрів виробника та моделі), на інший набір чисел RGB, який має значення лише у просторі з’єднання профілів (PCS).

source: Lcms translates the Profile Connection Space RGB numbers to the corresponding numbers in your chosen working space so you can edit your image. And again, these working space numbers ONLY have meaning relative to a given working space. The same red, visually speaking, is represented by different trios of RGB numbers in different working spaces; and if you assign the wrong profile the image will look wrong, slightly wrong or very wrong depending on the differences between the two profiles.
nl: Lcms vertaalt de RGB-getallen van de Profielverbindenderuimte naar de overeenkomstige getallen in uw gekozen werkruimte zodat u uw beeldbestand kan bewerken. En deze werkruimtegetallen hebben ALLEEN betekenis voor een gegeven werkruimte. Hetzelfde rood, visueel gesproken, wordt in verschillende werkruimten vertegenwoordigd door verschillende trio's van RGBgetallen; en als u het verkeerde profiel toewijst zal het beeld er verkeerd uitzien, een beetje verkeerd of heel erg verkeerd, afhankelijk van de verschillen tussen de twee profielen.
uk: Lcms перетворює числові трійки RGB простору з’єднання кольорів на відповідні числа у вибраному вами робочому просторі так, щоб ви змогли редагувати зображення. І знову ж таки, ці числа у робочому просторі мають значення ЛИШЕ відносно певного робочого простору. Однаковому, з точки зору спостерігача, червоному кольору у різних робочих просторах відповідають різні трійки чисел RGB. Якщо ви призначите неправильний профіль, зображення виглядатиме неправильно. Лише трохи неправильно чи дуже неправильно, залежить від відмінностей між двома профілями.

source: While you are editing your image in your chosen working space, then lcms should translate all the working space RGB numbers back to the PCS, and then over to the correct RGB numbers that enable your monitor (your display device) to give you the most accurate possible display representation of your image as it is being edited. This translation for display is done on the fly and you should never even notice it happening, unless it doesn't happen correctly - then the displayed image will look wrong, perhaps a little wrong, perhaps really, really, really wrong.
uk: Під час редагування вашого зображення у вибраному робочому просторі, lcms має перетворювати всі числа RGB робочого простору у PCS, а потім знову у належні числа RGB, які уможливлять найточніший показ образу вашого зображення у процесі редагування на вашому моніторі (вашому пристрої показу). Це перетворення для показу виконується на льоту: ви навіть не помічаєте, коли воно відбувається, якщо всі дії виконуються належним чином. Якщо у діях з певної причини виникає помилка, зображення може бути неправильним, трохи неправильним або дуже, дуже, дуже неправильним.

source: When you are satisfied that your edited image is ready to share with the world, lcms translates the working space RGB numbers back into the PCS space and out again to a printer color space using a printer profile characterizing your printer/paper combination (if you plan on printing the image) or to sRGB (if you plan on displaying the image on the web or emailing it to friends or perhaps creating a slide-show to play on monitors other than your own).
nl: Wanneer u vindt dat uw afbeelding gereed is om aan de buitenwereld te presenteren vertaalt lcms de werkruimte RGB-getallen terug naar de PCS-ruimte (profielverbindende) en naar de kleurruimte van de printer met gebruik van het printerprofiel dat aangeeft welke printer/papier combinatie gebruikt wordt. Of, naar sRGB, als u van plan bent het beeld op internet te tonen of het per e-mail te verzenden of om een diashow te maken die op andere beeldschermen getoond kan worden.
uk: Коли вас задовольнять результати редагування і зображення, і ви готові будете поділитися ним зі світом, lcms перетворить числа робочого простору RGB у простір PCS, а потім знову у простір кольорів принтера за допомогою характерної комбінації параметрів вашого принтера/паперу (якщо ви плануєте друк зображення) або у sRGB (якщо ви плануєте показ зображення у мережі або надсилання його електронною поштою друзям або, можливо, створення показу слайдів на моніторах, відмінних від вашого).

source: Where to find camera profiles
nl: Waar kunt u cameraprofielen vinden
uk: Де знайти профілі фотоапаратів?

source: So where do we get these elusive and oh-so-necessary camera-specific profiles that we need to translate our interpolated raw files to a working color space? This website section has a bit of information on where to find ready-made camera profiles. It's an unfortunate fact of digital imaging that the camera profiles supplied by Canon, Nikon, and the like don't work as well with raw converters other than each camera manufacturer's own proprietary raw converter. Which is why Bibble and Phase One (and Adobe, but ACR hides the Adobe-made profiles inside the program code), for example, have to make their own profiles for all the cameras that they support - keep this proprietary propensity of your camera manufacturer in mind next time you buy a digital camera.
uk: Отже, де ж нам добути ці невловимі і такі потрібні специфічні для фотоапарата профілі, які потрібні для перетворення наших наближених файлів цифрових негативів у робочий простір? У цьому розділі наведено трохи інформації щодо того, де шукати готові профілі фотоапаратів. Але можна констатувати прикрий факт роботи з цифровими зображеннями: профілі фотоапаратів, які постачаються компаніями Canon, Nikon тощо, не працюють належним чином з інструментами перетворення цифрових негативів, відмінними від створених виробником фотокамери закритих інструментів. Ось чому Bibble і Phase One (і Adobe, але ACR приховує створені Adobe профілі у коді програми), наприклад, змушені створювати власні профілі для всіх фотоапаратів, які ними підтримуються. Враховуйте цю схильність виробників до приховування, коли наступного разу купуватимете цифровий фотоапарат.

source: But back to finding a camera profile for your camera - the real answer (assuming you don't find a ready-made profile that makes you happy) is to make your own camera profile or have one made for you. There are quite a few commercial services who provide profiling services (for a fee, of course). Or you can use LPRof or Argyll to profile your camera yourself. I haven't yet walked down that road so I cannot speak about how easy or difficult the process of profiling a camera might be. But I would imagine, knowing how very meticulous the people behind Argyll, LPRof, and lcms are about color management, that making your own camera profile is very do-able and very likely the results will be better than any proprietary profile. After all, Canon (and also Bibble and Phase One for that matter) didn't profile MY camera - they just profiled a camera like mine.
nl: Maar even terug naar het vinden van een cameraprofiel voor uw camera. Het juiste antwoord is; (als u geen kant en klaar profiel voor uw camera kunt vinden) om uw eigen profiel aan te maken of te laten maken. Er zijn nogal wat commerciële dienstverleners die tegen betaling een profiel voor uw camera maken. Of u kunt gebruik maken van LPRof, dan wel Argyll om zelf uw camera te profileren. Ik heb dat zelf nog nooit gedaan daarom kan ik niet zeggen hoe gemakkelijk of hoe moeilijk het is. Maar ik kan me voor stellen dat het te doen is als ik bedenk hoe nauwgezet de mensen achter Argyll en LPRof zijn ten aanzien van kleurbeheer. En de resultaten zullen beter zijn dan het door de maker van de camera geleverde profiel. Want Canon (en ook Bibble en Phase One) hebben niet het profiel van mijn camera gemaakt maar het profiel van een camera zoals die van mij.
uk: Повернімося до пошуків профілю фотоапарата для ВАШОГО фотоапарата. Єдиною відповіддю (якщо вам не вдалося знайти готового профілю, який задовольняє ваші потреби) є створення власного профілю фотоапарата або купівля такого профілю. Існує декілька комерційних служб, які надають послуги з профілювання (звичайно ж, за гроші). Крім того, ви можете скористатися LPRof або Argyll для того, щоб профілювати ваш фотоапарат вручну. Автор ще не виконував цієї процедури, отже не може сказати про те, наскільки простим чи складним є процес профілювання фотоапарата. Але можна вважати, знаючи наскільки скурпульозними є творці Argyll, LPRof та lcms у питаннях керування кольорами, що створення вашого власного профілю фотоапарата є завданням, яке реально можна виконати з результатами, кращими за отримані за допомогою будь-якого профілювання закритим програмним забезпеченням. До того ж, компанія Canon (а також Bibble і Phase One) не створюватимуть профілів саме для ВАШОГО фотоапарата, — вони профілюватимуть фотоапарат, ПОДІБНИЙ до вашого.

source: Working Spaces
nl: Werkruimten
uk: Робочі простори

source: So now your raw file has been interpolated by Libraw and you've obtained a camera profile and used lcms to apply your camera profile. What does all this mean? The real answer involves a lot of math and color science that goes way over my head and likely yours. The short, practical answer is that neither the camera profile space nor the Profile Connection Space is an appropriate space for image editing. Your next step is to choose a working space for image editing. And then you (or rather the lcms color management engine that your open source digital imaging software uses) actually perform a double translation. First lcms uses the camera profile to translate the RGB values of each pixel in the Libraw-output-image-without-camera-profile-applied into the aforementioned Profile Connection Space. Then it translates the RGB values of each pixel from the PCS to your chosen working space.
uk: Отже, тепер ваш файл цифрового негатива наближено за допомогою libraw, у вас вже є профіль фотоапарата і ви використали lcms для застосування профілю фотоапарата. Для чого всі ці складнощі? Точна відповідь містить багато математичних викладок та застосування науки про колір, які вже вилетіли з голови автора і, напевно, вилетять з вашої голови. Коротка відповідь, побудована з точки зору практики, полягає у тому, що ні простір кольорів профілю фотоапарата, ні простір з’єднання профілів (PCS) не є зручними просторами для редагування зображення. Отже, ви (або точніше рушій керування кольорами lcms, який використовує ваше програмне забезпечення з відкритим кодом для роботи з цифровими фотографіями) насправді виконуватимете подвійне перетворення. Спочатку lcms використає профіль фотоапарата для перетворення значень RGB для кожного пікселя у виведеному libraw зображенні без застосування профілю фотоапарата до згаданого раніше простору з’єднання профілів, потім lcms перетворить значення RGB кожного з пікселів з PCS до вибраного вами робочого простору.

source: Confusions and confusing terminology
nl: Verwarring en verwarrende benamingen
uk: Помилки та неправильні тлумачення термінів

source: Before talking more about working spaces, some confusions and confusing terminology needs to be cleared up:
nl: Alvorens over werkruimten te spreken, is het nodig enige verwarring en verwarrende terminologie weg te nemen en op te klaren:
uk: Перш ніж перейти до докладнішого розгляду робочих просторів, слід прояснити деякі помилки та неправильні тлумачення:
