Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/image_editor/color_management.po
Languages: nl, uk

source: When first learning about color management, many people are confused about the difference between calibrating and profiling a monitor (I know I was). Quoting from Hal Engel's excellent discussion in the digiKam users forum:
uk: Протягом початкового періоду вивчення керування кольорами багато хто плутає калібрування та профілювання монітора (автор і сам плутав, коли вивчав цей предмет). Процитуємо чудовий допис Hal Engel на форумі користувачів digiKam:

source: Calibration is a process where a device is brought into some defined state by making adjustments to its controls or some other physical means. For example, the act of calibrating a monitor involves adjusting its white point, black level, luminosity and gamma to predetermined or standard values using the monitor's controls and by altering the video card gamma ramp... In contrast to calibration, the process of creating a profile is a characterization of the device that does not involve making any changes or adjustments to the device. Rather it is a measurement process that results in a file that contains a precise mathematical description of the device's color and tonality characteristics. This file is an ICC profile. These characteristics include the transfer function from the device's color space to a standardized absolute color space (this is called a Profile Color Space, PCS, in an ICC profile), the device's white point, black point, primaries and other information. Displays are normally characterized (profiled) in their calibrated state. To summarize, calibration makes changes to the device to alter it's color reproduction characteristics to conform to some predetermined state. Profiling or characterization is a measurement process that results in a detailed description of the device's (normally calibrated) color reproduction characteristics. (cited from here)
uk: Калібрування — це процес, за якого пристрій переводиться у певний визначений стан шляхом коригування його параметрів або у якийсь інший спосіб. Наприклад, дія з калібрування монітора включає налаштування його точки білого, рівня чорного, світності і степеня контрастності до наперед визначених або стандартних значень за допомогою інструментів керування монітором або зміною параметрів степеня контрастності для даних з відеокартки... На відміну від калібрування, процес створення профілю є процесом характеризації пристрою, який не передбачає внесення будь-яких змін або коригувань щодо самого пристрою. Це скоріше процес вимірювання, результатом якого є файл, що містить точний математичний опис кольорових та тональних характеристик пристрою. Цей файл і є профілем ICC. Серед характеристик у файлі описано функцію, яка відображає простір кольорів пристрою на стандартний абсолютний простір кольорів (цей простір називається у профілі ICC профілем простору кольорів (Profile Color Space або PCS)), точки білого пристрою, точки чорного, основних параметрів та інших даних. Характеристики моніторів, зазвичай, вимірюють (профілюють) у каліброваному стані. Якщо підбити підсумок, калібрування змінює характеристики відтворення кольорів пристрою так, щоб це відтворення відповідало певному наперед визначеному стану. Профілювання ж або характеризація є процесом вимірювання, результатом якого є докладний опис характеристик відтворення кольорів (нормально відкаліброваного) пристрою. (цитата з цієї сторінки)

source: Calibrating your monitor technically is not really part of color management. But obviously a properly calibrated and/or profiled monitor is a prerequisite for a color-managed workflow. This tutorial does not cover the important topics of how to calibrate and profile a monitor. The ArgyllCMS and LProf documentations are very good and highly recommended reading. To use either of this software to calibrate and/or profile your monitor, you will need a spectrophotometer. A spectrophotometer (sometimes called a "spider") is a device for measuring the RGB values of color patches projected onto the monitor screen by calibration/profiling software such as Argyll and LProf. The Argyll website maintains an up-to-date list of supported spectrophotometers. I believe LProf can use all the spectrophotometers that Argyll can use, as the two programs share the relevant sections of code.
uk: Калібрування вашого монітора з технічної точки зору не є насправді частиною керування кольорами Але, очевидно, належним чином калібрований і/або профільований монітор є попередньою умовою роботи з керуванням кольорами У цьому підручнику ми не розповідатимемо вам про важливі теми щодо калібрування або профілювання моніторів Ці питання доволі добре висвітлено у документації до ArgyllCMS і LProf, ми наполегливо рекомендуємо вам з нею ознайомитися. Для того, щоб скористатися однією з цих програм для калібрування і/або профілювання вашого монітора, вам потрібен буде спектрофотометр. Спектрофотометр — це пристрій для вимірювання значень RGB для кольорів, які проектуються на екран монітора програмним забезпеченням з калібрування/профілювання моніторів, зокрема Argyll і LProf. На вебсайті Argyll ви можете знайти список сучасних спектрофотометрів, що підтримуються програмою. Здається, LProf може використовувати всі спектрофотометри, які може використовувати Argyll, оскільки у цих двох програм відповідні частини коду є спільними.

source: Can I calibrate my monitor without a spectrophotometer?
nl: Kan ik mijn monitor kalibreren zonder een spectrumfotometer?
uk: Чи можу я налаштувати свій монітор без спектрометра?

source: There are various methods given on the Internet for calibrating a monitor without using a spectrophotometer. These "eye-ball" methods are better than not calibrating your monitor at all, and depending your eyeball and your monitor, can produce quite usable results. But the eye-ball methods are not a substitute for a properly calibrated and profiled monitor. For the record, calibrating and profiling a monitor with a spectrophotometer, though intimidating at first, is not difficult. Spectrophotometers can be obtained for well under $100 US (if you opt for a more expensive model, make sure you are paying for a better piece of hardware, rather than just a more fully-featured accompanying bit of manufacturer's software that won't run under Linux). Argyll and/or LProf documentation will guide you through the process of calibrating and profiling your monitor, without your having to learn very much color management theory. And if/when you learn enough about color management to realize that you want or need a more detailed monitor profile of a particular type, for a particular purpose, these two softwares have all the advanced capabilities you could possibly hope for. Assuming I've decided to work exclusively in the sRGB color space, what "digiKam buttons" should I push after I calibrate my monitor?
uk: У інтернеті можна знайти різноманітні методики калібрування монітора без використання спектрофотометра. Використання методів «на око» є кращим, ніж повна відсутність калібрування монітора: все залежить від вашого ока і вашого монітора. Подібне калібрування може дати досить пристойні результати. Але всі подібні методи не можна розглядати як заміну професійного калібрування та профілювання монітора. Для довідки, калібрування і профілювання монітора за допомогою спектрофотометра, хоча і може здаватися складною справою, насправді не є складним. Спектрофотометр можна придбати за менше, ніж 100 доларів (якщо ви віддасте перевагу дорожчій моделі, переконайтеся, що гроші сплачено за краще обладнання, а не за додаткове програмне забезпечення, яке все одно не працюватиме у Linux). Документація з Argyll і/або LProf допоможе вам у процесі калібрування та профілювання вашого монітора,— глибокі знання у теорії керування кольорами вам не знадобляться. Якщо ж подальше вивчення керування кольорами наведе вас на думку, що вам потрібен докладніший профіль монітора певного типу, у цих двох програмах ви знайдете всі додаткові можливості, на які ви могли б очікувати. Припустімо, що мною було прийнято рішення працювати лише з простором кольорів sRGB. Які «кнопки digiKam» мені слід натискати після калібрування мого монітора?

source: If your monitor has been calibrated to the sRGB standard and you work exclusively in the sRGB color space, then you can disable color management in digikam. You don't need to tell digiKam what monitor profile to use because digiKam defaults to using the sRGB color space as the monitor color space profile. And you don't need to tell digiKam to use a color-managed workflow because digiKam defaults to using sRGB for your camera, printer, and working space, just as laid out by HP and MS back in 1996.
uk: Якщо ваш монітор було відкалібровано згідно стандартів sRGB і ви працюєте лише з простором кольорів sRGB, ви можете просто вимкнути керування кольорами у digiKam. Вам не потрібно буде повідомляти digiKam, що слід використовувати певний профіль монітора, оскільки, типово, digiKam налаштовано на використання простору кольорів sRGB як простору кольорів профілю монітора. Вам також не потрібно повідомляти digiKam про те, що слід використовувати керування кольорами під час роботи з зображеннями, оскільки, типово, digiKam налаштовано на використання sRGB для вашого фотоапарата, принтера і робочого простору, як і пропонували компанії HP та MS у далекому 1996 році.

source: But if you want to take the first steps toward a color-managed workflow, then refer to corresponding page of Settings, enable color management, and select sRGB as your monitor profile, your camera profile, your working space profile, and your printer profile. If you've also used Argyll or LProf to produce a monitor profile after you calibrated your monitor - perhaps named "mymonitorprofile.icc" - then tell digiKam to use "mymonitorprofile.icc" instead of sRGB as your monitor profile.
uk: Але, якщо ви бажаєте зробити перші кроки у роботі з використанням керування кольорами, зверніться до відповідного розділу цього підручника, увімкніть керування кольорами і оберіть профілем монітора, фотоапарата, робочого простору та принтера sRGB. Крім того, якщо у вас є профіль кольорів, створений після калібрування вашого монітора з використанням програм Argyll або LProf (ймовірно, він називається «mymonitorprofile.icc»), повідомте digiKam про те, що слід використовувати профіль монітора «mymonitorprofile.icc» замість sRGB.

source: Where are all the icc profiles are located on my computer?
nl: Waar zijn alle icc-profielen opgeslagen op mijn computer?
uk: Де розташовано всі профілі icc на моєму комп’ютері?

source: Well, this is Linux® and it depends on where you put them. I put all my icc profiles in the /usr/share/color/icc folder, which is the closest there is at this moment to a standard Linux location for icc profiles. If you use this folder for your icc profiles, likely you will need to change permissions on the folder to allow your user read/write access. Then you just tell digiKam where your profiles are located. Does the lighting and wall/ceiling/drape/furniture colors near my monitor matter?
uk: Гаразд, це Linux® і все залежить від того, де вони зберігаються Я зберігаю свої профілі icc у теці /usr/share/color/icc, що є найближчим на сьогодні до стандартного розташування профілів icc у Linux. Якщо ви користуєтеся саме цією текою для зберігання ваших профілів icc, ймовірно, вам слід змінити права доступу до цієї теки так, щоб уможливити вашому користувачеві доступ до читання і запису файлів з цієї теки. Після цього вам достатньо повідомити digiKam, де зберігаються ваші профілі. Чи мають значення освітлення і кольори стін/стелі/завіси/меблів поряд з монітором?

source: Yes! Good lighting is a prerequisite for proper image editing and for comparing prints to the image on your screen. If the lighting near your workstation is too bright, colors on your monitor look too dark, and conversely. If the light from the fixtures in your workroom have a low CRI (color rendering index, meaning you don't have full spectrum bulbs), or if the light in your workroom comes from a window and so varies as the weather and time of day varies (or worse, is filtered through colored drapery), or if the walls and ceiling are creating color casts on your monitor, then your editing process will "correct" color casts that don't really exist. Best advice, as far as is consistent with maintaining harmony in the family: neutral grey walls and ceiling, cover the windows, wear neutral clothing, set appropriate light levels using appropriate bulbs and fixtures. For more information on what are the appropriate light levels, bulbs and fixtures for editing images and viewing prints, see the following articles:
nl: Ja, goede verlichting is een eerste vereiste voor het juist bewerken van uw beelden en om afdrukken te vergelijken met het beeld op het beeldscherm. Als het licht bij uw werkstation te helder is zullen de kleuren op uw beeldscherm te donker lijken en omgekeerd, als het licht van de lampen in uw werkkamer een lage CRI (color rendering index) heeft, dan betekent dat dat u geen lampen met een volledig kleurenspectrum heeft, of als uw werkkamer door een raam verlicht word en het licht dus verandert met het veranderen van het weer of de tijd van de dag. (of nog erger als u gekleurde gordijnen heeft), of als de muren kleuren werpen op uw beeldscherm dan zal uw bewerkingsproces gecorrigeerde kleuren opleveren die niet echt bestaan. Het beste advies voor zover mogelijk voor behoud van de harmonie in uw gezin: neutraal grijze wanden en plafond, dek ramen af, draag neutrale kleding en schaf passende lichtniveaus en lampen en armaturen aan. Zie voor meer informatie over wat de passende lichtniveaus, lampen en armaturen zijn voor het bewerken van beelden en bekijken van afdrukken, de volgende artikelen.
uk: Так! Добре освітлення є попередньою умовою належного редагування зображень та порівняння надрукованих зображень з зображенням на екрані. Якщо освітлення поряд з вашою робочою станцією буде надмірним, кольори на вашому моніторі виглядатимуть занадто темними, і навпаки. Якщо освітлення від ламп у вашій робочій кімнаті має низький показник відтворення кольорів (тобто лампи освітлюють приміщення лише у обмеженому діапазоні спектру), або якщо світло у вашій робочій кімнаті надходить з вікна, а отже змінюється відповідно до погоди та часу доби (або, ще гірше, проходить через кольорові фіранки), або якщо стіни і стеля створюють кольорові відсвіти на вашому моніторі, під час редагування зображень вам не вдасться досягти належного виправлення кольорів. Можемо лише порадити, якщо це не порушить мир і гармонію у сім’ї, пофарбуйте стіни і стелю у світло-сірий колір, затуліть вікна, одягніть одяг нейтрального кольору, встановіть відповідний рівень освітлення за допомогою належних ламп та елементів освітлення. Докладніше про належний рівень освітлення, лампи і освітлювальні прилади для редагування зображень та перегляду відбитків можна дізнатися зі статей за такими адресами:

source: `The Darkroom Makes a Comeback (part 1) <https://creativepro.com/the-darkroom-makes-a-comeback/>`_
uk: `The Darkroom Makes a Comeback (частина 1) <https://creativepro.com/the-darkroom-makes-a-comeback/>`_

source: `The Darkroom Makes a Comeback (part 2) <https://creativepro.com/the-darkroom-makes-a-comeback-part-2-/>`_
uk: `The Darkroom Makes a Comeback (частина 2) <https://creativepro.com/the-darkroom-makes-a-comeback-part-2-/>`_

source: The Camera Profile and Raw File Development
nl: Het cameraprofiel en zaken met betrekking tot het ontwikkelen van een raw-bestand
uk: Профіль фотоапарата і проявлення файлів цифрових негативів

source: What's the next step in color management?
nl: Wat is de volgende stap in kleurbeheer?
uk: Яким буде наступний крок у керуванні кольорами?

source: First and for the record, many excellent professional and amateur photographers save all their images as in-camera jpegs and work exclusively in the sRGB color space. But if you want to work in a larger color space, or if you want to work with raw files (even if you output sRGB image files from your raw files), read on.
nl: Ten eerste, en voor de goede orde, veel uitmuntende professionele en amateurfotografen slaan al hun beelden uitsluitend op als in-camera jpegs in de sRGB kleurruimte. Maar als u wil werken in ruimere kleurruimten of als u wilt werken met RAW bestanden (zelfs als u sRGB beelden van uw RAW bestanden wilt maken) lees dan verder.
uk: По-перше і для довідки, багато чудових професіональних фотографів та фотографів-аматорів зберігають створені ними зображення за допомогою вбудованих інструментів камери у форматі jpeg і працюють у просторі кольорів sRGB. Але, якщо ви бажаєте працювати у ширшому просторі кольорів або якщо ви бажаєте працювати з файлами цифрових негативів (навіть якщо результатом обробки буде файл зображення у просторі кольорів sRGB), ознайомтеся з наведеними тут відомостями.

source: Judging from questions asked in the digiKam user's forum, if you are reading this tutorial you probably are shooting raw images with a digital dSLR and you are hoping that somewhere in the arcane waters of color management lies the answer to how to get a nice picture from your raw image file. And you're right! The next thing you need is the right camera profile for developing your raw image. But first let's answer the question you really might have been asking.
uk: Судячи з питань, які задають користувачі на форумі digiKam, якщо ви читаєте цей підручник, ймовірно, ви знімали ваші цифрові негативи за допомогою цифрового dSLR, а тепер сподіваєтеся, що десь на таємних хвилях керування кольорами ви знайдете відповідь на питання: як отримати чудове зображення з вашого файла цифрового негатива. Ви праві! Для отримання результату вам знадобиться належний профіль фотоапарата. Але спочатку наведемо відповідь на питання, яке вже певно у вас виникло, а саме:

source: Why doesn't the image produced by raw converters like Libraw look like the embedded preview displayed by digikam?
uk: Чому зображення, створені за допомогою інструментів перетворення зображень цифрових негативів, на зразок libraw, відрізняються від вбудованих мініатюр, які показує digikam?

source: Glad you asked. All digital camera images start out as raw files, whether or not the camera allows the user the option to save the image as a raw file. When you ask the camera to save jpegs instead of raw files, the camera uses its on-board processor to convert the raw file to a jpeg. That embedded preview is what your final image would have looked like if you had set your camera to save jpegs instead of raw files.
nl: Blij dat u dat vroeg. Alle digitale camerabeelden beginnen als RAW bestand, of de camera de gebruiker nu toestaat de beelden als RAW bestand op te slaan of niet. Als u de camera nu vraagt om jpeg op te slaan in plaats van RAW bestanden, dan zal de camera altijd de ingebouwde processor gebruiken om de RAW bestanden te converteren naar jpeg. Die ingebouwde voorbeeldversie is hoe uw uiteindelijke beeld er uit zou zien als u de camera had ingesteld om jpeg op te slaan in plaats van RAW bestanden.
uk: Радий, що ви спитали. Всі цифрові фотоапарати створюють файли цифрових негативів (raw), надає чи ні фотоапарат змогу користувачеві зберегти зображення у форматі цифрового негатива. Якщо ви налаштуєте фотоапарат так, щоб він зберігав зображення у форматі jpeg, а не у форматі цифрового негатива, вбудований процесор фотоапарата перетворить файл цифрового негатива на файл у форматі jpeg. У вбудованому перегляді ви можете побачити, як виглядатиме ваш знімок, якщо налаштувати фотоапарат на збереження файлів jpeg замість файлів цифрових негативів.

source: From here I will speak from my experience as a Canon user, but I will guess that most or all entry-level and mid-range dSLRs behave in a similar manner. Canon offers the user several picture styles - neutral, standard, portrait, landscape, and so forth - that determine what kind of processing will be done to the raw image file to produce the final image, whether or not the processing is done "in-camera" or later, using the proprietary Canon DPP software. The Canon DPP raw processing software does give the user additional control, but still manipulates the raw image file in accordance with the chosen picture style. Most of the Canon picture styles add a heavy S-curve and extra color saturation to give the picture more "pop". Even if you choose the "neutral" picture style (the Canon picture style that gives you the least modified tonality); and select "less contrast", "less saturation", "no noise reduction", and "no sharpening" in the DPP raw development dialog, you will find, if you know what to look for, that an S-curve and also shadow denoising has been applied to your image.
nl: Ik spreek hier uit ervaring als Canon gebruiker, maar ik schat dat de meeste of alle beginners en middenklasse DSLR's zich zo gedragen. Canon biedt gebruikers verschillende stijlen voor opnamen; neutraal, standaard, portret, landschap, enz. die bepalen wat voor bewerking zal worden uitgevoerd op de raw opname om het uiteindelijke beeld te vormen. Of de bewerking nu in-camera of later met gebruik van de meegeleverde Canon DPP programmatuur wordt uitgevoerd. Het Canon DPP raw verwerkingsprogramma biedt de gebruiker uitgebreidere mogelijkheden voor bewerking maar behandelt het raw bestand nog steeds in overeenstemming met de gekozen fotostijl. De meeste van de Canon fotostijlen voegen een zware S-kromme en extra kleurverzadiging toe om het beeld meer pit te geven. Zelfs als u kiest voor een neutrale opnamestijl (de Canon opnamestijl die de minst gewijzigde toon hanteert) en u selecteert "minder contrast", "minder verzadiging", "geen ruisonderdrukking" en geen "verscherping" in de DPP raw dialoog dan zult u ontdekken, als u weet waar u moet zoeken, dat een S-kromme en ook schaduw ruisonderdrukking werd toegepast.
uk: Наведене нижче є висновками з досвіду автора, як користувача продукції Canon, але, здається, більшість або навіть всі dSLR (цифрові дзеркальні фотоапарати) початкового та середнього рівнів поводяться подібно. У Canon користувачеві пропонується декілька стилів зображення: нейтральний (neutral), стандартний (standard), книжковий (portrait), альбомний (landscape) тощо, — за допомогою яких фотоапарат визначає спосіб обробки цифрового негатива для отримання остаточного зображення, незалежно від того, буде обробку виконано у фотоапараті або поза ним за допомогою комерційного програмного забезпечення DPP Canon. Програмне забезпечення для обробки цифрових негативів DPP від Canon надає користувачеві додаткові можливості керування, але все ж виконує обробку цифрового негатива відповідно до попередньо вибраного стилю зображення. Використання більшості з стилів зображення Canon значно змінює криву насиченості і додає насиченості до зображення, щоб зробити його «яскравішим». Навіть якщо ви оберете «нейтральний» стиль зображення (стиль зображення Canon, який найменше змінює тональність); а потім оберете «менше контрастності» ("less contrast"), «менше насиченості» ("less saturation"), «не усувати шум» ("no noise reduction") і «не збільшувати різкість» ("no sharpening") у діалоговому вікні обробки цифрових негативів DPP, ви побачите, якщо знаєте, де шукати, що до зображення було застосовано зміну кривої насиченості та усування шуму на тінях.

source: The embedded jpeg preview looks so much nicer than Libraw's output. What is the value in scene-referred tonality?
uk: Зображення jpeg вбудованого перегляду виглядає набагато краще за виведене libraw. Яким є значення пов’язаної зі сценою тональності?

source: Where do I find good information on digital noise?
nl: Waar vind ik goede informatie over digitale ruis?
uk: Де можна знайти гарну документацію щодо цифрового шуму?

source: See the following excellent articles:
nl: Zie de volgende uitstekende artikelen:
uk: Ознайомтеся з цими чудовими статтями:
