Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/image_editor/color_management.po
Languages: nl, uk

source: Currently, the ICC [International Color Consortium]... tracks and ensures that a color is correctly mapped from the input to the output color space... by attaching a profile for the input color space to the image in question. This is appropriate for high end users. However, there are a broad range of users that do not require this level of flexibility and control. Additionally, most existing file formats do not, and may never support color profile embedding, and finally, there are a broad range of uses [that] actually discourage people from appending any extra data to their files. A common standard RGB color space addresses these issues ... by merging the many standard and non-standard RGB monitor spaces into a single standard RGB color space. Such a standard could dramatically improve the color fidelity in the desktop environment. For example, if operating system vendors provide support for a standard RGB color space, the input and output device vendors that support this standard color space could easily and confidently communicate color without further color management overhead in the most common situations. (archived copy)
uk: Зараз за точністю відображення простору кольорів вхідних даних на простір вихідних даних стежить і забезпечує ICC [International Color Consortium]... додаванням профілю простору кольорів вхідних даних до зображення. Цей підхід можна використовувати для корпоративних користувачів. Але існує широке коло користувачів, яким подібний рівень гнучкості і керування просто не потрібен. Крім того, більшість наявних форматів файлів не підтримують, і, можливо, ніколи не підтримуватимуть, вбудовування профілів кольорів, і, нарешті, існує широке коло користувачів, які не бажають, щоб програми додавали будь-які дані до їх файлів. Загальний стандартний простір кольорів RGB має вирішити всі ці проблеми... об’єднанням багатьох стандартних і нестандартних просторів кольорів RGB у один стандартний простір кольорів RGB. Подібний стандарт може значно покращити точність відтворення кольорів у стільничних середовищах. Наприклад, якщо виробники операційних систем забезпечуватимуть підтримку стандартного простору кольорів RGB, виробники пристроїв отримання та виводу даних, які підтримуватимуть цей стандартний простір кольорів зможуть забезпечити просте і точне передавання даних про колір без потреби у додатковій обробці у найпоширеніших випадках. (копія з архіву)

source: To summarize, the point of the by-now almost universally adopted sRGB color space was and is to make life easier for consumers (no need to worry about color management), less expensive for manufacturers (no need to worry about compatibility between consumer-level digital cameras or scanners, monitors, printers, and so forth), and more convenient for displaying images on the Internet (don't worry about embedding and reading icc profiles - just assume sRGB).
uk: Підбиваючи підсумок метою запровадження найпоширенішого зараз та загальноприйнятого простору кольорів sRGB було і є спрощення життя споживачів (немає потреби непокоїтися щодо керування кольорами), зменшення витрат виробників (немає потреби у забезпеченні сумісності між непрофесійними цифровими фотоапаратами або сканерами, моніторами, принтерами тощо) та створення умов для зручного показу зображень у інтернеті (не потрібно непокоїтися щодо вбудовування і читання профілів icc: типовим профілем завжди є sRGB).

source: So if sRGB works so well and makes life so easy for everyone, why use any other color space and thus be forced to worry about color management issues?
nl: Dus, als sRGB zo goed werkt en het leven voor iedereen zo gemakkelijk maakt, waarom zou je nog een andere kleurruimte gebruiken en dus gedwongen worden om zich zorgen te maken over zaken als kleurbeheer?
uk: Отже, якщо sRGB працює належним чином і полегшує всім життя, навіщо використовувати інші простори кольорів, а отже перейматися проблемами з керуванням кольорами?

source: sRGB was designed to contain colors easily displayed on consumer-oriented monitors and printed by consumer-oriented printers manufactured in 1996. This least-common-denominator set of viewable and printable colors - the technical term is "color gamut" - is much smaller than the set of colors we can see in the real world, much smaller than the set of colors today's digital cameras can capture, much smaller than the set of colors today's printers can print, and much smaller than the color gamut of the new wide gamut monitors that are beginning to enter the consumer market. For anyone who wants to make use of the wider color gamuts available today even at the consumer level, the gamut of sRGB is too small. Conversely, if you don't intend to make use of an expanded gamut of colors at any point in your digital imaging workflow, then you don't need to worry about non-sRGB color spaces and all the attending intricacies of color management.
nl: sRGB werd ontworpen om kleuren te bevatten die gemakkelijk getoond konden worden op beeldschermen voor consumenten en afgedrukt konden worden op printers voor consumenten die in 1996 gefabriceerd werden. Deze set met de kleinste gemene deler van toonbare en afdrukbare kleuren - de technische benaming is "kleurengamma" - is veel kleiner dan de set kleuren die wij in werkelijkheid kunnen zien, veel kleiner ook dan de set kleuren die digitale camera's kunnen vastleggen, veel kleiner dan hedendaagse printers kunnen printen en veel kleiner dan het kleurengamma van de nieuwe, breedspectrum beeldschermen die op de markt voor consumenten aangeboden worden. Voor wie gebruik wil maken van de bredere kleurengamma's die beschikbaar zijn, zelfs op het niveau van de gewone consument is het gamma van sRGB veel te klein. Omgekeerd, als u niet van plan bent om om gebruik te maken van bredere kleurengamma's op enig moment in uw digitale beeldbewerkingsproces dan hoeft u zich geen zorgen te maken over niet-sRGB kleurruimten en alle bijbehorende ingewikkeldheden van kleurbeheer.
uk: sRGB було розроблено таким чином, щоб у цьому просторі містилися кольори, які просто показати на поширених серед споживачів моніторах і надрукувати на поширених серед споживачів у 1996 році принтерах. Цей «спільний знаменник» серед просторів кольорів для перегляду і друку — технічний термін «палітра кольорів» ( "color gamut") — є значно вужчим, ніж набір кольорів, які ми бачимо у реальному світі, набагато вужчим, ніж набір кольорів, які здатні відтворювати сучасні цифрові фотоапарати, набагато вужчим, ніж набір кольорів, який здатні друкувати сучасні принтери, і набагато вужчим, ніж палітра сучасних моніторів з широкою палітрою, які починають з’являтися на роздрібному ринку. Всі, хто бажає скористатися ширшими палітрами кольорів, які доступні зараз рядовим споживачам, палітра sRGB є завузькою. І навпаки, якщо ви не маєте наміру користуватися розширеною палітрою кольорів на будь-якому кроці обробки цифрових зображень, вам не потрібно перейматися просторами кольорів, відмінними від sRGB, та всіма тонкощами керування кольорами.

source: How small is sRGB?
nl: Hoe klein is sRGB?
uk: Наскільки вузьким є діапазон sRGB?

source: A visual representation of the limitations of sRGB compared to the colors we actually see in the real world is presented here after. It shows a two-dimensional representation of all the colors we can see (the horseshoe-shaped region) and the colors contained in the sRGB space (the smaller triangular region).
nl: Een beeld van de beperkingen van sRGB in vergelijking met de kleuren die we in werkelijkheid zien wordt hieronder getoond. Het toont een twee dimensionaal beeld van alle kleuren die we kunnen zien (het hoefijzervormige gebied) en de kleuren die de sRGB ruimte omvat (het kleinere driehoekige gebied).
uk: Нижче наведено наочне зображення обмежень sRGB, порівняно з кольорами, які ми спостерігаємо у навколишньому світі. На зображенні показано двовимірну карту всіх кольорів, які ми здатні бачити (копитоподібна область), і кольорів, що містяться у просторі кольорів sRGB (менша трикутна область).

source: If you would like to see a two-dimensional representation of sRGB compared to some of the larger working color spaces, see Bruce Lindbloom's excellent site, click on "Info" then on "Information About RGB Working Spaces".
uk: Якщо ви бажаєте побачити двовимірне представлення sRGB з порівнянням з деякими з більших просторів кольорів, завітайте до чудового сайта Брюса Ліндблума (Bruce Lindbloom), натисніть посилання "Info" (Інформація), а потім "Information About RGB Working Spaces" (Інформація щодо робочих просторів RGB).

source: Calibrating and Profiling Your Monitor RGB
nl: Kalibreren en profileren van de RGB van uw monitor
uk: Калібрування та профілювання RGB для вашого монітора

source: If I choose to work exclusively in the sRGB color space, do I need to calibrate my monitor?
nl: Als ik uitsluitend werk in de sRGB kleurruimte, moet ik dan mijn monitor kalibreren?
uk: Якщо я працюватиме лише з простором кольорів sRGB, чи слід мені налаштовувати мій монітор?

source: Yes! Whether you stay within the color gamut provided by sRGB or not, you need a properly calibrated monitor because sRGB assumes that your monitor is calibrated to sRGB. Your monitor calibration closes the loop. If you work within the color gamut provided by sRGB then you need to calibrate your monitor to the sRGB standard (or produce and use an accurate monitor profile, or both). What are the consequences of working with an uncalibrated monitor?
uk: Так! Будете ви використовувати кольорову палітру sRGB чи ні, вам слід налаштувати ваш монітор належним чином, оскільки за використання sRGB вважатиметься, що ваш монітор відкалібровано саме для sRGB. Калібрування вашого монітора завершує цикл налаштування. Якщо ви працюєте з палітрою кольорів sRGB, вам слід відкалібрувати ваш монітор відповідно до стандартів sRGB (або створити і використовувати точний профіль монітора, або зробити і те, і інше). Якими є наслідки роботи із некаліброваним монітором?

source: There are several possible consequences, none of them good. Every monitor, calibrated or otherwise, has a native (uncalibrated) white point, expressed as a temperature in degrees Kelvin. The white point of a monitor (calibrated or not) is the color you see when you are looking at a patch of pure white on your screen. Pure white is when the RGB values in your image all equal 255 (as expressed in 8-bits), such as the plain white background of a web page or an office document. You are thinking, "white is white" but if you were able to line up several monitors calibrated to different white points, you would see that the higher the temperature of the monitor's white point, the bluer the screen looks in comparison with monitors with lower white points. If you can find the controls of your own monitor, change the temperature up and down (remembering to put it back to its initial setting when you are done, unless you decide you want a different white point). Your eyes, which adapt quickly to a constant white point, will easily discern the screen getting bluer and yellower as you move the white point higher and lower. If your uncalibrated monitor is too blue (native CRT color temperature is typically 9300K and sRGB assumes 6500K), as you edit your image you will overcompensate and produce images that will look yellowish and too warm on a properly calibrated monitor. Conversely, if your monitor is too yellow because the color temperature is set too low (I believe LCD native color temperature is around 5500K), your images will look blueish/too cool on a properly calibrated monitor.
nl: Er zijn verschillende mogelijke consequenties. Geen van hen is goed. Elk beeldscherm, gekalibreerd of anders, kent een eigen (gekalibreerd) witpunt dat wordt uitgedrukt als temperatuur in graden Kelvin. Het witpunt van een beeldscherm (gekalibreerd of niet) is de kleur die u ziet als u kijkt naar een stukje zuiver wit op het beeldscherm. Zuiver wit is wanneer de RGB waarden in uw afbeelding allen gelijk zijn aan 255 (uitgedrukt in 8 bits), zoals de egaal witte pagina van een webpagina of een office document. U denkt misschien wit is wit, maar als u verschillende beeldschermen, die allen gekalibreerd zijn op verschillende witpunten, dan zou u zien dat hoe hoger de temperatuur van het witpunt van het beeldscherm, hoe blauwer het scherm toont in vergelijking met schermen met een lager witpunt. Als u de instellingen van uw eigen beeldscherm kunt vinden, wijzig dan de temperatuur naar boven of naar beneden (vergeet niet om die weer terug te zetten naar beginstand wanneer u klaar bent, behalve als u besluit dat u een ander witpunt wilt instellen). Uw ogen, die zich snel aanpassen aan een constant witpunt, zullen gemakkelijk het verschil zien wanneer het scherm blauwer en geler wordt naarmate u de aanwijzer hoger en lager beweegt. Als uw niet gekalibreerde scherm te blauw is (ingebouwde CRT kleurtemperatuur is 9300K en sRGB gaat er van uit dat het 6500K is) als u dan uw beeld bewerkt dan zult u overcompenseren en beelden produceren die te geel en te warm van kleur lijken op een juiste gekalibreerd beeldscherm. Omgekeerd, als uw beeldscherm te geel is omdat de kleurtemperatuur te laag werd ingesteld (ik geloof dat ingebouwde kleurtemperatuur van LCD schermen ongeveer 5500K is), dan zullen uw afbeeldingen blauwachtig/te koel lijken op een juist gekalibreerd beeldscherm.
uk: З вищенаведеного випливає декілька наслідків, жоден з яких не є доброю новиною. Будь-який монітор, калібрований чи ні, має власну (некалібровану) точку білого, яку можна виміряти у градусах Кельвіна. Точка білого монітора (каліброваного чи ні) є кольором, який ви бачите, коли дивитеся на повністю білі ділянки зображення на екрані. Повністю білим вважається колір, всі значення компонент RGB якого рівні 255 (у 8-бітовому представленні), зокрема колір тла вебсторінок або офісних документів. Ви можете подумати: «білий — це білий», але, якби ви могли порівняти декілька моніторів відкаліброваних на різні точки білого, ви б переконалися, що чим вищою є температура точки білого монітора, тим синішим виглядає білий колір, порівняно з моніторами з нижчою температурою точки білого. Якщо ви знаєте, як керувати вашим монітором, спробуйте збільшити або зменшити температуру (не забудьте після експерименту повернути початкове значення, якщо наслідки його зміни вам не сподобалися). Ваші очі, які швидко пристосовуються до сталої точки білого, з легкістю доведуть вам те, що зображення стане синішим, якщо ви підвищите точку білого, і жовтішим, якщо знизите її. Якщо зображення на вашому некаліброваному моніторі буде зсунуто за кольором у напрямку синього кольору (типовим значенням кольорової температури CRT є 9300K, типовим же значенням sRGB є 6500K) під час редагування вашого зображення, вами буде створено зображення з перевищенням витримки, яке виглядатиме жовтуватим з занадто теплими кольорами на належно каліброваному моніторі. І навпаки, якщо зображення кольорів на вашому моніторі зсунутим у бік жовтих кольорів, оскільки встановлено занизьку температуру (думаю, типовим значенням кольору LCD є значення близько 5500K), ваші зображення виглядатимуть синюватими і надто холодними на належним чином каліброваному моніторі.

source: Setting a proper white point is only part of monitor calibration. You also need a proper black point, brightness (luminance), and gamma (transfer) function. If your monitor is too dark because the black point is set too low, you will overcompensate and produce images that look washed out on a properly calibrated monitor. Conversely, if your monitor black point is set too high, your images will look took dark and overly saturated on a properly calibrated monitor.
nl: Het juiste witpunt instellen is slechts een deel van de kalibratie van het beeldscherm. U heeft ook een exact zwartpunt, helderheid en kleurengamma nodig. Als uw beeldscherm te donker is omdat het zwartpunt te laag is ingesteld dan zult u overcompenseren en beelden krijgen die er bleek uitzien op een juist ingesteld beeldscherm. Andersom, als het zwartpunt van uw beeldscherm te hoog is ingesteld dan zullen uw beelden te donker en oververzadigd lijken op een juist ingesteld beeldscherm.
uk: Встановлення належної точки білого є лише частиною калібрування монітора. Крім того, вам слід встановити належну точку чорного, яскравість (освітленість) і функцію коефіцієнта контрастності (гами або перенесення). Якщо зображення на вашому моніторі буде занадто темним, оскільки встановлено занизьку точку чорного, під час обробки ви засвітите знімки, отже вони виглядатимуть збляклими на належним чином каліброваному моніторі. І навпаки, якщо встановлено зависоку точку чорного, після обробки знімки будуть тьмяними і занадто насиченими на моніторі, відкаліброваному належним чином.

source: If the brightness/contrast is set too high, you will assume your images have a lot more "pop" than they really have when viewed on a properly calibrated monitor, plus your eyes will hurt and your LCD screen will burn out faster.
nl: Als de helderheid/contrast te hoog is ingesteld, dan neemt u aan dat uw afbeeldingen meer "pop" hebben dan ze werkelijk hebben wanneer ze bekeken worden op een goed gekalibreerde monitor, plus dat uw ogen zeer gaan doen en uw LCD-scherm sneller zal inbranden.
uk: Якщо встановлено зависокі значення яскравості/контрастності, ви вважатимете зображення набагато яскравішими, ніж вони насправді є під час перегляду на належно каліброваному моніторі, крім того, ваші очі втомлюватимуться, а ваш LCD-монітор швидше вийде з ладу.

source: If your monitor gamma is improperly set, your tonal variations from dark to light will be off. That is, the shadows or highlights might be overly compressed or expanded, leading you to compensate in the opposite direction. So when viewed on a properly calibrated monitor, the shadows might be too bright or dark (or the highlights too dark or bright), with the rest of the image suffering from tonal over-compression. And heaven help you if the internal R, G, and B guns (or LCD equivalent) of your monitor are improperly set (each gun has its own black point and gain), because the resulting color casts - too green, too magenta, too orange, etc. that you will inevitably create by "correcting" your image during editing - are very obvious when viewed on a properly calibrated monitor.
uk: Якщо степінь контрастності (гаму) вашого монітора встановлено неправильно, тональні зміни від темного до світлого буде показано неправильно. Це означає, що затінені та підсвічені ділянки буде занадто стиснуто або розтягнуто, що змусить вас до встановлення параметрів, які компенсуватимуть ці ефекти. Отже, якщо створене зображення після цього переглянути на належним чином каліброваному моніторі, тіні можуть виявитися занадто світлими або занадто темними (а підсвічування занадто темними або світлими), кольори ж решти зображення буде занадто стиснуто у тонах. Якщо ж внутрішні променеві гармати R, G і B (або їх еквіваленти для LCD-моніторів) налаштовано неправильно (кожна з гармат має власну точку білого і підсилення), вам, мабуть, мало що може допомогти, оскільки остаточні похибки — занадто зелені, занадто малинові, занадто жовті тощо зображення, які неминуче буде створено у результаті «виправлення» зображення під час редагування — будуть очевидними під час перегляду за допомогою належним чином каліброваного монітора.

source: Whether or not your monitor is properly calibrated, you might be surprised by the results of comparing an image you've edited on your home monitor to the same image as displayed by other monitors in your house or on your friend's and neighbor's monitors. We certainly were - we have two Sony Trinitron monitors in our home, one with a failing (too high) green gun and one with a failing (too high) blue gun. Every image edited on either monitor looked very wrong on the other monitor, until we purchased a spectrophotometer to calibrate and profile both monitors. Unfortunately, at this point neither of these two monitors can be calibrated to display a proper black point, so they are no longer used for image editing - the point being that an additional benefit of using a spectrophotometer is you know when it's time replace your monitor. The meaning of "black point" and "brightness" seems pretty clear, but what does "gamma" mean?
uk: Було чи не було належним чином калібровано ваш монітор, результати порівняння зміненого вами за допомогою вашого домашнього монітора зображення з тим самим зображенням, але показаним на інших моніторах у вас вдома чи у приятелів або сусідів, можуть викликати здивування. Ми стикалися з тими самими проблемами: у нас було два монітори Sony Trinitron, один з яких мав неправильно налаштовану (занадто підсилену) зелену гармату, а один — неправильно налаштовану (занадто підсилену) синю гармату. Зображення, відредаговане на одному з моніторів, виглядало зовсім інакше на іншому моніторі, аж доки ми не придбали спектрофотометр для калібрування та профілювання обох моніторів. На жаль, так і не вдалося відкалібрувати ці два монітори на показ належної точки чорного, отже довелося припинити редагування зображень на цих моніторах. Висновок: за допомогою спектрофотометра ви можете визначитися з моментом, коли слід замінити ваш монітор. Зі значенням понять «точка чорного» і «яскравість» усе зрозуміло, але що таке «гамма»?

source: See this Wikipedia article for an overview of the role of gamma in monitors and photography; the links at the bottom of the article are all excellent sources of additional information. Wikipedia says "Gamma compression, also known as gamma encoding, is used to encode linear luminance or RGB values into video signals or digital video file values; gamma expansion is the inverse, or decoding, process ... Gamma encoding helps to map data (both analog and digital) into a more perceptually uniform domain." Yeah, I know, clear as mud. Read the Wikipedia article and study the pictures. Eventually it will sink in. If you wade very deeply into image editing and color management, eventually you will need to make decisions about what gamma (or other encoding/decoding function) you want to use when you calibrate your monitor, profile your digital camera, and choose a working color space. When in doubt (for those of you who just want to know which button to push!), gamma=2.2 is a widely-used value, both for monitor calibration and working color spaces. What's the difference between calibrating a monitor and profiling a monitor?
uk: На цій сторінці Вікіпедії наведено огляд ролі степеня контрастності (гами) у роботі з моніторами та у фотомистецтві; посилання, наведені наприкінці цієї статті є чудовим джерелом додаткових відомостей. У Вікіпедії написано: «Стискання гами, також відоме як кодування гами, використовується для кодування лінійної освітленості або значень RGB у відеосигнали або дані файла цифрового відео; розгортання гами є зворотнім процесом декодування... За допомогою кодування гами можна відобразити дані (аналогові і цифрові) у одноріднішу для сприйняття область.» Так, я знаю, зрозуміло, що нічого не зрозуміло. Прочитайте статтю у Вікіпедії та вивчіть наведені там ілюстрації. Розуміння прийде згодом. Якщо ви глибоко зануритеся до редагування зображень та керування кольорами, у вас врешті виникне потреба у прийнятті рішень щодо того, який степінь контрастності (гаму або іншу функцію кодування-декодування) ви бажаєте використовувати під час калібрування вашого монітора, профілювання вашого цифрового фотоапарата і вибору вашого робочого простору. Якщо ви не знаєте, яке значення слід вибрати (для тих з вас, хто просто бажає знати, яку кнопку слід натиснути!), найпоширенішим значенням є гама=2,2, як для калібрування монітора, так і для робочих просторів кольорів. У чому ж різниця між калібруванням і профілюванням монітора?
