Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/image_editor/color_management.po
Languages: nl, uk

source: The gamma of a color profile dictates what power transform needs to take place to properly convert from an image's embedded color profile (perhaps your working color space) to another color profile with a different gamma, such as (i)the display profile used to display the image on the screen or (ii)perhaps to a new working space, or (iii)perhaps from your working space to your printer's color space.
nl: Het gamma van een kleurprofiel dicteert welke krachtconversie nodig is om een juiste conversie te doen van het ingebouwde kleurprofiel van een beeld (misschien uw kleurwerkruimte) naar een ander kleurprofiel met een ander gamma. Zoals (i) het weergaveprofiel dat gebruikt wordt om het beeld op het beeldscherm te krijgen. Of (ii) misschien naar een andere kleurwerkruimte, of (iii) misschien van uw kleurwerkruimte naar de kleurruimte van uw printer.
uk: Гама профілю кольорів визначає, яке степеневе перетворення слід виконати для належного перетворення з вбудованого простору кольорів зображення (можливо, вашого робочого простору кольорів) до іншого простору кольорів з іншою гамою, зокрема (а) профілю монітора, що використовується для показу зображення на екрані, (б) нового робочого простору або (в) з вашого робочого простору до простору кольорів принтера.

source: Mathematically speaking, for a power transform you normalize the RGB numbers and raise the resulting numbers to an appropriate power depending on the respective gammas of the starting and ending color space, then renormalize the results to a new set of RGB numbers. Lcms does this for you when you ask lcms to convert from one color space to another; however, if ALL you are doing is a power transform, use imagemagick instead of lcms and just manipulate the RGB numbers directly - the results will be more accurate.
nl: Wiskundig gezien, voor een vermogenstransformatie normaliseert u de RGB-waarden en verhoogt u de verkregen waarden naar een juiste macht afhankelijk van de respectievelijke gamma's van de beginnende en eindigende kleurruimte. Dan normaliseert u opnieuw de resultaten naar een nieuwe reeks RGB-waarden. Lcms doet dit voor u wanneer u lcms vraagt te converteren van de ene kleurruimte naar de andere; echter, als het enige dat u wilt doen is, een macht te transformeren, gebruik dan imagemagick in plaats van LCMS en manipuleer de RGB-waarden rechtstreeks - de resultaten zullen nauwkeuriger zijn.
uk: Якщо говорити мовою математики, для степеневого перетворення ви нормалізуєте числа RGB і підносите отримані числа до відповідного степеня, що залежить від відповідних гам початкового та кінцевого просторів кольорів, а потім виконуєте операцію, обернену до нормалізації, щоб отримати новий набір чисел RGB. Цю роботу за вас виконує lcms, коли ви наказуєте програмі перетворити зображення з одного простору кольорів до іншого. Але, якщо перетворення полягає ЛИШЕ у переході між однаковими просторами кольорів з різною гамою, краще скористатися не LCMS, а imagemagick і виконати безпосереднє перетворення чисел RGB, а потім призначити для зображення новий простір кольорів: результати будуть точнішими, ніж за виконання повноцінного перетворення просторів кольорів.

source: One practical consequence of the gamma of a working space is that the higher the gamma, the more tones are available for editing in the shadows, with consequently fewer tones available in the highlights. So theoretically, if you are working on a very dark-toned (low key) image you might want a working space with a higher gamma. And if you are working on a high key image, say a picture taken in full noon sunlight of a wedding dress with snow as a backdrop, you might want to choose a working space with a lower gamma, so you have more available tonal gradations in the highlights. But in the real world of real image editing, almost everyone uses working spaces with either gamma 1.8 or 2.2.
nl: Een praktische eigenschap van het gamma van een kleurruimte is dat hoe hoger het gamma, hoe meer tonen er beschikbaar zijn in donkere partijen en hoe minder tonen beschikbaar zijn in de lichtere partijen. Dus in theorie als u werkt in een beeld met donkere tonen (zg, low key) zou u een werkruimte met een hoger gamma willen hebben. En als u werkt in een licht beeld(high key) bijvoorbeeld opnamen gemaakt in het volle zonlicht met een witte trouwjurk en sneeuw als achtergrond dan kiest u voor een werkruimte met een lager gamma. Daardoor beschikt u over meer toon gradaties in de hoge lichten. Maar in werkelijkheid kiest bijna iedereen werkruimten met een gamma van 1,8 of 2,2.
uk: Одним з практичних висновків з такого означення гами робочого простору є те, що чим вищим буде значення гами, тим більше окремих півтонів буде отримано у тінях, а отже на незатінених ділянках кількість тонів буде меншою. Отже, теоретично, якщо ви працюєте з дуже затіненим (з гамою темних тонів) зображенням, вам знадобиться робочий простір з вищим значенням гами. Якщо ж ви працюєте над зображенням з гамою світлих тонів, наприклад, зображенням весільного плаття, створених у денному сонячному світлі на тлі снігового поля, вам слід вибрати робочий простір з низьким значенням гами, щоб отримати доступ до всіх градацій світлих тонів зображення. Але для типових дій з редагування зображення майже всі використовують робочі простори зі значеннями гами 1,8 або 2,2.

source: Some people are trying to standardize on gamma 2.0. sRGB and LStar-RGB are not gamma-based working spaces. Rather, sRGB uses a hybrid gamma, and LStar-RGB uses a luminosity-based tonal response curve instead of a gamma value - see here for more information, and then google around for more in-depth information.
nl: Sommige mensen proberen een gamma van 2.0 als standaard te gebruiken. sRGb en LStar-RGB zijn geen op gamma gebaseerde werkruimten. Eigenlijk gebruikt sRGB hybrid gamma en LStar-RGB gebruikt een op helderheid gebaseerde toonresponskromme in plaats van een gammawaarde- zie hier voor meer informatie en google dan een beetje rond voor meer diepgaande informatie.
uk: Дехто намагається використовувати стандартне значення гами: 20 sRGB і LStar-RGB не є робочими просторами, заснованими на використанні гами Замість неї у sRGB використовується гібридна гама, а у LStar-RGB — заснована на освітленості крива тональної реакції. Докладніше про це можна дізнатися тут. Ще докладніші відомості можна знайти за допомогою google.

source: In addition to gamma 1.8 and gamma 2.2 the only other gamma for a working space that gets much mention or use is gamma 1.0, also called linear gamma. Linear gamma is used in HDR (high dynamic range) imaging and also if one wants to avoid introducing gamma-induced errors into one's regular low dynamic range editing. Gamma-induced errors is a topic outside the scope of this tutorial, but see Gamma errors in picture scaling, for gamma-induced color shifts.
nl: Naast het gamma 1,8 en gamma 2,2 is de enige andere gamma voor een werkruimte die veel vermeldt of gebruikt wordt gamma 1,0, ook wel lineair gamma genoemd. Lineair gamma wordt gebruikt in HDR (High Dynamic Range) beelden en als men fouten wil vermijden die door gamma worden veroorzaakt in de gewone low dynamic range bewerkingen. Door gamma veroorzaakte fouten, is een onderwerp dat te ver gaat voor deze zelfstudie. Maar kijk eens op Gamma errors in picture scaling, voor door gamma veroorzaakte kleurverschuivingen.
uk: Окрім значень гами рівних 1,8 і 2,2 єдиним іншим значенням гами для робочого простору, яке заслуговує на згадку і широко використовується, є значення лінійної гами або гама=1,0. Лінійна гама використовується під час створення зображень HDR (з високим динамічним діапазоном), а також у разі, коли бажано уникати помилок, пов’язаних з гамою, під час редагування звичайних зображень з низьким динамічним діапазоном. Тема «помилок, пов’язаних з гамою» виходить за межі цього посібника. Але ви можете ознайомитися з розділом «Помилки, пов’язані з гамою» при масштабуванні зображень, щоб дізнатися про пов’язані з гамою зсуви тональності.

source: Unfortunately and despite their undeniable mathematical advantages, linear gamma working spaces have so few tones in the shadows that (in my opinion) they are impossible to use for editing if one is working in 8-bits, and still problematic at 16-bits. When the day comes when we are all doing our editing on 32-bit files produced by our HDR cameras on our personal supercomputers, I predict that we will all be using working spaces with gamma 1; Adobe Lightroom is already using a linear gamma working space "under the hood" and Lightzone has always used a linear gamma working space.
nl: Helaas en ondanks de onweerlegbare wiskundige voordelen hebben lineaire gamma werkruimten zo weinig tonen in de donkere partijen dat ze onmogelijk gebruikt kunnen worden voor bewerking in 8-bits bestanden, en zelfs in 16-bits bestanden is het problematisch. Wanneer de dag komt dat we allemaal onze bewerking doen op 32-bits bestanden geproduceerd door onze HDR camera's op onze persoonlijke supercomputers, voorspel ik dat we allemaal werkruimten zullen gebruiken met gamma 1. Adobe Lightroom gebruikt al een lineaire gamma werkruimte en LightZone heeft altijd gebruik gemaakt van een lineaire gamma werkruimte.
uk: На жаль і усупереч незаперечним математичним перевагам, робочі простори з лінійними гамами містять так мало тонів у тінях, що (на думку автора цього підручника) ними неможливо користуватися для редагування, якщо ви працюєте з 8-бітовими кольорами, і проблематично користуватися за 16-бітових кольорів. Коли настане день, коли ми зможемо редагувати наші 32-бітові зображення, створені за допомогою фотоапаратів з високим динамічним діапазоном на наших персональних суперкомп’ютерах, можна бути певним, ми користуватимемося робочими просторами з гама=1. Adobe Lightroom вже перейшов на неявне використання робочого простору з лінійною гамою, а програма Lightzone завжди використовувала робочий простір з лінійною гамою.

source: Which working space: large gamut or small gamut
nl: Welke werkruimte: grote gamut of kleine gamut
uk: Який робочий простір вибрати: велику палітру чи малу палітру?

source: One major consideration in choosing a working space is that some working spaces are bigger than others, meaning they cover more of the visible spectrum (and perhaps even include some imaginary colors - mathematical constructs that don't really exist). These bigger spaces offer the advantage of allowing you to keep all the colors captured by your camera and preserved by the lcms conversion from your camera profile to the really big profile connection space.
nl: Een belangrijke factor bij het kiezen van een werkruimte is dat sommige werkruimten groter dan anderen zijn, waardoor ze meer van het zichtbare spectrum beslaan. (en misschien zelfs ook enkele denkbeeldige kleuren - wiskundige constructies die niet echt bestaan). Deze grotere ruimtes bieden het voordeel van het toestaan ​​van het behouden van alle kleuren die uw camera heeft vastgelegd en bewaard door de lcms conversie van uw camera-profiel naar de echt grote profiel verbindende kleurruimte.
uk: Однією з ОСНОВНИХ проблем вибору робочого простору є те, що деякі робочі простори є ширшими за інші. Це означає, що вони покривають більшу частину видимого спектра (і, можливо, навіть містять уявні кольори — математичні конструкти, який насправді не існує). Перевагою використання таких ширших просторів є те, що у них можна отримати всі кольори отримані з фотоапарата і зберегти їх під час перетворення lcms з профілю вашого фотоапарата до величезного простору з’єднання профілів.

source: But keeping all the possible colors comes at a price. It seems that any given digital image (pictures of daffodils with saturated yellows being one common exception) likely only contains a small subset of all the possible visible colors that your camera is capable of capturing. This small subset is easily contained in one of the smaller working spaces. Using a very large working space mean that editing your image (applying curves, saturation, etc.) can easily produce colors that your eventual output device (printer, monitor) simply cannot display. So the conversion from your working space to your output device space (say your printer) will have to remap the out of gamut colors in your edited image, some of which might even be totally imaginary, to your printer color space with its much smaller gamut, leading to inaccurate colors at best and at worst to banding (posterization - gaps in what should be a smooth color transition, say, across an expanse of blue sky) and clipping (your carefully crafted muted transitions across delicate shades of red, for example, might get remapped to a solid block of dull red after conversion to your printer's color space).
nl: Maar zoals u zult zien is het behoud van alle mogelijke kleuren niet zonder consequenties. En het lijkt er op dat elk digitaal beeld een kleine reeks bevat van alle mogelijke zichtbare kleuren die uw camera kan vastleggen. (een uitzondering die een groter kleurengamma vereist zou een opname zijn van een hoog verzadigd onderwerp zoals een gele narcis). Deze kleine reeks past gemakkelijk in een van de kleinere werkruimten. Gebruik maken van een heel grote werkruimte betekent dat het bewerken van uw afbeelding gemakkelijk kleuren kan voortbrengen die uw uiteindelijke uitvoerapparaat, bv, printer, niet kan weergeven. Dus de conversie van uw werkruimte naar de werkruimte van uw uitvoerapparaat (bijv. printer) zal de kleuren die buiten het kleurengamma vallen opnieuw moeten indelen voor de werkruimte van uw printer die een stuk kleiner is. Omdat sommige kleuren die daardoor ontstaan geheel denkbeeldige kleuren zijn kan het gevolg zijn dat kleuren niet juist worden weergegeven of dat posterkleuren ontstaan of dat er banding of afknijpen op treed. Zo kan het gebeuren dat de zorgvuldig door u bewerkte kleuren uit de printer komen als massieve blokken rood of een andere kleur in plaats van dat er een geleidelijke overgang in de kleuren zichtbaar is.
uk: Але збереження всіх можливих кольорів має свою ціну. Ймовірно, довільне цифрове зображення (винятками є зображення нарцисів з насиченими жовтими кольорами) містить лише невелику підмножину всіх можливих видимих кольорів, які здатен зареєструвати ваш фотоапарат. Ця мала підмножина з легкістю вкладається у один з менших робочих просторів. Використання дуже широких робочих просторів означає, що редагування вашого зображення (застосування кривих, насиченості тощо) може легко призвести до створення точок з кольорами, які просто не зможе показати пристрій призначення (принтер, монітор). Отже під час перетворення з вашого робочого простору у простір пристрою виводу (наприклад, вашого принтера) доведеться відображати кольори зображення, яких немає у палітрі, частина цих кольорів може бути просто уявною, на простір кольорів вашого принтера зі значно меншою палітрою, що у найкращому разі призведе до неточностей у кольорах, а у найгіршому — до утворення смуг (постеризації — розривів у плавних переходах кольорів, наприклад, у кольорах неба) і обрізання (наприклад, ретельно створений вами плавний перехід тонів рожевого може стати суцільною ділянкою тьмяно-червоного кольору після перетворення до простору кольорів принтера).

source: In other words, large gamut working spaces, improperly handled, can lead to lost information on output. Small gamut working spaces can clip information on input. Like Wikipedia says, it's a trade-off. Here is some oft-repeated advice:
nl: Met andere woorden, wanneer grotere werkruimten met een groter gamut onjuist worden behandeld kan dat leiden tot teloorgaan van informatie bij de uitvoer. Kleine gamut werkruimten kunnen informatie al bij de invoer aftoppen. Zoals in wikipedia beschreven is het allemaal een kwestie van afwegen. Hier is een vaak gegeven advies:
uk: Іншими словами, робочі простори з ширшою палітрою, за неправильної обробки, можуть призвести до втрати даних на виході. Робочі ж простори з вузькою палітрою можуть обрізати дані на вході. Як сказано у Вікіпедії, це компроміс. Ось декілька загальних порад:

source: For images intended for the web, use (one of the) sRGB (variants - there are several).
nl: Voor afbeeldingen bedoeld voor het web gebruikt u (een van de) sRGB (varianten - er zijn er verscheidene).
uk: Для зображень, призначених для інтернету, використовуйте один з різновидів (їх декілька) простору sRGB.

source: For the most accuracy in your image editing (that is, making the most of your "bits" with the least risk of banding or clipping when you convert your image from your working space to an output space), use the smallest working space that includes all the colors in the scene that you photographed, plus a little extra room for those new colors you intentionally produce as you edit.
nl: Gebruik voor de hoogste nauwkeurigheid bij het bewerken van uw afbeeldingen de kleinste werkruimte die alle kleuren bevat die u vast legde, plus een beetje extra ruimte voor de kleuren die u bewust produceerde tijdens de bewerkingen. Dit betekent, het meeste uit uw bitjes halen met het laagste risico op banden of afknijpen.
uk: Щоб збільшити точність вашого редагування зображень (тобто найкраще скористатися обмеженою кількістю бітів без утворення смуг і обрізання під час перетворення вашого зображення у простір кольорів виводу), використовуйте найменший робочий простір, який містить всі кольори об’єкта, який ви фотографували плюс невеличкий додатковий простір для тих кольорів, які ви створите під час редагування.

source: If you are working in 8-bits rather than 16-bits, choose a smaller space rather than a larger space.
nl: Als u werkt in 8-bits i.p.v. 16-bits, kiest u een kleinere ruimte in plaats van een grotere.
uk: Якщо ви працюєте з 8-бітовими кольорами, а не з 16-бітовими, оберіть вужчий робочий простір.

source: For archival purposes, convert your raw file to a 16-bit tiff with a large gamut working space to avoid loosing color information. Then convert this archival tiff to your working space of choice (saving the converted working tiff under a new name, of course). See here for more details.
nl: Converteer voor archivering van uw afbeeldingen, deze naar een 16-bits tiff met een werkruimte met een groot kleurengamma, om verlies van kleurinformatie te voorkomen. Daarna kunt u de gearchiveerde tiff (natuurlijk met een nieuwe naam) naar de werkruimte van uw keuze converteren. Zie hier voor meer details.
uk: Якщо метою є додавання зображень до архіву, перетворіть ваш файл цифрового негатива на 16-бітовий tiff у робочому просторі з широкою палітрою, щоб уникнути втрати даних щодо кольору Потім перетворіть цей архівний tiff у вибраний вами робочий простір (перетворений робочий tiff, звичайно ж, слід зберегти з іншою назвою) Докладніше про це можна дізнатися за цією адресою.

source: The whys of these bits of advice regarding which working space are beyond the scope of this tutorial. See Bruce Lindbloom's excellent website (Info, Information about RGB Working Spaces) for a visual comparison of the gamut (array of included colors) of the various working color spaces. See here and here for a pro and con presentation, respectively, of the merits of using large gamut working spaces. And while you are on the cambridgeincolour.com website, check out the tutorial on color management.
nl: Het waarom van deze eenvoudige adviezen over werkruimte gaat te ver voor het doel van deze zelfstudie Zie ook: Bruce Lindbloom's uitstekende website (Info, informatie over RGB Werkruimten) voor een visuele vergelijking van de gamma (rangschikking van de bijbehorende kleuren) van diverse kleurwerkruimten Zie hier en hier voor een presentatie over voors en tegens van de merites van het gebruik van grote gammawerkruimten En als u op de website cambridgeincolour.com bent, bekijk dan de zelfstudie over kleurmanagement.
uk: Пояснення щодо цих порад, пов’язаних з вибором робочого простору не є предметом цього посібника Див чудовий вебсайт Брюса Ліндблума (Bruce Lindbloom) (Відомості щодо робочих просторів RGB), там ви знайдете візуальне порівняння палітри (масиву включених кольорів) для різноманітних просторів кольорів. Тут і тут ви знайдете відомості присвячені перевагам та недоліками використання робочих просторів з широкою палітрою Не полишаючи сайта cambrideincolour.com, ознайомтеся з посібником щодо керування кольорів.

source: Soft Proofing
uk: Проба кольорів

source: Soft Proofing is a way of previewing on the screen (monitor) the result to be expected from an output on another device, typically a printer. Soft proofing will show you the difference to be expected before you actually do it (and waste your costly ink). So you can improve your settings without wasting time and money.
nl: Soft-proofing is een manier om op het scherm (monitor) het te verwachten resultaat van uitvoer op een ander apparaat vooraf te bekijken, typisch een printer. Soft-proofing toont u het te verwachten verschil voordat u het echt doet (en uw kostbare inkt verspilt). Zo kunt u uw instellingen verbeteren zonder tijd en geld te verspillen.
uk: Проба кольорів є способом попереднього перегляду на екрані (моніторі) результатів, яких слід очікувати від виводу на інший пристрій, типово, принтер. Проба кольорів продемонструє вам відмінності, яких слід очікувати, до створення остаточного відбитка (без витрати дорогого чорнила). Таким чином, ви зможете покращити параметри відтворення без зайвих витрат часу та грошей.

source: Rendering intention
nl: Rendering-intentie
uk: Пристрій відтворення

source: Rendering intent refers to the way gamuts are handled when the intended target color space cannot handle the full gamut.
nl: Rendering-intentie refereert aan de manier waarop gamuts worden behandeld wanneer de kleurruimte van het doel niet de volledige gamut aankan.
uk: Відтворення кольорів — це спосіб обробки палітри у разі, якщо простір кольорів призначення не може вмістити всю поточну палітру кольорів.
