Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/image_editor/color_management.po
Languages: nl, uk

source: "Rendering intent" refers to the way color gamuts are handled when the intended target color space (for example, the monitor or the printer) cannot handle the full gamut of the source color space (for example the working space).
nl: Weergave intentie (rendering intent) slaat op de wijze waarop kleurengamma's worden bewerkt wanneer de doelkleurruimte (bijv. die van de printer) het gehele gamma van de bronkleurruimte niet kan omvatten.
uk: «Відтворення кольорів» означає спосіб обробки палітр кольорів у разі, коли простір кольорів призначення (наприклад, простір кольорів монітора або принтера) не може вмістити повністю палітру простору кольорів джерела (наприклад, робочого простору).

source: Perceptual and relative colorimetric rendering are probably the most useful conversion types for digital photography. Each places a different priority on how they render colors within the gamut mismatch region.
nl: Perceptuele en colorimetrische weergave-intentie zijn waarschijnlijk de meest nuttige conversietypen voor digitale fotografie. Elk van de methoden hanteert een andere prioriteit voor hoe zij kleuren weergeven in het niet aansluitende gamma-gebied.
uk: Відчуттєве (або придатне для сприйняття, перцептуальне) та відносне колориметричне, ймовірно, є найкориснішими типами перетворення у цифровій фотографії. Кожне з них використовує різні пріоритети щодо представлення кольорів у області розбіжності палітри.

source: Relative colorimetric maintains a near exact relationship between in gamut colors, even if this clips out of gamut colors.
nl: Relatieve colorimetrische benadering onderhoudt een bijna exacte verhouding tussen gamma-kleuren, zelfs als die buiten de kleuren van het gamma reikt.
uk: Відносне колориметричне майже точно зберігає співвідношення між кольорами з палітри, навіть якщо це призводить до обрізання кольорів палітри.

source: In contrast, perceptual rendering tries to also preserve some relationship between out of gamut colors, even if this results in inaccuracies for in gamut colors...
nl: Perceptuele weergave tracht ook een relatie met buiten het gamma vallende kleuren in stand te houden, zelfs als dit uitmondt in onvolkomenheden voor kleuren binnen het gamma.
uk: На відміну від нього, придатне для сприйняття (перцептуальне) відтворення намагається зберегти певний зв’язок між кольорами поза палітрою, навіть якщо це спричиняє неточності у кольорах, що містяться у палітрі...

source: Absolute is similar to relative colorimetric in that it preserves in gamut colors and clips those out of gamut, but they differ in how each handles the white point... Relative colorimetric skews the colors within gamut so that the white point of one space aligns with that of the other, while absolute colorimetric preserves colors exactly (without regard to changing white point)...
nl: De absolute aanpak is vergelijkbaar met de relatieve colorimetrische benadering doordat het binnen het gamma vallende kleuren behoudt en de buiten het gamma vallende kleuren afknijpt. Maar ze verschillen in de manier waarop ze het witpunt hanteren. De relatieve colorimetrische methode verschuift de kleuren binnen het gamma zodat het witpunt van de ene kleurruimte overeenkomt met dat van de andere ruimte, terwijl absolute colorimetrische methode de kleuren nauwkeurig behoudt (zonder het witpunt te wijzigen)...
uk: Абсолютне колориметричне відтворення подібне до відносного у тому, що зберігає кольори з палітри призначення і обрізає кольори поза нею, але між ними є різниця, яка полягає у різній обробці точки білого.. За використання відносного колориметричного відтворення кольори у палітрі зсуваються так, щоб точки білого двох просторів кольорів збігалися, а за використання абсолютного колориметричного відтворення кольори зберігаються точно (безвідносно до зміни розташування точки білого)...

source: Saturation rendering intent tries to preserve saturated colors.
nl: Verzadiging weergave-intentie tracht verzadigde kleuren te behouden.
uk: За використання відтворення насиченості кольорів буде зроблено спробу зберегти насичені кольори.

source: I would quote the entire article (it's that good), but that would involve "unfair usage" I am sure. So go check out the article for yourself. The illustrations in the article really help to clarify what the different rendering intents actually do and the compromises involved in choosing one rendering intent over another.
nl: Ik zou graag het hele artikel weergeven maar dat zou unfair gebruik zijn. Lees daarom het artikel zelf op de site. De illustraties in dat artikel helpen beslist om duidelijk te maken wat de verschillende weergave-intenties eigenlijk doen en de compromissen die gemaakt worden bij het bepalen van de voorkeur voor de ene of de ander benadering.
uk: З задоволенням зацитував би усю статтю (вона чудова), але, певно, було б «нечесним використанням». Отже, зверніться до вказаної статті, щоб ознайомитися з її вмістом. Ілюстрації до статті допоможуть вам зрозуміти, яким чином працюють різні відтворення кольорів і які компроміси пов’язано з вибором кожного зі способів відтворення кольорів.

source: What rendering intent should I use for displaying images on my monitor?
nl: Wat voor weergave-intentie moet ik gebruiken voor weergave op mijn beeldscherm?
uk: Яке відтворення кольорів мені слід вибрати для перегляду зображень на моніторі мого комп’ютера?

source: What is soft-proofing?
nl: Wat is soft-proofing?
uk: Що таке проба кольорів?

source: I've always heard that you ought to use "perceptual intent" when transforming an image from a larger working space to a smaller printer space. But especially in light of reading the aforementioned Cambridge in Color article, it seems that perceptual intent may or may not give the best results, depending on the respective gamuts of the image and printer/paper combination in question. I've been experimenting quite a bit lately with output intents for printing. I find that for my images, the colorimetric intents give clearer, brighter colors, albeit at the cost of having to carefully re-edit the image to avoid clipping highlights and shadows. Perusal of the various photography forums and articles available on the Internet indicates that "perceptual intent" is just an option, not by any means always "the best" option.
nl: Ik heb altijd gehoord dat men perceptuele weergave-intentie moet gebruiken bij de conversie van een grotere naar een kleinere kleurwerkruimte van de printer. Maar gezien in het licht van dat artikel in Cambridge in color schijnt het zo te zijn dat perceptuele intentie wel of niet de beste resultaten op kan leveren. Het hangt af van de verschillende gamma's van de printer/papier combinatie in kwestie. Ik heb nogal wat geëxperimenteerd met intenties voor printen en ontdekte dat voor mijn beelden de colorimetrische intenties duidelijker en meer heldere afdrukken opleveren. Echter niet zonder dat het beeld eerst aandachtig wordt bewerkt om te voorkomen dat heldere delen en schaduwen afgeknepen worden. In artikelen op diverse fotoforums valt te lezen dat perceptuele intenties een optie is maar beslist niet altijd de beste.
uk: Авторові завжди казали, що для перетворення зображення з ширшого робочого простору у вужчий простір кольорів принтера слід використовувати відчуттєве відтворення кольорів. Але, особливо у світлі читання вищезгаданої статті з Cambridge in Color, видається, що отримання найкращих результатів за допомогою відчуттєвого відтворення кольорів є спірним питанням: все залежить від відносних палітр зображення та комбінації принтер/папір у окремо взятому випадку. Пізніше автор провів досліди з відтворенням кольорів для друку. Було виявлено, що для зображень автора колориметричні відтворення надають змогу отримати ясніші, яскравіші кольори, хоча і ціною потреби у ретельному повторному редагуванні зображень з метою уникнення обрізання кольорів на світлих ділянках та у тіні. Вивчення у інтернеті різноманітних форумів та статей, присвячених фотографії, призводить до висновку, що відчуттєве відтворення є лише одним з варіантів, але не обов’язково найкращим варіантом.

source: And what about black point compensation?
nl: En hoe zit het met zwartpunt-compensatie?
uk: Якщо щодо компенсації точки чорного?

source: The article from which this definition comes offers a very clear explanation (albeit Adobe-centric) of how black point compensation works and the practical consequences of using or not using it. The bottom line advice is, it depends. Try soft-proofing with black point compensation on. If you like it, use it. Otherwise, don't use it.
nl: Het artikel waaruit deze definitie komt biedt een heldere uitleg (gebaseerd op Adobe) over hoe zwartpunt-compensatie werkt en de praktische consequenties van het niet gebruiken van zwartpunt-compensatie. Het uiteindelijke advies is: probeer soft-proofing met zwartpunt-compensatie. Als het u bevalt gebruik het dan en anders niet.
uk: У статті, звідки взято це визначення, запропоновано дуже чітке пояснення (хоча і з точки зору продуктів Adobe) механізмів роботи компенсації точки чорного та наведено практичні висновки щодо використання або невикористання цих механізмів. Основним висновком щодо використання є: дійте за обставинами. Спробуйте створити пробу кольорів з компенсацією чорної точки. Якщо сподобається, використовуйте. Якщо ні, не використовуйте.

source: Can all of the rendering intents be used when converting from one color space to another?
nl: Kunnen alle weergave-intenties worden gebruikt bij de conversie van een kleurruimte naar een andere?
uk: Чи можна використовувати схеми відтворення кольорів під час зміни простору кольорів?

source: In a word, no. Which rendering intents are available when converting from one profile to another depends on the destination profile. Not every profile supports every rendering intent. What happens when you select an unsupported rendering intent is that LCMS quietly uses the profile's default rendering intent.
nl: In één woord, nee, elke weergave-intentie is beschikbaar bij de conversie van het ene profiel naar het andere. Niet ieder profiel ondersteunt iedere weergave-intentie. Wat er gebeurt als u een weergave-intentie gebruikt die niet wordt ondersteund, is dat LCMS stilletjes de standaard weergave-intentie van het profiel toepast.
uk: Якщо одним словом, то ні. Перелік відтворень кольорів, доступних під час перетворення з одного профілю у інший, залежить від профілю призначення. Не кожен з профілів підтримує всі відтворення кольорів. Якщо ви оберете відтворення кольорів, яке не підтримується, LCMS без надсилання додаткових запитів використає типове відтворення кольорів профілю.

source: Why does the perceptual rendering intent get recommended so often as the "photographic" rendering intent?
nl: Waarom wordt perceptuele weergave-intentie zo vaak aanbevolen als de fotografische weergave-intentie?
uk: Чому придатне для сприйняття (перцептуальне) відтворення кольорів так часто рекомендують як «фотографічне» відтворення кольорів?

source: It's a safe choice because it prevents clipping of shadows and highlights, although possibly at the expense of desaturating all your colors. So if you don't want to bother doing any soft-proofing, choose the perceptual rendering intent (if you don't want to soft-proof, probably you should also stick with sRGB).
nl: Het is een veilige keuze want het voorkomt afknijpen van heldere delen en schaduwen, evenwel met de mogelijkheid van het verminderen van verzadiging van al uw kleuren. Dus als u de last van soft-proofing wilt vermijden, kies dan perceptuele weergave-intentie. Als u geen soft-proof wilt dan kunt u eigenlijk beter in sRGB blijven werken.
uk: Вибір цього відтворення є безпечним, оскільки запобігає обрізанню тіней і відсвітів, хоча, можливо, за рахунок зменшення насиченості кольорів зображення. Отже, якщо ви не бажаєте перейматися додатковими пробами кольорів, оберіть відтворення кольорів придатне для сприйняття (якщо ви не бажаєте додаткових виправлень, ймовірно, вам слід також вибрати sRGB).

source: One practical consequence of the gamma of a working space is that the higher the gamma, the more discrete tones are available for editing in the shadows, with consequently fewer tones available in the highlights. Changing the gamma of an image redistributes the number of tones available in the lighter and darker areas of an image. Theoretically, if you are working on a very dark-toned (low key) image you might want a working space with a higher gamma. And if you are working on a high key image, say a picture taken in full noon sunlight of a wedding dress with snow as a backdrop, you might want to choose a working space with a lower gamma, so you have more available tonal gradations in the highlights.
nl: Een praktisch gevolg van het gamma van de werkruimte is, dat hoe hoger het gamma, hoe meer afzonderlijke kleurtonen in de schaduwen beschikbaar zijn om te bewerken en dus hoe minder tonen in de heldere delen. Veranderen van het gamma van een beeld verdeelt opnieuw het aantal tonen beschikbaar in lichte en in de donkerder gebieden van de afbeelding. In theorie, zou u bij het bewerken van een erg donkere opname (low key) een ruimte met een hoger gamma willen hebben. En als u een erg lichte opname bewerkt bijvoorbeeld een opname van een trouwjurk met sneeuw als achtergrond in helder zonlicht zou u een werkruimte willen met een lager gamma zodat u meer toongradaties beschikbaar heeft in de heldere delen.
