Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/image_editor/color_management.po
Languages: nl, uk

source: First, sRGB is both a working color space and an output color space for images intended for the web and for monitor display (if you have a spiffy new monitor with a gamut larger than the gamut covered by sRGB, obviously you might want to reconsider what output profile to use to best take advantage of your wonderful and hopefully calibrated and profiled monitor, but please convert your image to sRGB before sending it on to your friends!). sRGB is also the color space that a lot of home and mass-production commercial printers expect image files to be in when sent to the printer. It is also the color space that most programs assume if an image does not have an embedded color profile telling the program what color space should be used to interpret (translate) the RGB numbers. So if you choose to not use color-management, your color-management choices are simple - set everything to sRGB.
nl: Ten eerste, sRGB is zowel een kleurwerkruimte alsook een uitvoerkleurruimte voor beelden bestemd voor het Internet en het beeldscherm. Als u een moderne monitor bezit met een gamut groter dan dat wat door sRGB wordt bestreken dan kunt u overwegen om het uitvoerprofiel te gebruiken waarmee u ten volle gebruik kunt maken van de voordelen van die nieuwe en hopelijk gekalibreerde monitor. Maar zorg er alstublieft voor dat uw beelden naar sRGB worden omgezet voor u ze naar uw vrienden stuurt. sRGB is ook de kleurruimte van beeldbestanden die veel thuisprinters en massa-productie commerciële afdrukcentrales verwachten wanneer u beelden verzendt. Het is ook de kleurruimte die de meeste programma's verwachten wanneer beelden zonder ingesloten kleurprofiel worden geopend. Dus als je ervoor kiest om kleurbeheer niet gebruiken, dan zijn uw keuzes voor kleurbeheer simpel, stel alles in op sRGB.
uk: По-перше, sRGB є як робочим простором, так і вихідним простором кольорів для зображень, призначених для показу у інтернеті та на моніторі (якщо ви є власником або власницею першокласного нового монітора з палітрою, ширшою за палітру, яку покриває sRGB, очевидно, у вас можуть бути інші думки щодо використання профілю вихідних даних: за використання іншого профілю ви зможете повністю скористатися перевагами вашого чудового і, сподіваємося, відкаліброваного та профільованого монітора, але, будь ласка, перетворіть ваші зображення у простір sRGB, перш ніж надсилати їх друзям!). Крім того, sRGB є типовим простором кольорів зображень, що надходять ззовні, для значної кількості домашніх та поширених комерційних принтерів. Цей профіль кольорів також є типовим простором у програмах для зображень без вбудованих профілів кольорів, які повідомляють програмі про те, який простір кольорів слід використовувати для розшифрування (перетворення) чисел RGB. Отже, якщо ви вважаєте, що користуватися керуванням кольорами не слід, ваш вибір у керуванні кольорами є простим: вкажіть всюди sRGB.

source: Second, all jpegs (or tiffs, if you have an older Minolta Dimage camera) coming straight out of a camera (even if produced by point-and-shoots cameras that don't allow you to save a raw file) start life inside the camera as a raw file produced by the camera's A to D converter. The processor inside the camera interpolates the raw file, assigns a camera profile, translates the resulting RGB numbers to a working space (usually sRGB but sometimes you can choose AdobeRGB, depending on the camera), does the jpeg compression, and stores the jpeg file on your camera card. So jpegs (or tiffs) from your camera NEVER need to be assigned a camera or input profile which is then translated to a working space via a PCS. Jpegs from a camera are already in a working space.
nl: Ten tweede, alle jpeg afbeeldingen vinden hun oorsprong in de camera in de vorm van een raw bestand aangemaakt door A(naloog) naar D(igitaal) omzetter. Dat geldt ook voor eenvoudige compactcamera's die geen raw-bestanden opslaan. De processor in de camera interpoleert het raw-bestand wijst een cameraprofiel toe, vertaalt de RGB-waarden naar een werkruimte, (gewoonlijk RGB maar soms kunt u kiezen uit sRGB of Adobe RGB afhankelijk van de camera) voert de jpeg-compressie uit en slaat het bestand op op de geheugenkaart van uw camera. Zodoende hoeft er voor jpeg's(of tiff's) van uw camera NOOIT een camera- of invoerprofiel worden toegewezen, want jpeg's van een camera zitten al in een werkruimte.
uk: По-друге, всі файли jpeg (або tiff, якщо ви користуєтеся застарілим фотоапаратом Minolta Dimage), отримані безпосередньо за допомогою фотоапарата (навіть створені фотоапаратами типу «навів і клацнув», які не дозволяють зберігати зображення цифрових негативів), починають своє життя у фотоапараті як файл цифрового негатива, створений аналогово-цифровим перетворювачем фотоапарата. Інструмент обробки у самому фотоапараті наблизить файл цифрового негатива, призначить профіль фотоапарата, перетворить отримані числа RGB у робочий простір (зазвичай, sRGB, але іноді ви можете вибрати AdobeRGB, все залежить від фотоапарата), виконає стискання jpeg і збереже файл jpeg на картці фотоапарата. Отже, для файлів jpeg (або tiff) з вашого фотоапарата НЕ потрібно призначати профіль фотоапарата, який потім буде перетворено у робочий простір за посередництва PCS. Кольори файлів jpeg з фотоапарата вже перебувають у робочому просторі.

source: Third, in case anyone is unsure on this point, note that an interpolated raw file is no longer a raw file - it has been interpolated and then output as a tiff whose RGB values need to be translated to a working space, using the camera profile, the PCS, and lcms. Fourth (strictly for future reference), to introduce a bit of commonly heard color-management terminology here - the camera profile and your printer's color profile are both device dependent, whereas the working space will be device-independent - it can be used with any image, with any properly color-managed software, without regard for where the image originated.
nl: Ten derde, mocht iemand nog onzeker zijn op dit punt onthoud dan dat een geïnterpoleerd raw-bestand niet langer een raw-bestand is. Het is geïnterpoleerd en vervolgens uitgevoerd als tiff-bestand waarvan de RGBwaarden nog moeten worden vertaald naar een werkruimte met gebruikmaking van het cameraprofiel, de PCS (profielverbindende ruimte) en de lcms. Ten vierde (alleen voor toekomstige referentie), om hier maar eens een beetje algemeen gehanteerde kleurbeheerbenamingen te introduceren - het cameraprofiel en het kleurprofiel van uw printer zijn beiden afhankelijk van respectievelijk de camera en de printer. Terwijl de werkruimte onafhankelijk van de apparatuur is. Het kan voor elke beeld gebruikt worden, met elke kleurbeheersoftware, los van waar het beeld ontstond.
uk: По-третє, якщо у вас ще є якісь сумніви, зауважте, що наближений файл цифрового негатива вже не є файлом цифрового негатива: його було наближено, а потім виведено як tiff, чиї значення RGB слід перетворити у робочий простір за допомогою профілю фотоапарата, PCS і lcms. По-четверте (це зауваження наведено з міркувань послідовності викладу), використовуючи трохи поширеної у керуванні кольорами термінології, профіль фотоапарата і профіль вашого принтера є залежними від пристрою, а робочий простір буде незалежним від пристрою: його можна використовувати для будь-якого зображення, з будь-яким програмним забезпеченням з належним керуванням кольорами, байдуже, яким є походження зображення.

source: Fifth, above I have used the words translate and translation as a descriptive metaphor for what lcms does when it translates RGB values from one color space to another via the PCS. The usual and correct terminology is convert and conversion, which I will use below. The four methods of conversion from one color space to another are: perceptual, relative colorimetric, absolute colorimetric, and saturation. Which method of conversion you should use for any given image processing step from raw file to final output image is beyond the scope of this tutorial. The standard advice is: when in doubt, use perceptual.
nl: Ten vijfde, hiervoor heb ik de uitdrukkingen: vertalen en vertaling gebruikt als beschrijving van wat lcms doet wanneer het RGB-waarden, via de profielverbindenderuimte vertaalt van een kleurruimte naar een andere kleurruimte. De gebruikelijke en juiste termen zijn converteren en conversie die ik hierna zal gebruiken. De vier methoden voor conversie van een kleurruimte naar een andere zijn perceptueel, relatief colorometrisch, absoluut colorometrisch en verzadigd. Welke methode u zou moeten hanteren voor een gegeven beeldberwerkingsstap van raw-bestand tot uiteindelijke uitvoer valt buiten het bereik van deze zelfstudie. De vuistregel is: als je het niet weet, kies dan perceptueel als uitvoer.
uk: По-п’яте, вище було використано слова «перетворити» і «перетворення» як описову метафору дій, які lcms виконує під час переобчислення значень RGB з одного простору кольорів у інший за посередництва PCS. Існує чотири способи перетворення з одного простору кольорів до іншого: відчуттєвий (перцептуальний), відносний колориметричний, абсолютний колориметричний і за насиченістю. Питання вибору перетворення, яке слід використовувати для кожного з кроків обробки зображень, починаючи з файла цифрового негатива і завершуючи остаточним зображенням, не є предметом цього посібника. Стандартною порадою є: якщо не знаєте, яким способом скористатися, використовуйте відчуттєвий (перцептуальний).

source: Sixth (and again, strictly for future reference), assign a profile means change the meaning of the RGB numbers in an image by embedding a new profile without changing the actual RGB numbers associated with each pixel in the image; convert means embed a new profile, but also change the RGB numbers at the same time so that the meaning of the RGB values - that is, the real-world visible color represented by the trio of RGB numbers associated with each pixel in an image - remains the same before and after the conversion from one space to another. You should be able to do multiple conversions of an image from one working space to another, and with a properly color-managed image editor, even though all the RGB numbers in the image will change with each conversion, the image on your screen should look the same (leaving aside the usually unnoticeable small but inevitable changes from accumulated gamut mismatches and mathematical rounding errors). However, every time you assign a new working space profile rather than convert to a new working space, the appearance of the image should more or less drastically change (usually for the worse).
nl: Ten zesde (en dit is echt alleen voor toekomstige referenties), een profiel toewijzen betekent het wijzigen van de RGB waarden van een beeld door het inbrengen van een nieuw profiel zonder de eigenlijke RGBwaarden te wijzigen die bij iedere pixel van het beeld horen. Converteren betekent breng een nieuw profiel in maar wijzig ook de RGBwaarden op het zelfde moment zodat de betekenis van de RGBwaarden, zeg maar de werkelijke zichtbare kleuren, het zelfde blijven voor en na de conversie van een ruimte naar een andere ruimte. Met een goed kleurbeeldbewerkingsprogramma moet u meerdere conversies van een afbeelding kunnen uitvoeren bij het converteren van de ene werkruimte naar de andere, hoewel alle de RGB-nummers in de afbeelding veranderen met elke conversie, moet het beeld op het scherm er hetzelfde uitzien (afgezien van de meestal onmerkbaar kleine, maar onvermijdelijke veranderingen van geaccumuleerde gamma mismatches en wiskundige afrondingsfouten). Echter, elke keer dat u een nieuwe werkruimteprofiel toewijst in plaats van te converteren naar een nieuwe werkruimte, zal het uiterlijk van de afbeelding drastisch veranderen (meestal wordt het slechter).
uk: По-шосте (і знову ж таки з метою послідовності викладу), призначення профілю означає зміну значення трійок чисел RGB на зображенні вбудовуванням нового профілю без зміни самих значень RGB, пов’язаних з кожним пікселем зображення; перетворення означає вбудовування нового профілю, але вже зі зміною чисел RGB відповідно до значень RGB — тобто видимих кольорів, яким відповідають трійки чисел RGB, пов’язані з кожним з пікселів зображення, — так, щоб вони були однаковими до і після перетворення з одного простору у інший. Ви можете виконати декілька перетворень зображення з одного робочого простору у інший і, якщо редактор зображень належним чином керує кольорами, навіть якщо всі числа RGB у результаті перетворень зазнали змін, зображення на екрані не повинно змінитися (якщо не враховувати зазвичай непомітні, але обов’язкові зміни від накопичення розбіжностей у палітрах і помилок під час математичного округлення). Кожного ж разу, коли ви призначаєте новий робочий простір, а не перетворюєте зображення у новий робочий простір, вигляд зображення має більшою чи меншою мірою значно змінитися (зазвичай, погіршитися).

source: Finally, (and this is a crucially important point), color management is NOT only relevant if you shoot raw. Color management affects every stage of the image processing pipeline, whether you start with a raw file that you, yourself interpolate and translate into a tiff, or if you start with a jpeg or tiff produced by your camera.
nl: Tenslotte, (en dit is belangrijk) kleurbeheer is NIET alleen relevant wanneer u in raw schiet. Kleurbeheer beïnvloedt elke fase van het beeldbewerkingsproces. Of u nu begint met een door u gemaakte en geïnterpoleerde raw-opname die geconverteerd werd naar een tiff-bestand of wanneer u begint met een jpeg of tiff aangemaakt door uw camera.
uk: Нарешті (і це дуже важливе зауваження), керування кольорами пов’язане не лише з обробкою цифрових негативів. Керування кольорами виконується на всіх етапах обробки зображення, починали ви з файла цифрового негатива, який ви власноруч наблизили і перетворили на tiff чи з файла jpeg або tiff, створеного за допомогою вашого фотоапарата.

source: Copyrighted and copyleft working spaces
nl: Werkruimten met copyright en copyleft
uk: Захищені патентним законодавством робочі простори та робочі простори з можливістю законного лівого копіювання

source: I will take it as given that ALL the ordinarily encountered working spaces, such as:
nl: Ik beschouw het als een gegeven dat ALLE werkruimten die men tegenkomt, zoals:
uk: Вважається, що це ВСІ поширені робочі простори, зокрема:

source: And quite a few others that could be added to this list are all more or less suitable as working spaces. Which working space you should use depends only and solely on YOU, on YOUR requirements as the editor of YOUR digital images with YOUR eventual output intentions (web, fine art print, etc.).
nl: En nog heel wat anderen die aan de lijst kunnen worden toegevoegd, zijn allen min of meer bruikbare werkruimten. Welke werkruimte u kiest is geheel aan u en aan uw vereisten ten aanzien van de uitvoer van uw digitale opnamen met uw uiteindelijke gebruiksdoelen. (Web, afdrukken voor schone kunsten, etc.).
uk: та декілька інших просторів, які можна було б додати до цього списку, більшою чи меншою мірою придатні як робочі простори Вибір робочого простору, який ви маєте використовувати залежить від ВАШИХ і лише від ВАШИХ вимог як редактора ВАШИХ цифрових зображень, які буде використано з ВАШОЮ метою (поширення у інтернеті, друк тощо).

source: However, as a critical aside, if you are using Adobe (or other copyrighted) working space profiles, these profiles contain copyright information that shows up in your image exif information. Lately I've been perusing the openicc mailing lists. Apparently lcms can be used to produce nonbranded, copyleft working space profiles that are just the same as - actually indistinguishable from - the branded, copyrighted working space profiles. It would be a wonderful addition to digikam if a set of "copyleft" working space profiles, including nonbranded, relabelled versions of ProPhotoRGB, AdobeRGB, and Adobe WidegamutRGB (perhaps in two flavors each: linear gamma and the usual gamma), could be bundled as part of the digiKam package.
nl: Echter, als kritische aantekening, als u Adobe of andere beschermde werkruimteprofielen gebruikt. Deze profielen bevatten copyright informatie die zichtbaar wordt in de EXIF gegevens van uw afbeeldingen. Onlangs heb ik kennis genomen van de openicc mailing lijst. Blijkbaar kan LCMS worden gebruikt om merkloze, copyleft werkruimteprofielen aan te maken die gelijk zijn, in feite niet te onderscheiden van, de gemerkte en van copyright voorziene werkruimteprofielen. Het zou een prachtige aanvulling op digiKam zijn om een set "copyrightloze" werkruimteprofielen, inclusief merkloze, hernoemde versies van ProPhotoRGB, AdobeRGB, en Adobe WidegamutRGB (misschien elk in twee smaken, linear gamma en het gebruikelijke gamma), samen te pakken als onderdeel van het digiKam pakket.
uk: Але, якщо вдатися до критики, у разі використання профілю робочих просторів Adobe або інших захищених авторським правом профілів робочих просторів, дані exif вашого зображення міститимуть відповідну інформацію щодо авторських прав. Нещодавнє вивчення автором списків листування openicc призвело до висновку, що, ймовірно, LCMS можна використовувати для створення не обмежених авторським правом, профілів робочих просторів з ліцензіями copyleft, які є тотожними (насправді, їх майже неможливо відрізнити) до обмежених авторськими правами профілів просторів кольорів. Доповнення з набору профілів робочих просторів "copyleft", зокрема не обмежених авторськими правами, перемаркованих версій ProPhotoRGB, AdobeRGB і Adobe WidegamutRGB було б чудовим додатком до digiKam (можливо, у двох варіантах: лінійна гама і звичайна гама), якщо б їх можна було постачати у складі пакунка &digikam;.

source: Which working space: gamma
nl: Welke werkruimte: gamma
uk: Вибір робочого простору: гама

source: Now, the next question is: which working space should I use? Wikipedia says:
nl: Welnu, de volgende vraag is: welke werkruimte zou ik gebruiken? Wikipedia zegt:
uk: Тепер наступне питання: яким робочим простором слід користуватися? Вікіпедія повідомляє:

source: Working spaces, such as sRGB or Adobe RGB, are color spaces that facilitate good results while editing. For instance, pixels with equal values of RGB should appear neutral. Using a large (gamut) working space will lead to posterization, while using a small working space will lead to clipping. This trade-off is a consideration for the critical image editor
nl: Werkruimten als sRGB of AdobeRGB zijn kleurruimten die goede resultaten mogelijk maken bij het bewerken. Bijvoorbeeld, pixels met gelijke RGB-waarden moeten neutraal lijken. Het gebruik van een werkruimte met brede gamma leidt tot posterkleuren terwijl gebruik van een kleinere werkruimte zal leiden tot afvlakken. De afweging: welke kleurruimte moet de kritische bewerker zelf maken.
uk: Робочі простори, подібні до sRGB або Adobe RGB, полегшують отримання добрих результатів редагування. Наприклад, пікселі з рівними значеннями компонентів трійки RGB виглядають у них нейтральними (сірими). Використання широких (за палітрою) робочих просторів призводить до постеризації, а використання вузьких робочих просторів — до обрізання. Вибір компромісного простору є завданням особи, яка виконує редагування.

source: Well, that quote from wikipedia is about as clear as mud and I don't know if I will be able to explain it more clearly, but I will try. "[P]ixels with equal values of RGB should appear neutral" just means that for any given pixel in an image that has been converted to a suitable working space, if R=G=B you should see grey or black or white on your screen.
nl: Dat citaat uit wikipedia is zo helder als modder. Ik weet niet zeker of ik het duidelijker kan uitleggen maar ik zal het proberen. "[P]ixels met gelijke waarden van RGB moeten neutraal lijken" betekent gewoon dat voor een bepaald pixel in een beeld dat is omgezet naar een geschikte werkruimte geldt: indien R = G = B, u grijs of zwart of wit op uw scherm moet zien.
uk: Гаразд, цитата з Вікіпедії така сама зрозуміла, як складна математична формула. Автор не певний, що йому вдасться розтлумачити це краще, але він спробує. Фраза «пікселі з рівними значеннями компонент у RGB мають виглядати нейтральними» означає, що всі пікселі зображення, яке було перетворено у відповідний робочий простір, з R=G=B, мають виглядати як сірі, чорні або білі на екрані.

source: I am not aware of a list of other technical requirements for a suitable working space, though undoubtedly someone has produced such a list. But most working space profiles are characterized by:
nl: Het bestaan van een lijst met andere technische vereisten voor een passende werkruimte is mij niet bekend. Ongetwijfeld zal er wel iemand zijn die zo'n lijst heeft gemaakt. Maar de meeste werkruimteprofielen worden gekarakteriseerd door:
uk: Автор ніколи не переймався складанням технічних вимог до придатного до використання робочого простору, але, поза всяким сумнівом, хтось вже створив такий список. Більшість профілів робочих просторів мають такі характеристики:

source: RGB primaries which dictate the range of colors, that is, the gamut covered by a given profile.
nl: RGB primaries die de reeks kleuren dicteert, dat wil zeggen, de gamut gedekt door een gegeven profiel
uk: Основні кольори RGB, які визначають діапазон кольорів, тобто палітру кольорів, яку покриває вказаний профіль.

source: White point, usually D50 or D65, which dictates the total dynamic range of the working space, from 0,0,0 (total black) to the brightest possible white.
nl: Witpunt, gewoonlijk D50 of D65, wat de totale dynamische reeks dicteert van de werkruimte, vanaf 0,0,0 (totaal zwart) tot het helderste wit
uk: Точку білого, зазвичай, D50 або D65, яка визначає загальний динамічний діапазон робочого простору, від 0,0,0 (зовсім чорне) до найсвітлішого можливого білого.

source: Gamma.
uk: Гамма.

source: The practical consequences that result from using different RGB primaries, leading to larger or smaller working spaces, are discussed below. The practical consequences for different choices for the working space white point are beyond the scope of this tutorial. Here I will talk a little bit about the practical consequences of the working space gamma (for an excellent article and references, look up gamma on wikipedia).
nl: De praktische consequenties van het gebruik van verschillende primaire kleuren die leiden tot kleinere of grotere werkruimten worden hieronder beschreven. De praktische consequenties van verschillende keuzen van werkruimte-witpunt vallen buiten het bereik van deze zelfstudie. Hier bespreken we alleen iets over de praktische consequenties van het kleurruimte-gamma. (Kijk voor een uitstekend artikel en referenties op wikipedia onder: 'gamma').
uk: Практичні наслідки застосування різних первинних RGB, які відповідають ширшим чи вужчим робочим просторам, ми обговоримо нижче. Практичні наслідки для точки білого робочого простору у разі вибору кожного з варіантів не є предметом цього посібника. Тут ми трохи поговоримо про практичні наслідки для гами робочого простору (чудові відповіді та посилання з цього питання можна знайти у статті щодо гами у Вікіпедії).
