Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/image_editor/color_management.po
Languages: nl, uk

source: Perceptual, also called Image or Maintain Full Gamut. This is generally recommended for photographic images. The color gamut is expanded or compressed when moving between color spaces to maintain consistent overall appearance. Low saturation colors are changed very little. More saturated colors within the gamuts of both spaces may be altered to differentiate them from saturated colors outside the smaller gamut space. Perceptual rendering applies the same gamut compression to all images, even when the image contains no significant out-of-gamut colors.
nl: Perceptueel, ook wel genoemd beeld of volledig gamut behouden. Dit wordt algemeen aanbevolen voor fotografische beelden. Het kleurengamma wordt uitgebreid of gecomprimeerd bij het wisselen tussen kleurruimten om een consistent beeld te behouden. Laag verzadigde beelden worden weinig veranderd. Meer verzadigde beelden binnen het gamma van beide kleurruimten kunnen worden veranderd om ze te onderscheiden van verzadigde kleuren buiten de kleine gammaruimte. Perceptuele weergave-intentie past de zelfde gammacompressie toe op alle beelden, zelfs wanneer een beeld geen noemenswaardige buiten het gamma-vallende kleuren heeft.
uk: Відчуттєве (перцептуальне), також називається відповідним зображенню або таким, що зберігає палітру повністю. Зазвичай, це відтворення рекомендують для фотографічних зображень. Під час перетворення між просторами кольорів палітра кольорів розширюється або стискається з метою збереження загального вигляду. Кольори з низькою насиченістю майже не змінюються. Насиченіші кольори, що потрапляють як до палітри початкового простору, так і до палітри кінцевого простору, змінюються так, щоб їх можна було відрізнити від насичених кольорів поза палітрою простору з вужчою палітрою. За використання відчуттєвого відтворення до всіх зображень застосовується однакове стискання палітри, навіть якщо зображення не містить значних ділянок кольорів поза палітрою.

source: Relative Colorimetric, also called Proof or Preserve Identical Color and White Point. Reproduces in-gamut colors exactly and clips out-of-gamut colors to the nearest reproducible hue.
nl: Relatief Colorimetrisch, ook wel genaamd "Proof" of: "Behoud Identieke Kleur" en witpunt. Reproduceert "in-gamut" kleuren exact en knijpt "buiten-gamut-vallende" kleuren naar de dichtstbijzijnde reproduceerbare tint.
uk: Відносне колориметричне, також називається пробним або таким, що зберігає ідентичні кольори і точку білого. Точно відтворює кольори у межах палітри і обрізає кольори поза палітрою до найближчих у палітрі за відтінком.

source: Absolute Colorimetric, also called Match or Preserve Identical Colors. Reproduces in-gamut colors exactly and clips out-of-gamut colors to the nearest reproducible hue, sacrificing saturation and possibly lightness. On tinted papers, whites may be darkened to keep the hue identical to the original. For example, cyan may be added to the white of a cream-colored paper, effectively darkening the image. Rarely of interest to photographers.
nl: Absoluut Colorimetrisch, ook wel genaamd: overeenkomend, of "Behoud van identieke kleuren". Reproduceert "in-gamut" kleuren exact en knijpt "out-of-gamut" kleur af naar dichtstbijliggende reproduceerbare tint, ten koste van verzadiging en mogelijk van helderheid. Op getint papier kunnen de witten donkerder worden gemaakt om de tint gelijk te houden aan de oorspronkelijke tint. Bijvoorbeeld , Cyaan kan aan wit van een crèmekleurig papier worden toegevoegd waardoor het beeld donkerder wordt. Zelden interessant voor fotografen.
uk: Абсолютне колориметричне, також називається відповідним або таким, що зберігає тотожні кольори. Точно відтворює кольори у межах вужчої палітри і обрізає кольори поза палітрою до найближчих за відтінком кольорів вужчої палітри. Таке перетворення впливає на насиченість та, ймовірно, освітленість. На підфарбованому папері білі кольори можуть стати темнішими для збереження відтінку, тотожного початковому. Наприклад, на папері вершкового кольору до білого кольору може бути додано блакитний, що призведе до помітного затемнення зображення. Це відтворення не дуже цікаве у цифровій фотографії.

source: Saturation, also called Graphic or Preserve Saturation. Maps the saturated primary colors in the source to saturated primary colors in the destination, neglecting differences in hue, saturation, or lightness. For block graphics; rarely of interest to photographers.
nl: Verzadiging, ook wel genoemd: "Grafisch," of "Behoud Verzadiging". Brengt verzadigde primaire kleuren van de bron over naar de verzadigde primaire kleuren van de bestemming met verwaarlozing van de verschillen in tint, verzadiging of helderheid.Voor blokgrafieken; zelden interessant voor fotografen.
uk: За насиченістю, також називається графічним або таким, що зберігає насиченість. Відображає насичені основні кольори джерела у насичені основні кольори призначення без врахування відмінностей у відтінку, насиченості або освітленості. Призначено для блокової графіки, для фотографії має невелике значення.

source: Links
nl: Koppelingen
uk: Посилання

source: `Color wiki <http://www.oyranos.org/wiki/>`_
uk: `Вікі кольорів <http://www.oyranos.org/wiki/>`_

source: `Gamut explained <https://en.wikipedia.org/wiki/Gamut>`_
uk: `Пояснення щодо гами кольорів <https://en.wikipedia.org/wiki/Gamut>`_

source: The Working Space
nl: De werkruimte
uk: Робочий простір

source: Overview
nl: Overzicht
uk: Огляд

source: So I told digiKam where to find my monitor profile and I have a camera profile that I applied to the image file produced by my raw processing software. What's the next step in color management?
nl: Dus vertelde ik digiKam waar het profiel van mijn monitor te vinden is en ik heb een cameraprofiel, dat ik toepaste op het beeldbestand, geleverd door mijn raw-verwerkings-software. Wat is de volgende stap in kleurbeheer?
uk: Так, мною вказано digiKam, де шукати профіль мого монітора, у мене є профіль фотоапарата, який було застосовано до зображення, отриманого моїм програмним забезпеченням з роботи з цифровими негативами. Яким буде наступний крок у керуванні кольорами?

source: You need to choose a working color space so you can edit your image. LCMS will transform your image from your camera color space to your chosen working space, via the PCS specified by your camera color profile. Why cannot I just edit my images in the color space described by the camera profile?
uk: Вам слід вибрати робочий простір кольорів для редагування вашого зображення. LCMS перетворить ваше зображення з простору кольорів вашого фотоапарата до вибраного вами робочого простору за допомогою PCS, що визначається профілем кольорів вашого фотоапарата. Чому б просто не редагувати зображення у просторі кольорів, який описано профілем фотоапарата?

source: After all, the camera profile should provide the best "fit" to the colors recorded by my camera, as processed by my raw processing procedure, right? Wikipedia says, "Working spaces, such as sRGB or Adobe RGB, are color spaces that facilitate good results while editing. For instance, pixels with equal values of RGB should appear neutral." "[P]ixels with equal values of RGB should appear neutral" just means that for any given pixel in an image that has been converted to a suitable working space, if R=G=B you should see grey or black or white on your screen. Many camera profiles violate this "neutral" condition. I am not aware of a list of other technical requirements for a suitable working space. However, I can think of another good reason why you wouldn't want to edit your image in your camera profile color space. If you look at the size of a typical camera profile, it is on the order of a quarter to a half a megabyte or more. It's got a lot of information about all the changes that need to be made at different regions of color and tonality in the original scene, to get accurate color rendition from the RGB values that come out of the raw processor. The camera profile is accurate (at least for colors in the original target) but not particularly mathematically smooth. Working space color profiles, on the other hand, are very small in size (half a kilobyte instead of half a megabyte) because they describe a color gamut in terms of smooth, continuous mathematical functions. Working space profiles don't need to make allowances for the "messiness" of real world sensors, so the mathematical manipulations performed during image editing will go much more smoothly and accurately than if you try to edit your image while it is still in the camera color space.
nl: Uiteindelijk zal het cameraprofiel toch wel het beste passen bij de kleuren die door mijn camera werden geregistreerd en door mijn raw-verwerkende-software verwerkt? Wikipedia zegt: "Werkruimte zoals sRGB of Adobe RGB, zijn kleurruimten die goede resultaten bieden tijdens het bewerken". Bijvoorbeeld, pixels met gelijke waarden van RGB moeten er neutraal uit zien. "Betekent gewoon dat een bepaald pixel in een afbeelding die is omgebouwd naar een geschikte werkruimte, als R = G = B er op het beeldscherm grijs of zwart of wit uit moet zien. "Pixels met gelijke waarden RGB moeten neutraal lijken." Veel cameraprofielen voldoen niet aan deze voorwaarde voor neutraal. Ik ken geen lijst met andere technische eisen voor een geschikte werkruimte. Ik kan wel een andere goede reden bedenken waarom u uw afbeelding niet zou bewerken in uw cameraprofiel. Als u namelijk kijkt naar de omvang van een typisch cameraprofiel dan is dat in de orde van grootte van een kwart tot een half megabyte of meer. Het bevat heel wat informatie over de wijzigingen die moeten worden uitgevoerd op verschillende gebieden van kleur en tonaliteit in de oorspronkelijke scène, om nauwkeurige kleurweergave te krijgen van de RGB-waarden die uit de raw-verwerker komen. Het cameraprofiel is nauwkeurig (althans voor kleuren in het oorspronkelijke target) maar rekenkundig niet bijzonder gaaf. Anderzijds, zijn werkruimte-kleurprofielen erg klein (een half kilobyte in plaats van een half megabyte) omdat ze een kleurengamma beschrijven in termen van mooie, ononderbroken, wiskundige functies. Werkruimteprofielen hoeven geen voorzieningen te treffen voor de "rommelige" werking van sensoren, zodat de wiskundige manipulaties, uitgevoerd tijdens het bewerken van afbeeldingen veel vlotter en nauwkeuriger zullen verlopen dan wanneer u probeert om uw afbeelding te bewerken terwijl die zich nog in de camerakleurruimte bevindt.
uk: В решті решт, профіль фотоапарата має забезпечувати найкращу відповідність до кольорів, які здатен записувати фотоапарат, відповідно до процедури обробки цифрових негативів, чи не так? Вікіпедія повідомляє: «Робочі простори, подібні до sRGB і Adobe RGB, є просторами кольорів, які забезпечують добрі результати у процесі редагування. Наприклад, пікселі з рівними значеннями компонент у RGB мають виглядати нейтральними». Фраза «пікселі з рівними значеннями компонент у RGB мають виглядати нейтральними» означає, що всі пікселі зображення, яке було перетворено у відповідний робочий простір, з R=G=B, мають виглядати як сірі, чорні або білі на екрані. У багатьох профілях фотоапаратів ця умова «нейтральності» порушується. Список інших технічних вимог до доброго робочого простору авторові невідомий, але він може навести інший аргумент на користь відмови від редагування вашого зображення у просторі кольорів вашого фотоапарата. Якщо ви поглянете на розміри файла з даними типового профілю фотоапарата, ви переконаєтеся, що цей файл має розмір від чверті до половини мегабайта або навіть більший. У цьому файлі міститься багато даних щодо всіх змін, які слід виконати для різних областей кольору і тональності початкового зображення, щоб отримати точне відображення кольорів за значеннями RGB, отриманими від інструменту обробки цифрового негатива. Профіль фотоапарата є точним (принаймні для кольорів на знімка), але не є математично гладким. З іншого боку, профілі робочих просторів кольорів є дуже малими за розмірами (половина кілобайта, а не половина мегабайта), оскільки у них палітру кольорів описано у термінах гладких, неперервних математичних функцій. У профілях робочих просторів не потрібно робити допусків на щодо неточність реальних датчиків, отже математичні перетворення, які буде виконано під час редагування зображення, будуть точнішими і гладкішими, ніж були б, якщо б ви спробували редагувати зображення у просторі кольорів фотоапарата.

source: Which working space should I choose?
nl: Welke werkruimte moet ik kiezen?
uk: Яким робочим простором я маю скористатися?

source: Everyone has an opinion. I'm just going to lay out some of the bits of information needed to make an informed choice. Working space profiles are characterized by:
nl: Iedereen heeft een mening. Ik zal een paar stukjes informatie uitleggen die nodig zijn om een onderbouwde keuze te maken. Werkruimteprofielen worden gekenmerkt door:
uk: У будь-кого з цього приводу є власна думка. Викладемо лише базові відомості, які нададуть вам змогу зробити вибір. Робочі профілі просторів кольорів мають такі характеристики:

source: Gamma (or other transfer function), which dictates how much the original linear intensity values captured by the camera sensor (and subjected to the in-camera A-to-D conversion, then interpolated by the raw processing program to produce the image file) are altered to make editing easier or more precise.
nl: Gamma (of een andere overdrachtsfunctie), dat aangeeft hoeveel de oorspronkelijke lineaire intensiteitswaarden, vastgelegd door de camerasensor (en onderworpen aan de in de camera aanwezige Analoog naar Digitaal conversie, en daarna geïnterpoleerd door het raw-verwerkingsprogramma) moet worden gewijzigd om het bewerken gemakkelijker of nauwkeuriger te maken.
uk: Гама (або інша функція перетворення), яка визначає ступінь зміни початкових значень лінійної інтенсивності, яку було виміряно датчиком фотоапарата (і перетворено вбудованою програмою фотоапарата, а потім наближено програмою для обробки цифрових негативів з метою отримання файла зображення), призначеної для того, щоб зробити редагування простішим і точнішим.

source: RGB primaries which dictate the range of colors, that is, the color gamut, covered by a given profile.
nl: RGB primaire kleuren die het kleurengamma bepalen dat binnen het bereik van een bepaald kleurprofiel ligt.
uk: Основні кольори RGB, які визначають діапазон кольорів, тобто палітру кольорів, яку покриває вказаний профіль.

source: White point (usually D50 or D65 though other values may be used), which specifies the color temperature of the white point of the working space.
nl: Witpunt (gewoonlijk D50 of D65, hoewel andere waarden ook gebruikt kunnen worden), dat de kleurtemperatuur van het witpunt in de werkruimte specificeert.
uk: Точка білого (зазвичай, D50 або D65, хоча можливе використання і інших значень), яка вказує температуру кольору точки білого робочого простору.

source: What gamma should my working space have?
nl: Welk gamma moet mijn werkruimte hebben?
uk: Який коефіцієнт контрастності (гаму) повинен мати мій робочий простір?

source: The gamma of a color profile dictates what power transform needs to take place to properly convert from an image's embedded color profile (perhaps your working color space or your camera color profile) to another color profile with a different gamma, such as your chosen working space, or the display profile used to display the image on the screen or perhaps from one working space to another, or perhaps from your working space to your printer's color space. Libraw outputs a 16-bit image with a linear gamma, which means that a histogram of the resulting image file shows the actual amount of light that each pixel on the camera sensor captured during the exposure (paraphrasing this page). (Which is why at present applying a camera profile to the Libraw output also requires applying an appropriate gamma transform to get to the desired working space, unless the camera profile also uses gamma=1.)
uk: Гама профілю кольорів визначає, яке степеневе перетворення слід виконати, щоб належним чином перетворити зображення з вбудованого профілю кольорів зображення (ймовірно, вашого робочого простору кольорів або профілю кольорів вашого фотоапарата) у інший профіль кольорів з іншою гамою, наприклад, вибраний вами робочий простір або профіль показу, який буде використано під час показу зображення на екрані, або з одного робочого простору у інший, або з вашого робочого простору до робочого простору принтера. Після обробки libraw ви отримаєте 16-бітове зображення з лінійною гамою Це означає, що гістограма отриманого файла зображення демонструватиме справжню кількість світла, яку було накопичено кожним елементарним датчиком матриці фотоапарата під час експозиції (взято з звідси). (Ось чому застосування профілю фотоапарата до даних, виведених libraw, також вимагає застосування перетворення гами для переходу до бажаного робочого простору, якщо у профілі фотоапарата не використано значення гама=1.)

source: Theory aside, in the real world of real image editing, almost everyone uses working spaces with either a gamma of either 1.8 or 2.2. sRGB and L*-RGB are two notable exceptions.
nl: Theorie daar gelaten, in de wereld van het beeldbewerking gebruikt bijna iedereen werkruimten met een gamma van ofwel 1,8 of 2,2. Twee opvallende uitzonderingen vormen sRGB en L*-RGB.
uk: Якщо не брати до уваги теоретичні можливості, у реальному світі реального редагування зображень майже всі користуються робочими просторами з коефіцієнтом контрастності (гамою) зі значеннями 1,8 або 2,2. sRGB і L*-RGB є двома єдиними помітними винятками.

source: sRGB uses a transfer function close to that of a CRT (and thus not necessarily relevant to image editing or to display on an LCD). As Wikipedia notes, "Unlike most other RGB color spaces the sRGB gamma can not be expressed as a single numerical value. The overall gamma is approximately 2.2, consisting of a linear (gamma 1.0) section near black, and a non-linear section elsewhere involving a 2.4 exponent and a gamma (slope of log output versus log input) changing from 1.0 through about 2.3" (cited from this page), which makes for some complicated math during image processing.
nl: sRGB gebruikt een overdrachtsfunctie dicht bij die van een CRT (niet relevant voor beeldbewerking op LCD scherm) Wikipedia stelt: "In tegenstelling tot andere RGB kleurruimten, kan sRGB gamma niet worden uitgedrukt in een enkele numerieke waarde "Het over-all gamma is ongeveer 2,2 en bestaat uit een lineaire (gamma 1,0) sectie bijna zwart, en een niet lineaire sectie elders, bevattende een 2,4 exponent en een gamma-helling van log-uitvoer versus log-invoer, veranderend van 1,0 tot ongeveer 2,3." (citaat van : deze pagina), hetgeen zorgt voor enig gecompliceerd rekenwerk gedurende de beeldbewerking.
uk: У sRGB використано функцію перетворення, близьку до функції перетворення моніторів CRT (а отже, не пов’язану з редагуванням зображень чи показом зображень на моніторах LCD) Як зазначено у Вікіпедії, « на відміну від більшості інших просторів кольорів RGB, гаму sRGB не можна вказати як єдине числове значення Загальне значення гами цього простору приблизно дорівнює 2,2, крива перетворення складається з лінійної (гама=1,0) ділянки поряд з чорним кольором і нелінійної ділянки для інших кольорів, де значення змінюється за степеневою функцією порядку 2,4, а гама (нахил на площині з логарифмічними координатами для вхідних і вихідних даних) змінюється від 1,0 до приблизно 2,3» (взято звідси), що призводить до потреби у складних математичних обчисленнях під час обробки зображення.

source: L*-RGB uses as its transfer function the same perceptually uniform transfer function as the CIELab color space. "When storing colors in limited precision values" using a perceptually uniform transfer function "can improve the reproduction of tones" (cited from this page).
nl: L*-RGB hanteert als transferfunctie dezelfde perceptueel uniforme overdrachtsfunctie als de CIELab kleurruimte "Bij het opslaan van kleuren in waarden met beperkte precisie", kan het gebruik van een perceptueel uniforme functie de weergave van kleurtonen verbeteren" (citaat van deze pagina).
uk: У L*-RGB як функцію перетворення використано ту саму відчуттєво однорідну функцію перетворення, що і у просторі кольорів CIELab «У разі зберігання кольорів з обмеженими значеннями точності» за допомогою відчуттєво однорідної функції перетворення «можна покращити відтворення тонів» (взято звідси).

source: In addition to gamma=1.8 and gamma=2.2, the only other gamma for a working space that gets much mention or use is linear gamma, or gamma=1.0. As noted above, Libraw outputs linear gamma files if you ask for 16-bit output. Linear gamma is used in HDR (high dynamic range) imaging and also if one wants to avoid introducing gamma-induced errors into one's regular low dynamic range editing.
uk: Окрім значень гама=1,8 і гама=2,2, єдиним іншим значенням гами для робочого простору, яке заслуговує на згадку, є значення лінійної гами або гама=1,0. Як вже згадувалося, дані, виведені до файлів libraw, мають лінійну гаму, якщо ви виводитимете дані у 16-бітовому форматі. Лінійна гама використовується під час створення зображень HDR (з високим динамічним діапазоном), а також у разі, коли бажано уникати помилок, пов’язаних з гамою, під час редагування звичайних зображень з низьким динамічним діапазоном.
