Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/menu_descriptions/menu_imageeditor.po
Languages: es

source: Contents
es: Contenido

source: The File Menu
es: El menú Archivo

source: File → Back (PgUp)
es: Archivo → Retroceder (RePág)

source: Display the previous image of the current Album.
es: Mostrar la imagen anterior del álbum actual.

source: File → Forward (PgDn)
es: Archivo → Avanzar (AvPág)

source: Display the next image of the current Album.
es: Mostrar la imagen siguiente del álbum actual.

source: File → First (Ctrl+Home)
es: Archivo → Primera (Ctrl+Inicio)

source: Display the first image of current Album.
es: Mostrar la primera imagen del álbum actual.

source: File → Last (Ctrl+End)
es: Archivo → Última (Ctrl+Fin)

source: Display the last image of current Album.
es: Mostrar la última imagen del álbum actual.

source: File → Save (Ctrl+S)
es: Archivo → Guardar (Ctrl+S)

source: Save the current image if it has been modified.
es: Guardar la imagen actual si ha sido modificada.

source: File → Save As...
es: Archivo → Guardar como...

source: Save the current image in a new file.
es: Guardar la imagen actual en un nuevo archivo.

source: File → Revert
es: Archivo → Revertir

source: Restore the current image from the original file if it has been modified.
es: Restaurar la imagen actual del archivo original si ha sido modificada.

source: File → Delete File/Move to trash (Shift+Del)
es: Archivo → Borrar archivo/Mover a la papelera (Mayúsculas+Supr)

source: Delete/Move to trash the current image from the current Album.
es: Eliminar/mover a la papelera la imagen actual del álbum actual.

source: File → Print Image... (Ctrl+P)
es: Archivo → Imprimir imagen... (Ctrl+P)

source: Print the current image.
es: Imprimir la imagen actual.

source: File → Quit (Ctrl+Q)
es: Archivo → Salir (Ctrl+Q)

source: Quit digiKam Image Editor.
es: Salir del editor de imágenes digiKam.

source: The Edit Menu
es: El menú Editar

source: Edit → Copy (Ctrl+C)
es: Editar → Copiar (Ctrl+C)

source: Copy the current image selection in the clipboard.
es: Copiar la imagen actual al portapapeles

source: Edit → Undo (Ctrl+Z)
es: Editar → Deshacer (Ctrl+Z)

source: Cancel the last action applied to the current image using history.
es: Cancelar la última acción aplicada a la imagen actual usando el historial.

source: Edit → Redo (Ctrl+Shift+Z)
es: Editar → Rehacer (Ctrl+Mayúsculas+Z)

source: Redo the last action applied to the current image using history.
es: Rehacer la última acción aplicada a la imagen actual usando el historial.

source: The Color Menu
es: El menú Color

source: Color → Auto-Correction (Ctrl+Shift+B)
es: Color → Autocorrección (Ctrl+Mayúsculas+B)

source: Color → White Balance
es: Color → Balance de blancos

source: Color → Brightness/Contrast/Gamma
es: Color → Brillo/Contraste/Gamma

source: Color → Hue/Saturation/Lightness (Ctrl+U)
es: Color → Tinte/Saturación/Claridad (Ctrl+U)

source: Color → Color Balance (Ctrl+B)
es: Color → Balance de colores (Ctrl+B)

source: Enhance → Curves Adjust
es: Mejorar → Ajuste de curvas

source: Color → Levels Adjust
es: Color → Ajuste de niveles

source: Color → Channel Mixer
es: Color → Mezclador de canales

source: Color → Invert (Ctrl+I)
es: Color → Invertir (Ctrl+I)

source: Invert image colors.
es: Invertir los colores de la imagen.

source: Color → Black & White
es: Color → Blanco y negro

source: Color → Color Management
es: Color → Gestión de color

source: Color → Depth
es: Color → Profundidad

source: Toggle between 8 bit and 16 bit format on color channels.
es: Cambiar el formato entre 8 y 16 bits, en los canales de color.

source: The Enhance Menu
es: El menú Mejorar

source: Enhance → Red Eye Reduction
es: Mejorar → Reducción de ojos rojos

source: Enhance → GMic-Qt
es: Mejorar → GMic-Qt

source: Enhance → Noise Reduction
es: Mejorar → Reducción de ruido

source: Enhance → Restoration
es: Mejorar → Restauración

source: Enhance → Lens Distortion Correction
es: Mejorar → Corrección de la distorsión de la lente

source: The Transform Menu
es: El menú Transformar

source: Transform → Rotate → -90 degrees (Ctrl+Shift+Left)
es: Transformar → Girar → -90 grados (Ctrl+Mayúsculas+Izquierda)

source: Left rotation of the current image.
es: Rotación a la izquierda de la imagen actual.

source: Transform → Rotate → 90 degrees (Ctrl+Shift+Right)
es: Transformar → Girar → 90 grados (Ctrl+Mayúsculas+Derecha)

source: 90 degrees rotation of the current image.
es: Rotar la imagen actual 90 grados.

source: Transform → Free Rotation
es: Transformar → Giro libre

source: Transform → Flip → Horizontally (Ctrl+*)
es: Transformar → Invertir → Horizontalmente (Ctrl+*)

source: Horizontal flip of the current image.
es: Inversión horizontal de la imagen actual.

source: Transform → Flip → Vertically (Ctrl+/)
es: Transformar → Invertir → Verticalmente (Ctrl+/)

source: Vertical flip of the current image.
es: Inversión vertical de la imagen actual.

source: Transform → Crop (Ctrl+X)
es: Transformar → Recortar (Ctrl+X)

source: Transform → Resize
es: Transformar → Cambiar tamaño

source: Transform → Perspective Adjustment
es: Transformar → Ajuste de la perspectiva

source: The Decorate Menu
es: El menú Decorar

source: Decorate → Apply Texture
es: Decorar → Aplicar textura

source: Decorate → Add Border
es: Decorar → Añadir borde

source: Decorate → Insert Text
es: Decorar → Insertar texto

source: The Effects Menu
es: El menú Efectos

source: Effects → Color Effects
es: Efectos → Efectos de color

source: Effects → Add Film Grain
es: Efectos → Añadir grano de película

source: Effects → Oil paint
es: Efectos → Pintura al óleo

source: Effects → Charcoal Drawing
es: Efectos → Dibujo al carboncillo

source: Effects → Distortion Effects
es: Efectos → Efectos de distorsión

source: Effects → Raindrops
es: Efectos → Gotas de lluvia

source: Image Editor filter to add Rain Drops (help).
es: Filtro del editor de imágenes para añadir gotas de lluvia (ayuda).

source: The View Menu
es: El menú Ver

source: View → Zoom In (Ctrl++)
es: Ver → Acercar (Ctrl++)

source: Increase the zoom factor on the current image.
es: Aumentar el factor de zum de la imagen actual.

source: View → Zoom Out (Ctrl+-)
es: Ver → Alejar (Ctrl+-)

source: Decrease the zoom factor on the current image.
es: Disminuir el factor de zum de la imagen actual.

source: View → Fit to Window (Ctrl+Shift+A)
es: Ver → Ajustar a la ventana (Ctrl+Mayúsculas+A)

source: View → Fit to Selection (Ctrl+Shift+S)
es: Ver → Ajustar a la selección (Ctrl+Mayúsculas+S)

source: Make the selection fit the window.
es: Ajusta la selección a la ventana.

source: View → Histogram
es: Ver → Histograma

source: View → Slideshow
es: Ver → Presentación

source: Start a slideshow of the current album.
es: Iniciar una presentación del álbum actual.

source: The Settings Menu
es: El menú Preferencias

source: Settings → Full Screen Mode (Ctrl+Shift+F)
es: Preferencias → Modo a pantalla completa (Ctrl+Mayúsculas+F)

source: Toggles the graphic interface to full screen mode.
es: Conmuta el modo a pantalla completa de la interfaz gráfica.

source: Settings → Configure Shortcuts
es: Preferencias → Configurar accesos rápidos de teclado

source: Configure the digiKam image editor shortcuts.
es: Configurar los accesos rápidos de teclado del editor de imágenes digiKam.

source: Settings → Configure Toolbars
es: Preferencias → Configurar barras de herramientas

source: Configure the digiKam image editor toolbars.
es: Configurar las barras de herramientas del editor de imágenes digiKam.

source: The Help Menu
es: El menú Ayuda

source: Help → digiKam Handbook (F1)
es: Ayuda → Manual de digiKam (F1)

source: Help → What's This? (Shift+F1)
es: Ayuda → ¿Qué es esto? (Mayúsculas+F1)

source: Help → Report Bug...
es: Ayuda → Informar de un error...

source: Help → Switch Application Language...
es: Ayuda → Cambiar el idioma de la aplicación...

source: Help → About digiKam
es: Ayuda → Acerca de digiKam
