Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/setup_application/collections_settings.po
Languages: pt

source: digiKam Collections Settings
pt: Configuração das Colecções do digiKam

source: digiKam, documentation, user manual, photo management, open source, free, learn, easy, collection, setup, configure
pt: digiKam, documentação, manual do utilizador, gestão de fotografias, código aberto, livre, aprender, fácil, colecção, configuração

source: Collections Settings
pt: Configuração das Colecções

source: Contents
pt: Conteúdo

source: Setup Root Album Folders
pt: Configuração das Pastas de Topo dos Álbuns

source: This view manages your **Album Collections** handled by the database. Each Collection represents a **Root Album Folder** containing your photographs or videos. Usually the root folder will contain sub folders. All these folders we call **Albums**. How to work with them, create, delete, rename them etc. is described in detail to :ref:`the Album section <albums_view>`.
pt: Esta área faz a gestão das suas **Colecções de Álbuns** tratadas pela base de dados. Cada colecção representa uma **Pasta de Topo do Álbum**, contendo as suas fotografias ou vídeos. Normalmente a pasta de topo irá conter sub-pastas. Todas essas pastas são tratadas como **Álbuns**. Como poderá lidar com elas, criar, remover, mudar de nome, etc., está descrito em detalhe na :ref:`secção do Álbum <albums_view>`.

source: The digiKam Collections Configuration Page with the List of Root Album Folders
pt: A Página de Configuração das Colecções do digiKam com a Lista de Pastas de Topo dos Álbuns

source: The **Root Album Folders** list three types of collection which can be referenced in digiKam:
pt: A lista de **Pastas de Topo dos Álbuns** apresenta três tipos de colecções que poderão ser referenciados no digiKam:

source: **Local Collections**: these are root album folders stored physically on your computer drives.
pt: **Colecções Locais**: estas são pastas de topo dos álbuns que são guardadas fisicamente nos discos do seu computador.

source: **Collections on Removable Media**: these are root album folders stored on media which can be removed from your computer, as USB keys, external drives, DVD.
pt: **Colecções em Dispositivos Removíveis**: estas são pastas de topo dos álbuns que estão guardadas em dispositivos que podem ser removidos do seu computador, como as chaves USB, discos externos, DVD's, etc.

source: The **Monitor the Albums for External Changes** option will trigger the database to update information. This can be a time-consuming operation especially under macOS and with network file system.
pt: A opção **Monitorizar os Álbuns por Alterações Externas** irá indicar à base de dados para actualizar as informações. Isto pode ser uma operação demorada, especialmente no macOS e com sistemas de ficheiros em rede.

source: Ignore Directories from your Collections
pt: Ignorar as Pastas das suas Colecções

source: The **Ignored Directories** view allows to setup the list of the directories to ignore while scanning collection contents. The directory names are case sensitive and must be separated by semicolon.
pt: A área de **Pastas Ignoradas** permite configurar a lista de pastas a ignorar quando sondar o conteúdo da colecção. Os nomes das pastas fazem distinção entre maiúsculas e minúsculas e devem estar separados por ponto-e-vírgula.

source: The digiKam Collections Configuration Page with the List of Ignored Directories
pt: A Página de Configuração das Colecções do digiKam com a Lista de Pastas Ignoradas
