Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/post_processing/ocrtext_converter.po
Languages: uk

source: The digiKam OCR Text Converter
uk: Засіб розпізнавання тексту у digiKam

source: digiKam, documentation, user manual, photo management, open source, free, learn, easy, ocr, text
uk: digiKam, документація, підручник користувача, керування фотографій, відкритий код, вільний, навчання, простий, розпізнавання, текст

source: OCR Text Converter
uk: Перетворювач зображення на текст

source: Contents
uk: Зміст

source: The OCR text converter is a tool to parse contents of an image and detect area with text to convert in editable and translatable characters files.
uk: Засіб розпізнавання тексту є інструментом для обробки вмісту зображення та виявлення областей з текстом з метою перетворення цих областей на придатні до редагування і перекладу текстові файли.

source: The tool can batch optical character recognition (OCR) over images, and their translations in many languages using online translator engine. It also allows you to review the text and make corrections and offers spell checking.
uk: Інструмент може виконувати пакетне розпізнавання символів на зображеннях і виконувати переклад тексту багатьма мовами за допомогою інтернет-рушія перекладу. Також він надає вам змогу рецензування тексту та внесення змін та пропонує послуги з перевірки правопису.

source: The tool use in background the `Tesseract <https://en.wikipedia.org/wiki/Tesseract_(software)>`_, a powerful open-source optical character recognition engine available for Linux, macOS, and Windows.
uk: Інструмент використовує у фоновому режимі `Tesseract <https://en.wikipedia.org/wiki/Tesseract_(software)>`_, потужний рушій розпізнавання символів з відкритим кодом, який доступний у Linux, macOS і Windows.

source: To perform text conversions, select the scanned images including text to recognize and start tool from the menu :menuselection:`Tools --> OCR Text Converter`, or use the icon **OCR Text Converter** from the **Tools** tab on right sidebar. The following dialog must appears:
uk: Щоб виконати розпізнавання тексту, виберіть скановані зображення, на яких є текст для розпізнавання, і запустіть інструмент за допомогою пункту меню :menuselection:`Інструменти --> Перетворювач зображення на текст` або скористайтеся піктограмою **Перетворювач зображення на текст** з вкладки **Інструменти** на правій бічній панелі. Має з'явитися таке діалогове вікно:

source: The digiKam OCR Text Converter Dialog
uk: Вікно засобу розпізнавання тексту у digiKam

source: The digiKam OCR Text Converter Content Review
uk: Перегляд вмісту у засобі розпізнавання тексту digiKam
