Repository: ANUSHRAV01/digikam-doc
Catalog: locale/*/LC_MESSAGES/post_processing/pano_creator.po
Languages: ca, es

source: The digiKam Panorama Creator
ca: El creador de panorames en el digiKam
es: El creador de panoramas de digiKam

source: digiKam, documentation, user manual, photo management, open source, free, learn, easy, panorama, assembly, stitch
ca: digiKam, documentació, manual d'usuari, gestió de les fotografies, codi obert, lliure, aprenentatge, fàcil, panorama, munta, uneix

source: Panorama Creator
ca: Creador de panorames
es: Creador de panoramas

source: Contents
ca: Contingut
es: Contenido

source: A panorama is a composition of photo taken in the same conditions with the same camera/lens. The camera turn around the same point of view to shot with many photos a wide-angle view which is a representation of a large physical space. Images must be taken with superimposed area on the borders. Algorithm will try to found the common portions of images to join and merge contents. To be sure about stability you can use a tripod especially with complex compositions. The tool allows to assemble shots taken horizontally, vertically, or as a matrix.
ca: Un panorama és una composició de fotografies capturades en les mateixes condicions amb la mateixa càmera/lent. La càmera gira al voltant del mateix punt de vista amb un gran angular capturant moltes fotografies d'un gran espai físic. Les imatges s'han de prendre amb una àrea superposada a les vores. L'algorisme intentarà trobar les parts comunes de les imatges per a unir i fusionar el contingut. Per estar segur de l'estabilitat, podeu utilitzar un trípode, especialment amb les composicions complexes. L'eina permet muntar les captures preses de forma horitzontal, vertical o en matriu.

source: Take a care that target panorama is a huge amount of data and require a lots of memory to be processed.
ca: Aneu amb compte, ja que el panorama de destinació serà una gran quantitat de dades i requerirà molta memòria per a processar-lo.

source: Select the images that you want to stitch and go to :menuselection:`Tools --> Create Panorama` a wizard dialog will open up as below.
ca: Seleccioneu les imatges que voleu unir i aneu a l'element de menú «:menuselection:`Eines -> Crea un panorama`», s'obrirà un diàleg de l'assistent com es mostra a continuació.

source: The Panorama Creator Wizard with the Huggin Components Detection
ca: L'assistent del Creador de panorames amb la detecció de components del Huggin

source: This plugin is based on the `Hugin command line tools <https://hugin.sourceforge.io/>`_ to analyze and assemble the items. If all software components are found on your system, just select the output format that you prefer to render the panorama and click on **Next** button. The page below must appears:
ca: Per analitzar i muntar els elements, aquest connector es basa en les `eines de línia d'ordres del Hugin <https://hugin.sourceforge.io/>`_. Si es troben tots els components de programari en el vostre sistema, senzillament seleccioneu qualsevol format de sortida que preferiu per a renderitzar el panorama i feu clic en el botó **Següent**. Hauria d'aparèixer la pàgina següent:

source: The Panorama Creator Wizard with the List of Items to Assemble
ca: L'assistent del Creador de panorames amb la llista d'elements per a muntar

source: Arrange the images in correct order if they are not, using the **up** and **down** buttons. Use the buttons with the **plus** and **minus** symbols to add or remove items. If you want to render a 360° panorama, the first image from the list will be the item placed on the center of the panorama. When all is done, click on **Next** button.
ca: Si no ho estan, organitzeu les imatges en l'ordre correcte, utilitzeu els botons **Amunt** i **Avall**, Utilitzeu els botons amb els símbols **més** i **menys** per a afegir o eliminar elements. Si voleu renderitzar una panoràmica de 360°, la primera imatge de la llista serà l'element col·locat al centre del panorama. Quan tot estigui llest, feu clic en l botó **Següent**.

source: The Panorama Creator Wizard Pre-Processing Stage
ca: L'assistent del Creador de panorames en l'etapa de preprocessament

source: The option **Detect moving skies** allows an automatic detection of clouds to prevent wrong key-points matching between images due to moving shapes. To be more precise, during the control points selection, the process discards any points that are associated to a possible cloud. This is useful to prevent moving clouds from altering the control points matching process do by the algorithms. Depending of the scene contents, turn on the option and press **Next** button to pre-process items.
ca: L'opció **Detecta el moviment del cel** permet una detecció automàtica dels núvols per a evitar coincidències incorrectes en els punts clau entre imatges per a formes en moviment. Per ser més precisos, durant la selecció dels punts de control, el procés descarta aquells punts que estiguin associats amb un possible núvol. Això és útil per a evitar que els núvols en moviment alterin el procés de coincidència dels punts de control que fan els algorismes. Activeu l'opció segons el contingut de l'escena i premeu el botó **Següent** per a preprocessar els elements.

source: The Panorama Creator Wizard Optimizations Stage
ca: L'assistent del Creador de panorames en l'etapa de les optimitzacions

source: The optimizations page includes another option named **Level horizon** dedicated for horizontal scene. Turn on this setting to detect the horizon and adapt the projection accordingly. The detected horizon will be an horizontal line in the final panorama. If you scene is a vertical composition, you can ignore this setting. Click on the **Next** button to preview the result.
ca: La pàgina d'optimitzacions inclou una altra opció anomenada **Nivell de l'horitzó** dedicada a l'escena horitzontal. Activeu-la per a detectar l'horitzó i adaptar la projecció en conseqüència. L'horitzó detectat serà una línia horitzontal en el panorama final. Si la vostra escena és una composició vertical, podreu ignorar aquesta opció de configuració. Feu clic en el botó **Següent** per a obtenir una vista prèvia del resultat.

source: The Panorama Creator Wizard Preview Stage
ca: L'assistent del Creador de panorames en l'etapa de la vista prèvia

source: In this page the images are assembled, you can judge of the result, and crop the contents to drop black frames around your scene. By default, the tool is able to detect automatically the effective region of the panorama. If you move the mouse over the preview canvas, a toolbar must appears on top left corner to **Zoom In**, **Zoom Out**, and **Zoom to Fit** on the image. With a right click with the mouse, you can re-define a new crop area. When all in fine, click on **Next** button to process final composing of the panorama.
ca: En aquesta pàgina, es munten les imatges, podreu jutjar el resultat i retallar el contingut per a col·locar marcs negres al voltant de l'escena. De manera predeterminada, l'eina pot detectar automàticament la regió efectiva del panorama. Si moveu el ratolí sobre el llenç de vista prèvia, apareixerà una barra d'eines a la cantonada superior esquerra per a fer **Apropa**, **Allunya** i **Zoom fins que ajusti** sobre la imatge. Amb un clic dret amb el ratolí, podreu tornar a definir una àrea nova de retallat. Quan tot estigui bé, feu clic en el botó **Següent** per a processar la composició final del panorama.

source: The Last Page of the Panorama Creator Wizard
ca: La darrera pàgina de l'assistent del Creador de panorames

source: After a long computation, panorama stitching will be complete and the tool will propose a template name for the target file. If you want you can also save your project compatible with Hugin. Click on **Finish** button and you will see the output in the same **Album** as your original pictures.
ca: Després d'un càlcul llarg, es completarà la unió del panorama i l'eina proposarà un nom de plantilla per al fitxer de destinació. Si voleu també podreu desar el vostre projecte compatible amb Hugin. Feu clic en el botó **Finalitza** i veureu la sortida al mateix **àlbum** que les imatges originals.

source: digiKam, documentation, user manual, photo management, open source, free, learn, easy, panorama, assembly
es: digiKam, documentación, manual del usuario, gestión de fotos, gestión fotográfica, código abierto, libre, gratis, aprender, fácil, panorama, ensamblar

source: One of the most exciting tools available in digiKam and Showfoto is the Panorama tool. Which is simple and quite effective.
es: Una de las herramientas más emocionantes disponibles en digiKam y Showfoto es la herramienta de panoramas, que es sencilla y bastante efectiva.

source: Select the images that you want to stitch and go to Tools -> Stitch images into a panorama and the wizard open up.
es: Seleccione las imágenes que desea unir y vaya a «Herramientas -> Unir imágenes en un panorama» para abrir el asistente.

source: Starting the Wizard
es: Inicio del asistente

source: Select any output format that you prefer and click Next. And this window appears:
es: Seleccione el formato de salida que prefiera y pulse «Siguiente» para que aparezca la siguiente ventana:

source: Arrange the images in correct order if they are not, use the up and down arrows, click the icon with the red cross to remove any images and click Next.
es: Organice las imágenes en el orden correcto si no lo estuvieran ya. Use las flechas «Arriba» y «Abajo». Pulse el icono con la cruz roja para eliminar imágenes y pulse «Siguiente».

source: If you want the tool Detect moving skies then click the option and press Next to proceed.
es: Si quiere que la herramienta detecte cielos en movimiento, marque la opción y pulse «Siguiente» para continuar.

source: Post processing begins and when it is done click Next.
es: El postprocesamiento empezará. Cuando termine, pulse «Siguiente».

source: In this window the images are being processed! When done click next.
es: Las imágenes que se están procesando aparecen en esta ventana. Pulse «Siguiente» cuando termine.

source: Panorama stitching is now done. If you want you can now save your project. The same project files can be used in hugin, if I'm not mistaken, since this tool uses hugin! Click Next and you will see the output in the same folder as your original pictures. Here is what I got.
es: La unión en panorama ya ha terminado. Si lo desea, puede guardar el proyecto en este momento. Si no estoy equivocado, puede usar estos mismos archivos de proyecto en Hugin, ya que esta herramienta usa Hugin. Pulse «Siguiente» para ver la salida en la misma carpeta que las imágenes originales. Esto es lo que se ha obtenido.
